[{"id": "0dea6f59-9fc0-406c-857e-7aab3d68d9bc", "year_model": "2027", "ship_name": "Project 23900 UDC", "ship_type": "Helicopter Carrier / Amphibious Assault Vessel"}, {"id": "b404bda6-91ca-4680-b1b8-c9e0276b033f", "year_model": "2022", "description": "\r\n        \tBelgorod (K-329) is a new Russian Navy nuclear-powered, nuclear-capable submarine belonging to the Project 949A \"Antei\" class (NATO codename of \"Oscar II\". The class includes Kursk which was lost in August 2000 with all hand aboard and features several hulls which have already been retired and/or scrapped (K-525, K-206, K-148, K-173). Belgorod followed Kursk in the construction line and marks possibly the last boat to be introduced in the series.\n\r\nWhile her hull was originally laid down during July of 1992, the vessel was repurposed for the Special Operations role and reworked beginning in December 2012. She entered sea trials in June of 2021 and is expected to be commissioned during the middle of 2022, set to become part of a new series of strategic-level weapons announced by Russian leadership.\n\r\nWith this change, the boat does not include torpedo armament as her sisters do. Instead, she carries up to six \"Poseidon\" (NATO: \"Kanyon\") Unmanned Underwater Vehicles (UUVs) which were known earlier to the Russians as \"Status-6\". The drones are nuclear-powered, nuclear-armed and autonomous by design with development undertaken by the Rubin Design Bureau. The system was unveiled as early as 2015 in official sources.\n\r\nThe vessel has a typically tubular hull design with a forward set sail of some length. The sail contains the bridge as well as necessary communications, periscopes, snorkels, and sensor masts. Dive planes are mounted at the hull as opposed to the sail and the tail fins are arranged in typical cross-pattern with an extended vertical surface plane. The propeller units extend some distance aft on the boat's hull.\n\r\nInternally, there is a crew of 110 broken down into several operating teams. The boat can stay on station / patrol for up to 120 days depending on onboard food storage and supplies. With its twin pressurized nuclear reactors, the vessel has an essentially unlimited range making it an ideal strategic weapon / deterrent. The hull has been tested to 500 meters and submerged, ocean-going speeds reach an impressive 32 knots.\n\r\nDimensions include a hull length of 603.7 feet with a beam measuring 49.2 feet.\n\r\nAs of May 2022, the vessel homeports out of Severodvinsk, Russia and is undergoing sea trials.\r\n\t\t", "ship_name": "Belgorod K-329 (Project 949A)", "ship_type": "Nuclear-Powered Special Operations Submarine"}, {"id": "fd20b2bb-3d25-4a8a-8716-4df53b6a3e4d", "year_model": "2020", "ship_name": "Admiral Kasatonov (431)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "54203c8d-b8d9-4c96-98a6-c28b205f90f3", "year_model": "2019", "ship_name": "Dmitry Rogachev (375) / (Project 22160)", "ship_type": "Patrol Vessel"}, {"id": "1d99f74b-4de9-4a23-a1df-997c75ae8954", "year_model": "2018", "ship_name": "Gremyashchiy (Project 20385)", "ship_type": "Guided-Missile Stealth Corvette Warship"}, {"id": "a1f9744e-3cd3-4e12-b6cb-8d0769934314", "year_model": "2018", "ship_name": "Gromkiy (335) (Project 20381)", "ship_type": "Guided-Missile Corvette Warship"}, {"id": "dff6fa4f-bf7f-415b-aa34-74fda118c694", "year_model": "2018", "ship_name": "Vasily Bykov (368) / (Project 22160)", "ship_type": "Patrol Ship"}, {"id": "8ff54eba-09a2-4e4e-8629-28d9bfd66068", "year_model": "2017", "ship_name": "Admiral Gorshkov (417)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "9d655829-1d9e-424d-8a75-20710cb9c210", "year_model": "2017", "description": "\r\n        \tThe Admiral Grigorovich-class of guided-missile frigates serving the Russian Navy has a planned strength of six ships. The group is led by Admiral Grigorovich (745) herself and currently (2018) includes Admiral Essen (751) and Admiral Makarov (799). Planned ships are Admiral Nutakov, Admiral Istomin, and Admiral Kornilov. All three completed ships are in active service with the Black Sea Fleet. Admiral Makarov, the focus of this article, was laid down at the Yantar Shipyard of Kaliningrad, Russia on February 29th, 2012. She was launched on September 2nd, 2015 and formally commissioned for service on December 27th, 2017 - making her one of the newest additions to the Russian Fleet.\n\r\nAdmiral Makarov is an all-modern warship with stealth features and a low-profile. It sports a slab-sided design, keeping protrusions to a minimum, and features a slew of advanced processing systems and weaponry to suit many maritime roles including airspace deterrence, offshore assault, and fleet support. The smoke funnel is all-enclosed and of a low-profile design. The main mast is also of a low-profile approach, outfitted with a bulk of the sensors and processing systems needed to make the Makarov a suitable modern fighting vessel. Over the stern is a helicopter flight deck suitable for support of a single Kamov Ka-27 navalized helicopter or similar vehicle. A hangar offers full-service capabilities and can house a second helicopter if need be.\n\r\nUnder standard load, the ship displaces 3,620 tons and, under full load, this balloons to 4,035 tons. Overall length reaches 410 feet while the beam measures 50 feet and the draught just 14 feet. Power is through a COGAG (COmbined Gas-And-Gas) arrangement which pairs 2 x DS-71 gas turbines outputting 8,450 horsepower for cruising actions and 2 x DT-59 gas turbines outputting 22,000 horsepower for dash actions. Total output becomes 60,900 horsepower and this is used to drive 2 x Shafts under stern.\n\r\nThe propulsion scheme allows the vessel to make headway at 30 knots and reach out to ranges of 4,850 nautical miles.\n\r\nAboard is a crew complement of about 200 personnel. Onboard stores allow the vessel to stay at-sea for about one month.\n\r\nThe Fregat M2EM serves in the air-search role while the 3Rs-25E Garpun-B, MR-212/201-1, and Nucleus-2 6000A all form the surface-search suite. Fire Control is directed by the JSC-5P-10E \"Puma\", 3R14N-11356, and the MR-90 Orekh SAM systems. Electronic Warfare (EW) involves the TK-25E-5 suite and 4 x KT-216 systems are used to launch decoys.\n\r\nInstalled armament is comprised of a mix of ballistic and missile weapon types. 1 x 100mm A-190 Arsenal turreted main gun is seated over the forecastle. 1 x 8-cell UKSK Vertical Launch System (VLS) can fire both Kalibr and 3M55 Oniks surface-to-surface missiles at range. 2 x 12-cell VLSs are used to house 3S90M Shtil-1 series surface-to-air missiles. Additional anti-aircraft defense is through 8 x Igla-1E missile launchers and 2 x Kashtan Close-In Weapon Systems (CIWSs). 2 x Twin-tubed 533mm torpedo launchers can counter surface and submarine threats while the latter threat is also addressed by installation of the RBU-6000 Anti-Submarine ROCket (ASROC) launcher unit.\n\r\nAdmiral Makarov maintains an active status in the Russian Fleet as of this writing (2018).\r\n\t\t", "ship_name": "Admiral Makarov (799)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "2a77f7b4-4fb2-4f4d-a7a8-6b0be5c21bb1", "year_model": "2016", "ship_name": "Admiral Essen (751)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "81ae80a6-e277-4320-a45c-118d8052de9a", "year_model": "2016", "ship_name": "Admiral Grigorovich (745)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "d3ce9a12-2f1a-4850-9d19-81783edce872", "year_model": "2014", "ship_name": "Vladimir Monomakh (K-551)", "ship_type": "Nuclear-Powered Ballistic Missile Attack Submarine"}, {"id": "362bc2a8-ae7b-4331-8bd9-19454c822e9b", "year_model": "2013", "description": "\r\n        \tThe Alexander Nevsky (K-550) is a relatively new ballistic missile submarine commissioned by the Russian Navy as part of a major rearmament and modernization program concerning all of the main Russian service branches. The vessel is nuclear-powered, giving it essentially unlimited range under water, while its armament fit gives it the capability to deliver nuclear payloads. Such power serves as both a deterrence and a defense against foreign meddling and military incursions against the Russian state.\n\r\nThe Nevsky began its construction on March 19th, 2004 by shipbuilder Sevmash of Severodvinsk, Russia. She was launched on December 6th, 2010, conducted her sea trials during 2011 and was formally commissioned on December 23rd, 2013 as the second boat of the advanced Borei-class of ballistic missile submarines. The class represents the Russian Navy's first such vessels to be commissioned since the end of the Cold War (1947-1991). Led by the Yury Dolgorukiy, the group was adopted as a successor to the \"Delta III\" and \"Delta IV\" series boats (detailed elsewhere on this site) as well as the massive \"Typhoon\" line of the Soviet era. A total of eight to ten boats are intended for the class.\n\r\nThe vessel displaces at 14,720 tons (short) when surfaced and 24,000 tons (short) when submerged. Its dimensions include a running length of 557.8 feet, a beam of 44.2 feet, and a draught of 32.9 feet. Her profile is very traditional with a rounded nosecone, forward-set sail, and finned aft section. Along her spine and aft of the sail are the Vertical Launch Systems (VLSs) for her primary nuclear payload while her bow contains conventional torpedo launchers. Propulsion is by way of an OK-650B nuclear reactor along with an AEU steam turbine driving a single shaft. Maximum speeds reach 28 knots making her a very fast submarine while attention has been paid to her construction in regards to helping her run quiet. The typical crew complement is 130 officers and enlisted.\n\r\nIn terms of armament, the primary war load of the Nevsky is 16 x 3M30 \"Bulava\" (NATO: SS-NX-32) Submarine-Launched Ballistic Missiles (SLBMs). These three-stage, solid-fuel/liquid-propellant systems stand some forty feet tall and feature a 6.6 foot diameter, capped by a warhead which can fit up to ten re-entry vehicles each featuring a nuclear yield of 150 kilotons. The submarine also carries a basic torpedo-launching function made up of 21\" (533mm) six tubes and these also support the launching of RPK-2 \"Viyuga\" cruise missiles against land-/ship-based targets.\n\r\nDespite setbacks in the Bulava missile program, the Nevky's commissioning was pushed forward. It is said that the vessel has already completed successful launching of the troublesome missile which is a good step forward for the class as it grows to strength. As of this writing (2015), the Alexander Nevsky maintains an active presence in the Russian Fleet.\r\n\t\t", "ship_name": "Alexander Nevsky (K-550)", "ship_type": "Nuclear-Powered Ballistic Missile Attack Submarine"}, {"id": "27f79b27-6d2a-40db-83e5-9681dc8926cf", "year_model": "2013", "description": "\r\n        \tThe modern Russian Navy currently (2017) fields five Steregushchiy-class guided-missile corvettes. Some twelve are planned with seven completed and five in active service. Among the group is the Boikiy (532) built by Sevemaya Verf of St. Petersburg. Her keel was laid down on July 27th, 2005 and she was launched to sea on April 15th, 2011. The warship was formally commissioned on May 16th, 2013 and is assigned to the Baltic Sea Fleet.\n\r\nBoikiy displaces 2,100 tons under full load and has a length of 343 feet, a beam of 36 feet and a draught of 12 feet. Her propulsion scheme is a COmbined Diesel And Diesel (CODAD) arrangement allowing either full use, or partial use, of the marine diesels to accomplish full-speed dashing actions or general cruising as an economical measure as needed. Power is through 4 x 16D49 series diesel units developing 24,000 horsepower to 2 x shafts. 4 x Diesel generators (630 kW output) are also installed. This arrangement allows the warship to make headway at 26 knots and range out to 4,000 nautical miles. Endurance with onboard stores and fuel supply is about fifteen days for the crew of 100.\n\r\nThe Boikiy mounts the Furke-E 3D air-search radar and the TK-25E-5 Electronic CounterMeasures (ECM) systems. 4 x PK-10 series launchers serve decoys as needed. Armament is 1 x 100mm A-190 turreted deck gun along with 2 x AK-630M Close-In Weapon Systems (CIWSs). 2 x 4 330mm torpedo tubes are also carried as are 2 x 14.5mm MTPU heavy machine guns for extreme-close-range actions.\n\r\nAt the heart of the Boikiy's armament suite, however, is the 32-cell missile launcher housing either 9M96E/M or 9M100 Surface-to-Air Missiles (SAMs). There are also 8 x 3M24 missile launchers featured allowing the warship to tackle just about any incoming ranged threat. To further broaden the vessel's over-the-horizon capabilities is a helipad set over the stern managing a single Kamov Ka-27 Anti-Submarine / Anti-Ship helicopter.\n\r\nThe Boikiy's silhouette is very modern with most of the mass centered on the superstructure. The superstructure is well-contoured to the existing shape of the hull, reducing protrusions that may increase the vessel's signature to prying radar systems. Over the forecastle is the turret housing the main deck gun. The bridge is integrated into the superstructure and offers a commanding view over the forecastle and to port and starboard. The smoke funnel is also integrated and of a low-profile design. The superstructure is stepped down towards the stern helipad deck.\n\r\nBoikiy was one of the Russian warships featured in the April 2017 incident in which several ships passed through the English Channel and were noted by the British Royal Navy. HMS Sutherland was called to escort the ships as they passed through the waters.\r\n\t\t", "ship_name": "Boikiy (532)", "ship_type": "Guide-Missile Corvette / Frigate Warship"}, {"id": "78ccd7fd-c963-4b13-bdb4-49675acf3155", "year_model": "2013", "ship_name": "Severodvinsk / Yasen-class (Project 885/885M)", "ship_type": "Nuclear-Powered Attack Submarine"}, {"id": "8611d06e-ff97-4f1a-a2f6-51258976b4a3", "year_model": "2013", "description": "\r\n        \tFor 2013, the Russian Navy is continuing its programs that will see all-new nuclear-attack submarines, missile-minded frigates, advanced helicopter carriers and fast missile corvettes join the modernization initiative. Decades removed from the disastrous turnover experienced at the end of the Cold War, the Russian military budget is consistently growing in an effort to reassert Mother Russia's will in the Asia-Pacific and central Asian regions. One procurement program has produced fruit to become the Borei-class ballistic missile submarine which has since yielded its first vessel-in-class - the \"Yuri Dolgoruky\" (K-535). The Dolgoruky was laid down on November 2nd, 1996 and officially launched on February 13th, 2008. She was formally commissioned on January 10th, 2013. Construction of the boat was handled by Sevmash in Northwest Russia.\n\r\nOutwardly, the Dolgoruky exhibits a conventionally-arranged exterior with a largely cylindrical hull design capped by a bulbous nose cone, the hull running rearwards in a long grand shape before tapering at the stern. The sail is set ahead of amidships while the tail consists of dorsal and ventral vertical tail fins to serve as the rudder with horizontal planes straddling either side of the rear hull. The propeller extends a short distance away from the tail unit. Dimensionally, the Dolgoruky is a massive machine, measuring 170 meters from bow to stern while showcasing a beam of 13.5 meters with draught of 10 meters and carrying a submerged displacement of 24,000 tons. The boat is crewed by 130 officers and sailors divided into shifts with access to onboard shower, dining and sleeping facilities as standard. Power for the Dolgoruky is primarily served through a single OK-650B series nuclear reactor which provides for essentially unlimited operational ranges and decades of service following proper maintenance routines. The nuclear propulsion system is coupled to an AEU steam turbine and the configuration drives a single shaft at the extreme rear of the vessel. A maximum surface speed of 25 knots is listed with a suggested submerged speed of 32 knots being estimated.\n\r\nOverall, production of the Dolgoruky was slow by modern standards as showcased by its laid-down year of 1996 and its launch date of 2008. Some public issues regarding its hastened construction were revealed before the vessel was brought to sea as various equipment and sensor packages had yet to be added. Regardless, construction eventually completed to the point that sea trials were underway by the end of 2009 as a base crew and engineers ironed various issues out of the design. Delays in the program ensured a formal handover did not occur until 2011. After successfully passing her evaluation period, the Dolgoruky was officially handed over for Russian Navy service by late 2012. Since early 2013, the boat has been undergoing limited operational service that will most likely range throughout the year before large-scale service begins in 2014.\n\r\nKey to the design of the Borei-class submarines is her armament which consists of no fewer than 16 x Bulava Submarine-Launched Ballistic Missiles (SLBMs). The Bulava type missiles are an advanced family of new submarine-launched missiles having entered service only recently in early 2013. These weapons were developed through the Moscow Institute of Thermal Technology with production handled by the Votkinsk Plant State Production Association. Each missile measures approximately 40 feet long and weighs in at 40 short tons, powered by a  three-stage solid propellant and liquid-based fuel system providing a range out to 5,000 miles. Each missile yields 150 kilotons of lethality with guidance supplied by an inertial and GPS-based system. Originally, the Borei-class was to be outfitted with the \"R-39M\" series missiles but the project was cancelled after lackluster results. The Dolgoruky also fields 6 x 533mm torpedo tubes for anti-ship/submarine sorties and supports the SS-N-15 \"Blizzard\" cruise missile.\n\r\nThe Borei-class of submarine will eventually number ten in all. The second boat - Aleksandr Nevsky - is expected to join the Dolgoruky with commissioning sometime in late 2013 or, more likely, early 2014. The third boat - Vladimir Monomakh - is expected to be commissioned sometime in 2014. Other sister boats will follow as completed, all expected to have entered operational service by 2020.\n\r\nThe arrival of the Dolgoruky is rather significant to the future plans of the Russian Navy, who now sees a renewed expansion in its capabilities thanks to a greater political (and therefore financial) commitment by Russian authorities. With President Vladimir Putin at the helm for another term, the Russian military expects to further expand the lethal reach of her ocean-going force in the decades to come with some $132 billion dollars already earmarked for various ongoing naval programs.\r\n\t\t", "ship_name": "Yuri Dolgoruky (K-535)", "ship_type": "Nuclear-Powered Ballistic Missile Attack Submarine"}, {"id": "00c2e90f-0982-4e1f-bde3-c4eecb78ecef", "year_model": "2012", "description": "\r\n        \tINS Chakra (S-71) of the modern Indian Navy is a Russian-made Akula-class nuclear-powered attack submarine at its core. The class was introduced by the Soviets in the mid-1980s and some 21 boats were planned for the series - though only 15 were eventually realized due to the deterioration of the Soviet Empire into the 1990s. Ten remain in active service as of 2016 with Nerpa (K-152) on loan (via lease) to the Indian Navy where it carries the name of \"Chakra\" (named after the weapon of the god Vishnu).\n\r\nThe Russian Navy agreed to lease the boat to the Indian Navy in a 2004 deal. The hand over was delayed by a 2008 incident which left 20 onboard personnel dead (by asphyxiation). The Indian Navy took ownership of the boat on December 30th, 2011 marking the start of a lease period set to span ten years. The crew of Chakra had already been trained in St. Petersburg waters on the nuances of operating and maintaining a nuclear-powered underwater vessel. An official commissioning ceremony for the Chakra was held on April 4th, 2012.\n\r\nThe Chakra follows a Charlie I-class boat of same name, this vessel operating with the Indian Navy from 1988 until 1992. Charlie I boats were also of Soviet-era origin and driven by nuclear technology.\n\r\nAs it stands, Chakra offers the Indian Navy a true nuclear-powered submarine capability it has lacked for some time. The nuclear-based propulsion scheme provides the boat with unlimited undersea staying power as the boat does not need to surface at all to recharge its critical battery stocks. In essence, deployment ranges of the boat are only limited by the endurance of the crew (and their available food supply). The crew of eighty personnel have access to some creature comforts as well and these serve well to aid in long-distance voyages under the sea. The submarine has the capability to reach beyond 30 knots underwater and can submerge as far down as 600 meters. Much emphasis has also been placed on stealth characteristics and this makes Chakra one of the quietest submarines in service. Displacement is just over 8,000 tons.\r\n\t\t", "ship_name": "INS Chakra (S71)", "ship_type": "Nuclear-Powered Attack Submarine"}, {"id": "db4c5238-cc88-410b-a5b8-7a21e0742c94", "year_model": "2011", "ship_name": "Soobrazitelnyy (531)", "ship_type": "Guided-Missile Corvette Warship"}, {"id": "9b6e7aea-a154-4a04-866a-c6cdf84639d4", "year_model": "2010", "description": "\r\n        \tThe Nakhimov (hull number 889) is part of the Grachonok-class of \"anti-saboteur\" patrol vessels fielded by the modern Russian Navy. The group is planned as a 16-strong class and also known under the alternative designation of \"Project 21980\". Building of the boats began in 2008 and commissioning has been ongoing since 2010. As many as twelve are in service as of this writing (2017).\n\r\nThe boats displace 138 tonnes and feature a bow-to-stern length of 101.9 feet, a beam of 24.2 feet and a draught of 6 feet. This last quality makes the boats prime operators in close-to-shore and river operations. Propulsion is from a twin marine diesel engine arrangement that can propel the modern design to speeds of 23 knots in ideal conditions. Since heavy automation is built into these boats, only a crew of eight is needed for maximum function. The boat can stay at-sea for as many as five days with the onboard fuel and food stores.\r\n\t\t", "ship_name": "Nakhimov (889) (Project 21980)", "ship_type": "Patrol Boat / Special Missions Boat"}, {"id": "3872b314-0eb8-4a38-adf6-d2c3c9c924b2", "year_model": "2007", "ship_name": "Steregushchiy (530) (Project 20380)", "ship_type": "Corvette / Frigate Warship"}, {"id": "54b3c884-d33f-4740-b78b-0eded8dfb371", "year_model": "2006", "ship_name": "Buyan-class (Project 21630 / 21631)", "ship_type": "Corvette Warship"}, {"id": "0a9e6901-cb03-43ed-ba2d-16e85f9f269e", "year_model": "2004", "ship_name": "Ivan Gren (class) / Project 11711", "ship_type": "Landing Ship / Amphibious Assault Support Ship"}, {"id": "12e3d7f8-b44b-4e1e-bdb6-10b139fda876", "year_model": "2003", "description": "\r\n        \tThe Gepard-class guided-missile frigate of the modern Russian Navy survived the collapse of the Soviet Union and the subsequent budget cuts to become a four-strong group now in service with the Russian Navy and the Vietnamese People's Navy. These represent half of the originally planned number that succeeded the Koni-class of the late 1970s and early 1980s. The Gepard-class is led by its first ship, \"Tatarstan\", which was originally ordered as \"Yastreb\". The design is offered for export under several cost-effective configurations.\n\r\nTatarstan saw her keel laid down in 1991 and she was launched to sea during July 1993. Her work was suspended during the mid-1990s when the Russian Navy budget was severed but she was eventually fitted out, completed, and launched again on August 31th, 2003 to which she was then assigned as flagship of the Caspian Flotilla where she remains an active participant in Russian patrols there.\n\r\nAs completed, Tatarstan was given a displacement of 1,500 tons under standard load and nearly 2,000 tons under full load. Her measurements include an overall length of 335 feet, a beam of 42.9 feet and a draught down to 17 feet. Power is from a CODOG (COmbined Diesel Or Gas) arrangement allowing some customizability by the crew in choosing what power configuration to use during certain actions (cruising / dashing etc...). Maximum speed in ideal conditions is 28 knots and operational ranges are out to 4,000 nautical miles (when cruising at 10 knots).\n\r\nThe Tatarstan features a crew complement of 98 men and holds enough supplies and food for up to fifteen days at sea, forcing the vessel to remain somewhat close to allied ports. Its hull is designed for deep water service, able to withstand Sea States up to Level 5 (up to 13 feet waves) but she is a naturally lightweight design. Onboard systems include hull-mounted and towable sonar systems, fire control radars and the Cross Dome air search radar system. A full-service helicopter hangar and deck support rotary-win operations at sea, giving a vital over-the-horizon ability as well as an active submarine-hunting capability.\n\r\nArmament is key to the survival of the guided-missile frigate. Tatarstan is appropriately equipped with 2 x quadruple missile launchers supporting the Kh-35 Anti-Ship (AS) series missiles and 1 x Osa-M twin launcher Surface-to-Air Missile (SAM) system to protect against incoming aerial threats. Conventional armament includes 1 x 76.2mm Ak-176 turreted deck gun along the bow and 2 x 30mm AK-630 Close-In-Weapon Systems (CIWSs). She also carries 4 x 533mm torpedo tubes as well as 1 x RBU-6000 Anti-Submarine ROCket (ASROC) launcher. In this way, Tatarstan is fully-equipped to engage all manner of modern battlefield threats - whether they lie above the water, on it or under.\n\r\nThe Gepard-class is also marketed by Russia for interested export parties across five distinct configurations: \"Gepard-1\" loses its Variable Depth Sonar (VDS) functionality as well as its helicopter hangar while \"Gepard-2\" brings along the latter but does not feature the VDS fit or the SA-N-4 missile fit. \"Gepard-3\" is completed with a heavier displacement as well as enlarged beam measurement and installs the \"Kortik\" Close-In Weapon System (CIWS) over the standard AK-630 CIWS units. The \"Gepard-4\" loses its weapon installations altogether for featuring a more dedicated Search-and-Rescue (SAR) role. \"Gepard-5\" does not have a helicopter hangar but increased operational range through use of diesel units (8,000 horsepower each) though at the expense of straight line speed (reduced to 23 knots).\n\r\nVietnam is the only foreign operator of the Gepard-class. The Russian Navy is set to feature three total units before the end - Albatros (commissioned on November 28th, 2012) and Burevestnik (to be added). Vietnam operates the ship type as the HQ-011 \"Dinh Tien Hoang\" and the HQ-012 \"Ly Thai To\". Two more ships have yet to be named and remain under construction as of October 2015.\n\r\nTatarstan is named after the Republic of Tatarstan in the Volga Federal District of Russia.\n\r\nThe Gepard-class went to action against ISIS/ISIL forces in October 2015 when the Caspian Flotilla launched cruise missiles some 1,500 kilometers away from Syria. These missiles passed through parts of Iran and Iraq to reach their targets. Russia is aligned with Iran, Iraq and Syria in their involvement against ISIS/ISIL.\r\n\t\t", "ship_name": "Tatarstan (Yastreb) (Project 1161)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "76016208-fa59-4a76-8fb7-7b17dbfaa709", "year_model": "1999", "description": "\r\n        \tTo match the American Navy's Arleigh Burke-class multi-mission, guided missile destroyers, Soviet engineers were asked to develop a modernized solution through the existing Udaloy-class ships of fighting ships in 1982. The work spawned the related \"Udaloy II\" class which essentially morphed the anti-submarine-minded group into an anti-ship destroyer platform.  The upgraded class was given an all-new anti-ship missile suite as well as improved local defense capabilities and Fire Control System (FCS).\n\r\nThe product of the class became Admiral Chabanenko (DD-650) while two other vessels were also planned to join her. However, the fall of the Soviet Empire heavily curtailed expansion of the program and resulted in just Chabanenko being completed. The vessel saw its keel laid down on February28th, 1989 and was launched on June 16th, 1994 before seeing formal commissioning on January 28th, 1999. Despite her Cold War roots, she continues in service with the Russian Northern Fleet today (2014).\n\r\nHer planned sisters - Admiral Basisty and Admiral Kucherov - were both laid down in 1991 but never completed and ultimately scrapped in 1994 and 1993 respectively, leaving the Udaloy II-class strength at just one.\n\r\nA key change to the Udaloy-class design to produce the Udaloy II-class was the introduction of the newer \"Zvezda\" M-2 series sonar system. The original pair of 100mm decks guns was replaced by  a twin-gunned 130mm AK-130 installation at the forecastle to provide improved medium-ranged defense against inbound surface threats. The RBU-Udav anti-torpedo suite (twin launchers) increased the ship's standard survivability in the face of emerging submarine threat capabilities from the West and the original anti-submarine SS-N-14 \"Silex\" anti-submarine missiles were given up in favor of the SS-N-22 \"Sunburn\" missile for engaging surface threats at range. Torpedo launch tubes were held near amidships. Aerial threats were countered through an 8 x 8 bank of SA-N-9 \"Gauntlet\" surface-to-air missiles in a Vertical Launch System (VLS) arrangement. Close-in defense was aided through 4 x 6 30mm AK630 Close-In Weapon Systems (CIWSs) Gatling-style cannon suitable for engaging incoming aerial threats including cruise missiles.\n\r\nPower for the vessel came through a conventional gas turbine arrangement - this carried over from the original class and essentially made up of 4 x gas turbines in a COmbined Gas and Gas (COGAG) arrangement feeding 2 x shafts at 120,000 horsepower. COGAG mated two gas turbines to a single shaft, allowing a gearbox to arrange drive power from either one or both of the turbines depending on the amount of power required. In this way, the vessel could utilize either two or all four of its turbines at any one time to accomplish general cruising or short, speedy dashes. Maximum speed in ideal conditions could therefore reach 35 knots with a service range out to 10,500 nautical miles (12,100 miles). \n\r\nThe profile of the Admiral Chabanenko became typical of the Udaloy class with an uneven superstructure design showcasing relatively low profile mast works. The forecastle was home the turreted 130mm deck gun and two banks of two cylindrical, horizontally-mounted launchers identified just ahead of the bridge superstructure. Between the launchers was the Vertical Launch System (VLS). The bridge itself was identified y its large rectangular windows along the front and sides of its design. The various masts contain the equally various communications and sensor arrays required for optimal ship service over vast ocean spaces. At amidships were the two paired mounts of low-profile smoke funnels. A full-service helicopter deck and hangar was added over the stern and supported up to 2 x Kamov naval helicopters in the ASW, Search and Rescue (SAR), or transport roles. The standard operation crew of the vessel was listed at around 300 personnel. Dimensions included a length of 163 meters, a beam of 19.3 meters, and a draught of 6.2 meters. Displacement values reached 6,930 tons under standard load and 7,570 tons under full load.\n\r\nThus far the only notable action pertaining to the Admiral Chabanenko was its passing of the Panama Canal during 2008, marking the first time that a Russian Fleet warship had passed that part of the globe since the fighting of World War 2 (1939-1945).\r\n\t\t", "ship_name": "Admiral Chabanenko (DD-650)", "ship_type": "Guided Missile Destroyer Warship"}, {"id": "a0a8768a-f243-4602-9cfb-413ec0e9a99b", "year_model": "1998", "description": "\r\n        \tThe battlecruiser warship rose to prominence in the early part of the 20th Century, modeled after \"all-big-gun\" battleships while carrying less armor for the purpose of attaining faster cruising speeds. The British led the way in their design and construction and were followed by other world powers of the day including the United States, Japan and Germany. Even into the 1980s, some world powers continued to support the concept of the battlecruiser (though no longer cannon-armed warships) including the Soviet Union which maintained a health stable of surface warships to work alongside their powerful undersea force.\n\r\nThe battlecruiser Pyotr Velikiy was one such addition, laid down in 1986 and launched a full decade later in 1996. Before her launching, she was named Yuri Andropov but, with the fall of the Soviet Empire, she was rechristened as Pyotr Velikiy to coincide with a new Russia. Internally, the Russian Navy categorizes her as a \"guided missile cruiser\" to go along with contemporary terminology. The West, rather unsurprisingly, considers her to be a missile-minded battlecruiser.\n\r\nDespite its late-Cold War introduction, Pyotr Velikiy remains an active presence in the Russian fleet. She was formally commissioned on April 18th, 1998 and, as of this writing (2016), the vessel serves as the flagship of the North Fleet. She is the fourth of four Kirov-class battlecruisers completed (five were planned, the last being cancelled in October 1990).\r\n\t\t", "ship_name": "Pyotr Velikiy (Yuri Andropov)", "ship_type": "Guided Missile Cruiser / Battlecruiser Warship"}, {"id": "bf272066-a8fa-4112-b627-1b3323a49578", "year_model": "1994", "description": "\r\n        \tIn the 1980's the East and West had been in a high-tech duel. While America built up her military forces, the Communist Soviet Union could not keep pace and, in 1991, finally collapsed, leaving the United States as the lone super power of the world.  Huge amounts of Russian military hardware were mothballed and more than 100 submarines and warships - including search and rescue equipment - were decommissioned and left to rot in the harbors of the Kola Peninsula, home of the Russian Northern Fleet.  Some frontline equipment was retained and maintained along with the soldiers and sailors needed for respective their operation but the majority of Russian military men were out of work and not being paid. As such, many went home and did what they could to feed themselves and their families. \n\r\nDespite all this loss of power within the Russian government, the military somehow found a billion rubles for \"Project 949A Antey\" and constructed the K-141 \"Kursk\" - the largest attack submarine in the world. She would become one of the most important and highly feared anti-ship weapons ever developed. \n\r\nThe Kursk was built at the Severodvinsk docks and launched and commissioned in 1994.  The hull was 30-feet longer than the previous Oscar I-class submarines, being some 505-feet in length. She had advanced electronics and was more maneuverable than the Oscar I boats while still being even quieter - surprise was the ultimate goal of a hunter-killer. She was twice as long as a passenger Jumbo Jet - so long, in fact, that additional room allowed all the senior officers to have their own individual state rooms.  She was so large that upgraded extras never seen on American boats were added such as a sauna, solarium, swimming pool. It didn't stop there - also included were an aquarium and an aviary.  The Russian navy felt the additions were a good idea for crew morale due to the low rates of pay and extensive time spent away at sea.\n\r\nKursk was built with a 2-inch \"double hull\" which comprised of an inner pressure hull and an outer hydrodynamic hull - the latter made of a concentrated content of nickel and chrome stainless steel some 8.5mm thick.  The distance between the hulls provided additional buoyancy and for the crews mental welfare, the designers indicated the hull design improved their survivability against American torpedoes. The outer hull had a minute magnetic signature that helped avoid detection by American submarines through Magnetic Anomaly Detection (MAD) systems.  The inner hull was divided into nine watertight compartments making her, some thought, unsinkable. To break through the Arctic ice the large sail superstructure was reinforced. Onboard, she could hold enough supplies to stay submerged for 120 days at a time.  Her weapons were formidable with 24 x P-700 Granit supersonic cruise missiles (each having a range of 550km) and the massive 650mm 65K torpedo tubes capable of launching both torpedoes and anti-ship missiles. The Kursk also had 4 x 533mm torpedo tubes for SS-N-16 Stallion anti-ship missiles, these having a range of 50 km.\n\r\nHer powerplant consisted of 2 x OK-650b pressurized water nuclear reactors delivering 120,700 shaft horsepower, in turn, powering 2 x steam turbines with these delivering 49,600 horsepower each to 2 x shafts, these fitted with 2 x 7-bladed propellers. The large boat was slow when diving and unhurried to maneuver, but they had a submerged speed of about 30 knots which proved sufficient in keeping pace with the American carrier task forces.\n\r\nEven in the mid-1990's, the Northern Fleet sailors had still gone unpaid but the situation changed by 1999. The Kursk carried out a reconnaissance mission in the Mediterranean, shadowing the US Navy's Sixth Fleet during the Kosovo War.  In August of 2000, the Russian Navy held a fleet exercise in the Bering Sea with more than thirty warships and three nuclear submarines in play. To monitor the exercise, the American Navy sent two submarines - the USS Memphis and the USS Toledo - along with a number of surface ships while Norwegian and US aircraft were overhead on watch.   Like the \"Belle of the Ball\" coming late to the party, the pride of the Russian Fleet - the Kursk - joined the exercise on the 10th and the training began with a massive firing of surface ship weapons of all kinds.  While submerged, the Kursk successfully launched her most advanced cruise missile - the Granit - with a dummy warhead.  \n\r\nOn August 12th she was ordered to pull back from the main fleet so she could test fire one of her largest 650mm torpedoes (again using a dummy warhead) at the Pyotr Velikiy, a decommissioned Kirov-class battlecruiser.  Fleet Admiral Popoff,  from his flagship Peter the Great, a heavy missile cruiser, radioed to the Kursk at 9am to fire the torpedo and Kursk acknowledged the signal - this would be the last anyone would hear from the submarine. Something, it seemed, had gone terribly wrong and no one had heard from her for two days despite her orders to maintain radio contact.  The day she went silent, at 11:28am, the USS Memphis, charged with monitoring the fleet, had picked up two underwater explosions.\n\r\nThe Russians launched a rescue mini sub but due to previous Russian Navy cutbacks, the vessel was old and few knew how to operate it. As such, the mission to reconnoiter the Kursk subsequently failed.  On August 16th Russian divers found the Kursk lying on the bottom of the Barents Sea in 350 feet of water not far from the Russian military complex at Murmansk.  The divers said they heard faint knocking but were unable to open the outer or inner hatch because of a lack of proper tools and necessary experience. The men of the Kursk, it seemed, were doomed. \n\r\nIn true Soviet fashion, the Russian military had put a blackout on the disaster but news leaked out to the Russian public, resulting in their people crowding churches to pray for the men to be safely recovered.  The Russian government refused offers of help from the British and Norwegian governments and, after a week, all hope for a rescue was lost.  Finally, relenting due to pressures from Kursk families, the British and Norwegian divers were allowed to try to gain entrance to the submarine.  The drivers worked for 7 hours and opened the hatches, finding the inner spaces flooded. They then examined the Kursk from bow to stern, finding the double hull ripped open with a hole more than 200 feet long. It now became evident that the crew and observers onboard had either drowned or suffocated within a few hours of the accident.\n\r\nGrief-stricken family members demanded an explanation and the Russian Navy felt one of the American submarines following the Kursk had collided with her, causing the sinking.  The American Navy rebuked the charges but the Russian Navy insisted in trying to keep blame from their underfunded military complex.  The collision was put to rest when the British Blacknest Institute proved that, at the time of the loss of the Russian submarine, two underwater explosions were, in fact, recorded.  The Russian military insisted the noise was from a collision with an American submarine but Blacknest provided data showing a collision supplied a different sound than that of an underwater explosion. The two explosion events were recorded 135 seconds apart - the first registered 2.2 and the second 4.4 on the Richter scale.\r\n\t\t", "ship_name": "Kursk (K-141)", "ship_type": "Nuclear-Powered Ballistic Missile Attack Submarine"}, {"id": "d7b7067a-71fe-4444-ad29-5eec09e5ff13", "year_model": "1993", "ship_name": "Neustrashimyy (class) / (Project 11540 Yastreb)", "ship_type": "Multi-role Frigate Warship"}, {"id": "fe350cf2-1545-4d41-8dd6-c704b90f45e5", "year_model": "1992", "ship_name": "Admiral Panteleyev (548)", "ship_type": "Guided-Missile Destroyer"}, {"id": "cdc623f9-b7a5-4959-8825-946b27879a17", "year_model": "1991", "description": "\r\n        \tDue to historical and political considerations carrier development got off to a slow start in the Soviet Union.  The debate over large decked carriers has been ongoing for decades starting the 1930's with Stalin; however two carriers were planned but cancelled with the start of WW II with the ground war being the major consideration.  After the war the Soviet Navy saw how the aircraft carrier played a pivotal role in defeating Japan. In 1945 the Soviets drafted plans to construct a new class of carriers by the 1950's. With Stalin's death in 1953, Khrushchev took over the Soviet state and announced deep military cuts.   The plans to construct a new class of carriers were stopped by Khrushchev feeling that a nuclear strike would eliminate a carrier as a viable weapon so the carrier program became a prime target for cancellation. \n\r\n In the early 1960's when the Brezhnev regime took over, the carrier became a reality with the Moskva and the Leningrad built between 1965 and 1968.  However they were not true aircraft carriers supported only with helicopters, no fixed wing aircraft.  This concept was one of antisubmarine vessels used as a weapon suite that protected against the American nuclear submarine threat.  Again the compromise between the anti sub and fleet protection was the Kiev CVHG class in 1975, both were helicopter vessels.  Arguments between the government and the military continued but the day of the true Soviet aircraft carrier was at hand in 1991 with the Kuznetsov CV class aircraft carrier.\n\r\nAdmiral Kuznetsov was first named \"Riga\" for the city of then \"Leonid Brezhnev\", next was \"Tbilisi\" also a Russian city. Her classification was changed from \"CV\", aircraft carrier, to \"TAVKR\", or heavy aircraft carrying cruiser.  The reason for the name change was the Montreaux Convention in 1936 stated an aircraft carrier CV could not pass through the Dardanelles.   Russia's carriers are built on the Black Sea making this an international issue when the time came for the ships to enter the Mediterranean Sea and beyond.  \n\r\nCurrently Admiral Kuznetsov is the only Russian fixed wing carrier in service.  She is conventionally powered and has a mixture of fixed wing aircraft and helicopters. The carrier's main fixed-wing aircraft is the multirole Su-33. The air groups can perform air superiority, fleet defense, and air support missions.  Also on board are twin seats Su-27, which are used for pilot training along with the Su-25UTG. The carrier also carries the Kamov Ka-27 and Ka-31 helicopters for anti-submarine warfare and troop transport.\n\r\nFixed wing aircraft taking off from the Admiral utilize a ski-jump on the front of the flight deck. Aircraft accelerate up the ski-jump using their afterburners. This results in the  aircraft leaving the flight deck at a modestly higher angle and elevation than on an comparable American aircraft carrier with their flat deck and steam catapults. The ski-jump creates less G-force on the pilot because the acceleration is lower.  The result is a takeoff speed of only 120-140 km/h requiring an aircraft engine that will not stall at low speeds.\n\r\nThe Russian Navy has indicated they will continue to be committed to aircraft carrier development based on the US Navy model.  This is easy to say however it will require massive funds, technology and additional trained naval personnel currently not available.  Also the Khrushchev mind set has not completely gone away with the cost of the USN model and anti-ship missiles making a carrier an easy target in a conflict.  Another issue is the additional cost of the carrier fleet to protect the carrier.   Some in Moscow feel this is not a good argument due to Russian ships having a weapons suite of SSM/SAM missiles on board for air threat protection.  The expansion of a Russian carrier fleet is bleak at best. However the desire to provide political forward presence like the visit to Venezuela on 11/25/08 and Cuba in early 2009 is a top priority.  The future of the Kuznetsov is problematic with parts becoming an issue and refits scheduled closer together.  The Russian government feels she will be in service till 2030, being the only carrier supporting fixed wing aircraft.  Another problem for the military will be to maintain her aged aircraft.    \n\r\nHer sister ship, Varyag was launched in 1988 but never completed.  Some reports indicate is she is to be sold to the Peoples Republic of China another report says she will become a floating hotel.  She is reported to be moored at the Nikolayev South shipyard in Ukraine.   Navy officials indicated due to her material condition she will never go to sea.\r\n\t\t", "ship_name": "Admiral Kuznetsov (CV Project 1143-5/6)", "ship_type": "Conventionally-Powered Aircraft Carrier"}, {"id": "6c0d3de7-b48c-48f3-a68e-c88732728393", "year_model": "1989", "ship_name": "Varyag (011)", "ship_type": "Guided-Missile Cruiser Warship"}, {"id": "14ee239a-762f-4fd4-a568-cb2f94124e52", "year_model": "1988", "ship_name": "Admiral Levchenko (605)", "ship_type": "Guided Missile Destroyer Warship"}, {"id": "8fd96734-a8c5-4baa-bf67-aa461c80ee77", "year_model": "1988", "description": "\r\n        \tThe battlecruiser remained a vital component for the Soviet Navy well into the end-years of the Soviet Empire. The Kirov-class was designed as a nuclear-powered surface combatant with a mainly missile-minded armament suite and four of the five planned vessels were ultimately completed. After the fall of the Soviet Empire, the ships were given all-new names but eventually decommissioned from active service save for one. The lone survivor today (2017) remains \"Admiral Nakhimov\", known originally as the \"Kalinin\" when she was originally launched in 1986.\n\r\nThe building program for the Kirov-class was launched in December of 1977 and this initiative became one of the largest post-World War 2 programs involving surface warships aside from aircraft carriers. While categorized as battlecruisers, and intended as dedicated submarine-hunters from the outset, they were essentially evolved to become guided-missile cruisers before the end and were known as \"missile cruisers\" to the Soviets - able to tackle several important roles at sea including Task Group Command for the carrier fleet.\n\r\nKalinin / Admiral Nakhimov saw its keel laid down on May 17th, 1983 at the Baltiysky Naval Shipyard of Leningrad. Launched on April 25th, 1986, the warship was formally commissioned on December 30th, 1988 for active service in the Soviet fleet, carrying pennant number \"180\" and then - in 1989 - \"064\". In 1990, her pennant identifier was revised (yet again) to become \"085\" and then, in 1994, this became \"080\".\n\r\nAs completed, Kalinin displaced 24,300 tons under standard load and 28,000 tons under full load. Her length measured 827 feet with a beam of 94 feet and a draught of 30 feet. Unlike conventionally-powered surface warships of the West, the Kirov-class were developed to used a hybrid propulsion arrangement involving a twin-nuclear system coupled to steam turbines for propulsion. Kalinin carried a nuclear fit (tied to oil-fired boilers) to generate steam that fed the turbines and these, in turn, developed 140,000 horsepower driving two shafts under stern. The vessel could make headway (rather impressively for its size) at 32 knots and range out to 1,000 nautical miles while cruising at 30 knots. Her true range was essentially indefinite due the reactor fit, primarily limited by onboard oil stores, crew fatigue, and food stores.\r\n\t\t", "ship_name": "Admiral Nakhimov (Kalinin)", "ship_type": "Nuclear-Powered Battlecruiser / Guided Missile Cruiser Warship"}, {"id": "acb36d0b-1abf-4623-bafd-227ee5f03685", "year_model": "1988", "description": "\r\n        \tThe amphibious assault has proven to be one of the most dangerous, yet ultra-critical, components of warfare since ancient times. As such, it falls onto naval forces to supply the fighting men and machines with the means to cross over from water to land in an attempt to carry the fight to the enemy. Various naval powers of the world have invested mightily in the technologies that enable such doctrine to exist and the Soviet Navy contracted for the massive \"Zubr-class\" LCAC (\"Landing Craft Air Cushion\") before the fall of the Soviet Empire (1922-1991). The first vessel in the class was commissioned in 1988, representing the largest air-cushioned vehicles in the world. In the post-Cold War world, their service now falls under the Russian Navy flag as well as several other powers of the world.\n\r\nThe Zubr-class is identified by NATO as the \"Pomornik\" and is also known by the Soviet/Russian Navy designation of \"Project 1232.2\".\n\r\nThe Zubr craft is given a length of 187 feet with a beam measuring 84 feet and a draught of 5.2 feet. It displaces at 415 tons when under normal load and reaches 555 tons when under full load. Her profile includes a bridge superstructure at amidships with three large, shrouded propulsion fans aft. The forward section of the boat is largely unobstructed and sports a raised bow with a lowering ramp for embarking/disembarking units, systems, cargo and infantry. The hull - specially-designed to mitigate the effects of magnetic naval mines - sits atop an inflatable bed which provides the necessary cushion when going ashore. The cushion is deflated to bring the bow ramp to ground level. The Zubr craft features a surface search radar, chaff launcher and decoys among other integrated systems. Armament (largely self-defensive in nature) includes Surface-to-Air Missile (SAM) launchers, 2 x 30mm AK-630 cannons and 2 x rocket launchers. The vessel can also dispense naval or anti-personnel mines as required.\n\r\nInternally, the Zubr features a centralized hold for carrying vehicles or cargo. Living spaces for the four officers, 31 enlisted personnel and combat-ready infantry are afforded while being fully protected by an NBC (Nuclear, Biological, Chemical) system in the event of nuclear war. Some creature comforts are also added including eating areas, heating and cooling to allow the Zubr to operate in most any climate setting. The vessel's hold can house up to three Main Battle Tank (MBT) type vehicles, up to eight Armored Personnel Carriers (APCs) or similar, ten general military vehicles or up to 500 infantry. Of course the craft can also replace these items with pure cargo, taking advantage of its 4,300 square foot hold.\n\r\nThe Zubr relies on a combination of 5 x Kuznetsov NK-12MV series, gasoline-fueled turboprop engines, two used for generating the necessary lift and three utilized in propelling the vessel. All told, these installations generate up to 11,836 horsepower. The three propulsion engines manage four variable-pitch propeller assemblies. The Zubr can make up to 40 knots in ideal conditions and reach speeds up to 60 knots under certain conditions. Operational range is listed out to 300 miles. The hull is designed for operations in up to \"Sea State 4\", which identifies wave heights of four feet to eight feet.\n\r\nTo date (2014), only nine examples of the Zubr have appeared. Two are in service with the Russian Navy (770 Evgeny Kocheshkov and 782 Mordovia) while two have been acquired by the Ukrainian Navy (U420 and U424). The Greek (Hellenic) Navy  has taken on service of four vessels and originated from both Russia and Ukraine. These are named in addition to their hull numbers - HS Kefalonia (L180), HS Ithaki (L181), HS Kerkyra (L182) and HS Zakynthos (L183). The Chinese Navy is believed to have contracted for four of the large amphibious vessels with two of them to be built in Chinese shipyards. One has already been taken into service.\r\n\t\t", "ship_name": "Zubr LCAC (Pomornik) (Project 1232.2)", "ship_type": "Air-Cushioned Landing Craft"}, {"id": "aea4f95f-360d-4135-b904-e9bf15ec9dfd", "year_model": "1987", "description": "\r\n        \tThe Admiral Gorshkov (formerly the \"Baku\" CVHG-103) was a late-Cold War-era aircraft carrier serving the Soviet Navy for a time. The type was based on the Kiev-class of aircraft carriers led by the Kiev itself and joined by sister ships Minsk and Novorossiysk. Towards the end of the Cold War and after the Soviet Empire's final collapse in 1991, the Soviet fleet fell on hard times and all four vessels were sold off. The Kiev and Minsk were sold to China while the Novorossiysk became scrap. The Baku - renamed to the \"Admiral Gorshkov\" late in its career - was sold to the Indian Navy and is set for recommissioning sometime in 2012 as the refitted \"Vikramaditya\". \n\r\nThe Baku had her keel laid down at Ukrainian Shipyard No.444 in 1978 to which construction proceeded for several years thereafter. In 1982, the vessel was launched and underwent sea trials, ending with her formal commissioning in 1987 as the \"Baku\", this after the city of Baku in Azerbaijan. The Baku carried the Baku name from 1987 until 1991 (then under the Soviet Navy flag) to which the vessel was renamed the \"Admiral Gorshkov\" for the remainder of her Russian career (after the fall of the Soviet Union). her career closed in 1995 prior to her refit and subsequent sale to India. The Admiral Gorshkov name was derived from the Soviet Cold War-era navy admiral of the same name - Admiral Sergey Gorshkov.\n\r\nDesign of the Baku/Admiral Gorshkov was a mixed breed of conventional aircraft carrier standards and armed heavy cruiser. The flight deck consisted of a short stern-to-portside runway designed for short take-off and recovery. The bow section was where most of the defensive and offensive weaponry was held - torpedo tubes and deck guns clearly visible. The island superstructure was offset to the starboard side and towered over the featureless flight deck immediately to the left. Beyond that, the type was well-formed with clean lines designed to cut through the roughest of northern hemisphere seas.\n\r\nThe Admiral Gorshkov managed an air wing of 12 x Yakovlev Yak-38 Forger VTOL aircraft (Vertical Take-Off and Landing). The Yak-38 was roughly the equivalent of the British BAe Sea Harrier though limited in its tactical scope and operational range (only 231 were produced before retirement in 1991). The fixed-wing aircraft was supplemented by up to 16 x Kamov navalized helicopters for anti-ship, anti-submarine and general reconnaissance sorties.\r\n\t\t", "ship_name": "Admiral Gorshkov (Baku CVHG-103)", "ship_type": "Aircraft Carrier / Heavy Cruiser Warship"}, {"id": "8dd76e3d-8b9c-439e-aad1-f1c5f8263572", "year_model": "1987", "ship_name": "Primorsky Komsomolets (354)", "ship_type": "Anti-Submarine Corvette Warship"}, {"id": "ffa05c39-1645-4902-a1f8-f9be1b377096", "year_model": "1987", "description": "\r\n        \tDuring the Cold War decades, the Soviet Navy was forced to keep pace with developments in the West, particularly with the growing capabilities of American submarines. This led to a new class of surface warships - the \"Udaloy-class\" - being developed specifically to deal with the submarine threat by way of various onboard measures. The original plan involved a fleet of fifteen such ships but this ended with thirteen vessels completed as two were ultimately cancelled. The Soviet Union was no more in 1991 and the ships were grandfathered into the new Russian Navy. Four of the Udaloy-class have since been retired from service (2015) and an evolved version of the class has emerged as the \"Udaloy II\", these offering much improved capabilities through a three-strong vessel batch.\n\r\nSeveromorsk (Project 619) is a vessel of the original Udaloy I-class and saw her keel laid down on June 12th, 1984. She was launched to sea on December 24th, 1985 and the vessel saw formal commissioning on December 30th, 1987 - having served the Russian / Soviet Northern Fleet since.\n\r\nClassified as an Anti-Submarine Warfare (ASW) Destroyer, the vessel still retains an inherent Anti-Ship (AS) capability. Her primary armament is a missile fit involving 2 x 4 (8) SS-N-14 \"Silex\" anti-submarine/anti-ship missile launchers and 8 x 8 (64) SA-N-9 \"Gauntlet\" surface-to-air missiles in Vertical Launching Systems (VLSs). More conventional armament is seen through the 2 x 100mm /70 caliber Dual-Purpose guns fitted as well as 4 x 30mm Ak-630 Close-In Weapon Systems (CIWSs). Rounding out the armament fit are 2 x 4 (8) 553mm torpedo tubes (firing either torpedoes or SS-N-15 missiles).\r\n\t\t", "ship_name": "Severomorsk (619) / (Project 619)", "ship_type": "Guided Missile Destroyer Warship"}, {"id": "9a2cc45b-2ffb-437f-b6b3-b821b5228275", "year_model": "1986", "ship_name": "Marshal Ustinov (Project 1164 Atlant)", "ship_type": "Guided-Missile Cruiser Warship"}, {"id": "eb5f8631-3d42-4670-8432-c6155baaa04f", "year_model": "1985", "ship_name": "Admiral Tributs (564)", "ship_type": "Anti-Submarine Warfare (ASW) Destroyer Warship"}, {"id": "4ae096e4-d0b9-4908-b2f9-0d3226f0961d", "year_model": "1985", "ship_name": "Marshal Shaposhnikov (543)", "ship_type": "Multirole Destroyer Warship"}, {"id": "ac8bf5e9-3022-47d1-a324-0a22e983afad", "year_model": "1985", "description": "\r\n        \tThere are currently (2017) six of the Parchim-class (also Project 1331M) corvette warships in service with the modern Russian Navy. All of this active group serves with the Baltic Fleet. The class was developed and built for the East German Navy (the \"Volksmarine\") where there was still a divided Germany of the post-World War 2 period (the \"Cold War\"). Construction was handled locally in East German waters from 1985 until 1989 and marked the largest project by the Navy to be had during its decades-long existence under Soviet influence. Some twenty-eight vessels were ultimately completed. In addition to those having served with the Soviet Navy - and now serving with the Russian Navy - a further fourteen remain active with the navy of Indonesia (2017) - these being former East German vessels.\n\r\nThe Soviet/Russian batch of Pachim-class corvettes was/is designated \"Parchim II\" by NATO.\n\r\nDue to the presence of NATO submarines around European shores, the Parchim-class corvettes were ordered by the East German government as anti-submarine platforms. Traditionally, corvettes have marked the smallest warship types in service with any navy. This means they are deliberately given relatively compact dimensions with shallow draughts and enough armament to deal with most of the common threats out there. Additionally, speed and maneuverability are inherently good. The Parchim-class, therefore, displaced just 800 tons under standard load and up to 950 tons under full load. Length was 237.9 feet with a beam of 30.9 feet and a draught of 15 feet. The corvettes were outfitted with 3 x M504 series diesel units and these developing 14,250 horsepower while driving 3 x shafts under stern. The vessels had an outright speed of about 25 knots in ideal conditions and could range out to 2,100 nautical miles.\r\n\t\t", "ship_name": "Parchim (class) / Project 1331M", "ship_type": "Corvette Warship"}, {"id": "62c7e300-09b7-48ae-a6bf-fdcde3b654f5", "year_model": "1985", "description": "Fedor Golovin (Meridian) (SSV-520); Tavriya (SSV-169); Kurily (SSV-208); Kareliya (SSV-535); Priazovye (SSV-201); Viktor Leonov (Odograf) (SSV-175); Vasily Nikititch Tatischev (Pelengator) (SSV-231)", "ship_name": "Vishnya (class)", "ship_type": "SIGNals INTelligence (SIGINT) Warship"}, {"id": "b188e286-6164-4372-87f2-9e40cff7cd18", "year_model": "1984", "description": "\r\n        \tThe Frunze battlecruiser was a product of the Cold War, part of the Kirov-class of cruisers. Though serving in her intended role for years, she was later renamed as the Admiral Lazarev after 1992. Though traditionally classified as a missile cruiser, the Frunze and her Kirov-class ships are also known as battlecruisers because of the long range and firepower they possess. Next to aircraft carriers, the Frunze and her associated class of warships represent some of the largest sea-going vessels on the water today.\n\r\nThe Frunze is powered by twin nuclear reactors of KN-3 PWR type which work in conjunction with twin steam boilers which in turn feed two shafts. A top speed of over 30 knots can be attained and the nuclear reactors provide for an essentially unlimited range making her a prime adversary of nuclear-powered aircraft carriers in the West. Initially intended to hunt and destroy NATO and American submarines, the Frunze graduated to become so much more in the way of a complete warship. Her armament is an array of cannons, torpedoes, rockets and missiles.\n\r\nThe main armament of the Frunze is her 20 x P-700 Granit anti-ship missiles held in a forward \"missile farm\" This is augmented by some 128 SA-N-8 surface-to-air missiles for anti-aircraft defense. This is further helped by another 96 S-300PMU surface-to-air missiles to counter additional closing threats. The SA-N-8 Gecko system further ensures the vessels survivability as 44 of the type are carried aboard. Rockets can be launched from the twin RBU-1000 and RBU-12000 for anti-ship / surface-to-surface work at closer ranges. Close-In Weapon System (CIWS) support is handled by the battery of 8 x 30mm/L60 AK-630 anti-aircraft gatling systems. 10 x torpedo tubes mounting 533mm types are also provided.\n\r\nThe Frunze's profile is dominated by a tall mast set amidships with a secondary and shorter mast directly abaft. Her superstructure takes up most of her midship and stern area while the bow contains the large amount of missile firing ports needed for the bulk of her long-range arsenal. Accommodations for personnel on board total over 700 sailors, officers and a small contingent of airmen. Her air arm is represented by three Kamov-brand Ka-27 \"Helix\" or Ka'25 \"Hormone\" type anti-ship / anti-submarine helicopters which are stored in hangars below deck. Onboard systems afforded to the Frunze include sonar, fire control, navigation and search radars.\n\r\nAs of this writing, the Admiral Lazarev (formerly Frunze) was waiting to be re-commissioned after having spent some time in limbo. This, of course, is directly related to budgetary constraints faced by Russia after the collapse of the Soviet Union. In any case, it is foreseeable that the Admiral Lazarev will see active service in the resurgent Russian military movement. Her primary region of operation is the Pacific Ocean.\n\r\nAdmiral Lazarev has been out of service since 1999. She remains laid up at Abrek bay.\r\n\t\t", "ship_name": "Admiral Lazarev (Frunze)", "ship_type": "Nuclear-Powered Guided-Missile Cruiser / Battlecruiser Warship"}, {"id": "5882e6a5-cf67-4a5a-951a-9587222aefb4", "year_model": "1984", "ship_name": "Akula (K-284)", "ship_type": "Nuclear-Powered Attack Submarine"}, {"id": "ad33df7b-08c6-4da8-a9f6-ff8f0d98f8a0", "year_model": "1983", "description": "\r\n        \tThe Slava-class (Project 1164 Atlant) was a Soviet Cold War-era initiative intended to field some 10 guided missile cruisers for the Soviet Navy during the 1970s. Design work began in the 1960s and the types were scheduled to be outfitted with conventional propulsion, an array of sensors and processing systems and a plethora of missile armament to contend with the threat posed by Western aircraft and waterborne threats against Soviet territory and interests. In the end, only three of the planned vessels were ever completed due to the end of the Soviet Empire in 1991, leaving one incomplete hulk and six vessels to cancellation. The Moskva - originally commissioned as the Slava (meaning \"Glory\") - became the lead ship of the class and her keel was laid down in 1976 by 61 Kommunara Shipbuilding Plant. She was launched in 1979 and officially commissioned for Soviet Navy service on January 30th, 1983. Her name was changed in 1995 to honor the Russian capital city of Moscow and her primary station is as part of the Black Sea Fleet. \"Project 1164 Atlant\" is the Soviet Navy designation for the Slava-class.\n\r\nThe Moskva missile cruiser exhibits a wholly conventional design profile made up by an upward-sloping bow, centralized superstructure and stern helicopter landing deck. The Moskva features a singular deck gun along the forecastle, large missile launchers along the port and starboard sides and an enclosed forward mast containing radar, communications and sensitive processing systems. The bridge is fitted high atop the superstructure for a commanding view of the field ahead. An aft superstructure contains the aft mast and a pair of low-profile, enclosed smoke funnels. A small helicopter landing deck can manage a single twin-rotor Kamov Ka-25 or Ka-27 navalized helicopter or similar - anti-submarine warfare helicopters designed to specifically search, track and engage enemy submarines. The full crew complement consists of 480 personnel including the small air detachment. The vessel displaces at 11,500 tons and armor consists of splinter plating protection.\n\r\nThe Moskva is a conventionally-powered \"blue water\" vessel designed for operations far from shore, either independent or as part of the main Russian fleet. Propulsion is provided for by 4 x gas turbines arranged in a COGOG (COmbined Gas Or Gas) configuration developed for ultimate efficiency. COGOG allows for both low and high engine output for both general cruising and high-speed darting respectively.  The configuration allows for better management of limited fuel stores and more flexibility in travel modes over older engine arrangements. A clutch system manages each turbines and total output produced is approximately 121,000 shaft horsepower delivering to 2 x shafts. Range is listed at 10,000 miles when maintaining a cruising speed of 16 knots.\n\r\nThe Moskva is outfitted with an array of sensors and processing systems led by its powerful Voskhod/Top Pair MR-800 series 3D long-range search radar providing a modern \"all-seeing\" digital suite. This is coupled with a Fregat MR-710 3D air search radar to counter incoming aerial threats. Navigation is assisted by the \"Palm Frond\" suite and fire control consists of several radar installations and applicable systems - the Bass Tilt AK-360 series handling short-ranged aerial threats (including cruise missiles), the MPZ-301 Baza SAM (Surface-to-Air Missile) control, the Door-C SSM (Surface-to-Surface Missile) control, the MG-332 Tigan-2T sonar array integrated into the bow and a Platina \"Horse Tail\" MF VDS (Variable Depth Sonar) fitted aft. Intercept and jamming antennas (the \"Kol'cho\" suite) help manage the onboard electronic warfare suite and 2 x 140mm PK-2 DL series chaff-flare dispensers are fitted to thwart incoming radar and missile threats.\r\n\t\t", "ship_name": "Moskva (Project 1164 Atlant)", "ship_type": "Guided-Missile Cruiser Warship"}, {"id": "aca15a7c-0086-486a-b33a-05b2bb905278", "year_model": "1982", "description": "\r\n        \tThe Kilo-class submarine was laid down by the Central Design Bureau for Marine Engineering and officially commissioned in April of 1982. 57 total vessels of the class were ultimately completed and 47 remain in active service as of this writing (September 2013). Two have been formally retired from service while a single boat was lost. The Kilo-class replaced the outgoing Tango-class boats while the Kilo-class itself was succeeded by the Lasa-class series. The boats have been exported beyond Soviet/Russian territories and have served with Algeria, China, India, Iran, Poland, Romania and Vietnam. The class is designed primarily for anti-ship/anti-submarine duties.\n\r\nDesign-wise, the Kilo-class displaces at 2,300 tons when surfaced and nearly 4,000 tons when submerged. She features a running length of up to 74 meters with a beam measuring 9.9 meters and a draught of 6.5 meters. The vessel has been tested to depths of 300 meters while oeprational service is typically at 240 meters. The Kilo-class is outfitted with a conventional powerplant arranged as a diesel-electric configuration. This includes 2 x diesel generators outputting 1,000kW of power and tied to 1 x motor delivering up to 6,800 shaft horsepower to a single, multi-bladed, fixed-pitch propeller held along a shaft at the stern. This arrangement allows the vessel a to surfaced speed of 12 knots with a submerged speed nearing 25 knots. Operational range is approximately 7,500 miles when cruising at seven knots along the surface. Range is reduced when submerged to 400 miles heading at 3 knots. The Kilo-class holds enough stores to supply a crew up to 45 days at sea before replenishment is required. Her crew consists of 52 personnel made up of officers and sailors.\n\r\nAs an attack submarine, the craft is outfitted with 6 x 533mm torpedo tubes with 18 x torpedo reloads. Some versions are outfitted further with the Club S anti-ship missile system. The craft can also disperse up to 24 naval mines if required (in place of the torpedo load). Russian variants are defensed on the surface through 8 x SA-N-8 \"Gremlin\" or 8 x SA-N-10 \"Gimlet\" surface-to-air missile systems. \n\r\nThe modern Russian Navy is believed to operate some 17 Kilo submarines today (2013). China, India and Vietnam represent the next largest operators with 12, 10 and 6 respectively. In the Russian Navy nomenclature, the Kilo-class is recognized as \"Project 877 Paltus\", Paltus meaning \"Halibut\".\r\n\t\t", "ship_name": "Kilo (class) / (Project 877 Paltus)", "ship_type": "Diesel-Powered Attack Submarine"}, {"id": "16aa76e0-53d0-4817-929f-724dfd692619", "year_model": "1982", "ship_name": "Ladny (801)", "ship_type": "Guided-Missile Frigate Warship"}, {"id": "7a563cde-70be-490c-bcb5-0e8534547ee6", "year_model": "1982", "ship_name": "Vice-Admiral Kulakov (626)", "ship_type": "Destroyer Warship"}, {"id": "0a88c43a-d041-4317-a22f-4be759d14787", "year_model": "1981", "description": "\r\n        \tBy the time of the 1970s, the West was firmly entrenched in a \"Cold War\" with the Soviet Union to the east. The Soviet Union rose to prominence in World War 2, particularly after the German invasion of the country through Operation Barbarossa. While the German Army came within earshot of the Soviet capital of Moscow, the Soviets managed to turn back the tide of the German onslaught through good luck and a massive outpouring of man, machine and patriotism. The Soviet Union went on to claim much of Germany's east interests and eventually captured Berlin proper, only to find a dead Adolf Hitler await them. Regardless, the war prompted the Soviet the Union to become an undisputed superpower in the modern world and a \"cold\" war ensued - primarily between the United States and Russia - in areas of the world that would become their battlefield (Korea in the 1950s, Vietnam from the 1950s into the 1970s). \n\r\nRumors were soon prevalent in the Pentagon that a new weapon was being built behind the \"Iron Curtain\" - a supposedly giant and undetectable nuclear-powered ballistic missile submarine (essentially real-world story behind the Tom Clancy suspense novel, \"The Hunt for Red October\"). The vessel was laid down on June 30th, 1976 and, in 1981, the lead boat of the \"Akula\", or \"Shark\" class, was completed at the Severodvinsk Shipyard on the White Sea near Archangel and commissioned on December 29th, 1981 as the \"TK-108\" (a total of six submarines in the class would be completed).  Leonid Brezhnev is said to have used the word \"Typhoon\" to describe a new submarine so NATO aptly used this as its reporting name. When the Soviets allowed the submarine to be seen in public for the first time, she quickly became a feared weapon of the Cold War to the pro-western navies of the world. Later, TK-189 was renamed the \"Dmitri Donskoi\" after the Grand Duke of Moscow of 1359.\n\r\nThe Akula-class became the largest submarine ever built up to that point. She was quieter than any previous Russian submarine design attempt due to new \"quiet\" techniques developed specifically for the Typhoon boats. Additionally, she was more maneuverable than the preceding Russian Delta-class submarines. A multi-hulled design fitted no fewer than five inner habitable hulls with two large main parallel hulls. She had nineteen compartments for control rooms, missile launch tubes and electronic equipment. The superstructure was coated with sound absorbent tiles.\n\r\nShe was the first SSBN to have her missile launch tubes installed forward of the sail and, with twenty RSM 52 intercontinental, three-stage, solid propellant ballistic missiles, she fielded more missiles than any of her contemporaries anywhere in the world. The plan for these behemoths was to hide in the North Atlantic waters and, if war came, the class would relocate to predetermined locations under the Arctic ice shelf. She could maintain this submerged position for up to 120 days or more, waiting for the \"go code\" to fire her missiles towards targets across the United States.  Each of the 20 missiles onboard had 10 independently targetable, multiple reentry MIRV's, each with a 100kt nuclear warhead - 200 warheads altogether.  The missiles had a range of 5,157miles (8,300km) and were able to hit a target within a 1,640ft (500m) area.\r\n\t\t", "ship_name": "Dmitri Donskoi (TK-208)", "ship_type": "Ballistic Missile Submarine"}, {"id": "4c734971-8fa7-42fe-9d90-5d8a177f88b7", "year_model": "1980", "description": "\r\n        \tDuring the height of the Cold War, the Soviet Union maintained a healthy collection of submarines and surface warships. Included in this stable were the heavily-armed Kirov-class of battlecruisers which forced the United States to bring back their big-gunned World War 2-era Iowa-class battleships. The Kirov-class was led by the Kirov herself which saw her keel laid down on March 27th, 1974 at the Baltiysky Naval Shipyard of Leningrad. She was launched on December 26th, 1977 and formally commissioned on December 30th, 1980, officially identified by NATO observers the following year. With the collapse of the Soviet Union in 1991 and the heavy defense cuts that followed, the vessel was placed in reserve status in 1990.At one time destined for the scrap heap, the vessel was renamed in 1992 to Admiral Ushakov and a plan was later announced for refitting and modernizing the Kirov fleet for reinstatement into the new Russian Navy. The Admiral Ushakov is expected to be recommissioned for active service with the Russian Fleet sometime around 2020 should the modernization program proceed as planned.\n\r\nThe naval term \"battlecruiser\" emerged in the 20th Century when it classified large, battleship-type capital ships for naval powers of the day. The type was differentiated from battleships by their lighter armoring which added improved speed and performance. They maintained the firepower of battleships but could be used to hunt down slower moving, less fortunate vessels of other navies. While many powers eventually abandoned the battlecruiser naming convention after World War 2 (1939-1945), the Soviet Union, under Joseph Stalin's direction, retained their use hence the Kirov-class battlecruisers of the 1970s.\n\r\nAs built, the Kirov displaced some 28,000 tons under full load and sported a bow-to-stern length of 827 feet, a beam of 94 feet and draught of 30 feet. Propulsion came in a hybrid form consisting of 2 x nuclear-reactors coupled with steam-based turbines, the latter providing boosting power while the combined arrangement delivered 140,000 shaft horsepower to 2 x shafts. As such, the vessel could be expected to reach speeds of 32 knots in ideal conditions with an operational range of 1,000 nautical miles. However, her nuclear-based propulsion theoretically allowed for essentially unlimited operational ranges, governed only by onboard food stores. The vessel was crewed by 727 personnel including an air arm of some 18 personnel and officers numbering 15. Armor protection included up to 76mm thickness near key components - primarily the nuclear reactor.\n\r\nThe profile of the Kirov exhibited a split-superstructure with the primary form at amidships with a secondary structure just aft. The main structure held the main mast as well as the bridge and various sensor and communications installations. The forecastle was home to vertical launch cells for missile armament while the stern was completed with a helicopter flight deck. The smoke funnel was contained at the frontal superstructure and combined with the main mast assembly. The main mast was home to an air-search radar pairing while an air-surface search system and fire control system (FCS) were seated at the secondary mast structure. The bow exhibited a noticeable upwards angle which gave the Kirov a distinct appearance along the horizon.\r\n\t\t", "ship_name": "Admiral Ushakov (Kirov)", "ship_type": "Nuclear-Powered Battlecruiser Warship"}, {"id": "3e71e18d-aaf8-421c-9a89-6799ea4acfac", "year_model": "1980", "description": "\r\n        \tLike many other leading naval powers of the world, the Russian Navy fields a healthy collection of destroyer warships - about thirteen in all - behind the United States (65), Japan (36) and China (29). Such ship types are built to be fast in the water and reach out to far-off destinations on internal fuel and can be used as independent solutions / deterrents or as part of the main fighting force. Flexibility-in-service is expanded by the type's ability to feature a flexible armament suite which allows the ships to tackle just about any at-sea threat - be it in the air, on the water, or under it.\n\nRussian Navy Destroyers\n\r\nThe Russian Navy currently (2018) operates three distinct batches of destroyer warships - the Kashin-class, Udaloy-class and Sovremennyy-class. The Sovremennyy-class (Project 956) numbered twenty-one ships when it was ultimately adopted and finally completed though only three of her number are in active service today (2018): Bystryy, Nastoychivyy and Admiral Ushakov commissioned in 1989, 1993 and 1994, respectively (Burnyy is said to be undergoing modernization as of this writing, 2018). All displace in the 7,940 ton range. Bystryy is assigned to the Pacific Fleet, Nastoychivyy to the Baltic Fleet and Admiral Ushakov to the Northern Fleet.\n\r\nAll were built by Severnaya Verf 190 of St. Petersburg.\n\r\nThe Sovremennyy-class was used to succeed the aging Kashin-class but was itself succeeded by the Lider-class. China adopted the design as well in the late-1990s/early-2000s.\n\nBackground\n\r\nThe submarine was the bread-and-butter instrument of the Soviet Navy throughout the Cold War but World War 2 (1939-1945) continue to influence post-war doctrine for all sides and revealed the value of surprise amphibious landings against an enemy. As such, the Soviet Navy was continually drawn up to include gun-laden warships to support such actions in far-away lands. New warships were taken from drawing boards to shipyards, including the Sovremennyy-class, and the \"multi-mission\" mindset for these ships soon was introduced to help evolve the line and keep them on par with American counterparts in the West.\n\nSpecifciations\r\nAs such, the group is designed for several key operating roles including airspace denial, anti-ship sorties and Anti-Submarine Warfare (ASW). Displacement is 6,600 tons under standard load and 8,500 tons under full load. Dimensions include a running length of 511.9 feet with a beam of 56.8 feet and a draught of 21.3 feet. Power is from 4 x Boiler units feeding 2 x Steam turbines producing 100,000 horsepower to 2 x Shafts. 2 x Turbo-generators and 2 x Diesel generators complete the propulsion scheme.\n\r\nThe warships are able to range out to an impressive 16,000 miles and reach speeds nearing 33 knots in open sea under ideal conditions.\n\r\nAboard is a crew of 350 personnel. An air arm is part of the crew for the sole helipad can support a single Kamov Ka-27 \"Helix\" (or similar) navy helicopter equipped for Anti-Submarine Warfare (ASW), anti-ship or at-sea replenishment roles.\r\n\t\t", "ship_name": "Sovremennyy-class (Project 956 Sarych)", "ship_type": "Guided-Missile Destroyer Warship"}, {"id": "d1b51015-0c34-4f19-bb49-e23ca0a4ef35", "year_model": "1977", "ship_name": "Tarantul / Project 1241/12411/1242 (class)", "ship_type": "Guided-Missile Corvette Warship"}, {"id": "dc89b55b-485f-452d-89c1-3f5e7d895902", "year_model": "1975", "description": "\r\n        \tThe modern Russian Navy continues to invest resources into fielding an effective amphibious fighting force and manages a healthy stable of amphibious support ship such as the Ropucha-class (Project 775). These landing ships are used in conjunction with other amphibious fighting elements such as marines and vehicles when taking the fight to the enemy from \"ship-to-shore\". The craft are shallow-draught, measuring just 12.2 feet deep. to better wade to within reach of shorelines and release their fighting cargo. Twenty-eight of the craft were completed with the first examples coming online in 1975 - while there still was a Cold War with the West. The last ships were taken into service in 1991.\n\r\nThe Ropucha-class craft were all constructed at the Stocznia Polnocna Shipyard at Gdansk, Poland during the Cold War period.\n\r\nThe landing ships displace 2,200 tons under standard load and up to 4,100 tons under full load. Each has a length of 369.10 feet with a beam measuring 49.2 feet. Drive power is from 2 x Marine diesels developing 19,200 horsepower to 2 x Shafts under stern. The vessels can reach speeds of 18 knots and range out to 6,100 nautical miles - making them somewhat independent \"Blue Water\" vessels. Aboard is a crew of about 98-100 personnel.\n\r\nThe hull is drawn up to carry up to 10 combat-laden Main Battle Tanks (MBTs) or 12 wheeled Armored Personnel Carriers (APCs) / Infantry Fighting Vehicles (IFVs) or even a mixed cargo force of tanks, self-propelled guns, support vehicles, and logistical vehicles. Up to 313 infantry can be hauled or up to 500 tons of useful cargo in the form of supplies for establishing beachheads or supplying inland troops. Cargo is released through large doors found at the bow and stern of the ship with the vehicle deck running the entire length of the vessel.\n\r\nThe Ropucha-class ships have self-defense-minded weaponry installed, particularly to support shoreline actions and defend against low-flying threats. 2 x twin-barreled 57mm AK-257 autocannons are carried (Ropucha I ships only) as is a single 76mm turreted gun fit. To this is added 2 x 30 122mm A-215 series Grad-M rockets for area suppression. Strela-2 (SA-N-5) short-range surface-to-air missile launchers also aid in airspace deterrence. Close-in support is through 2 x 30mm AK-630 digital combat units sporting Gatling-style guns.\n\r\nTwo distinct forms of the Ropucha-class ships are in service - original Project 755 (known as \"Ropucha I\") vessels numbering twelve and modified/modernized Project 775M (known as \"Ropucha II\") vessels numbering three. The latter group can carry more infantry and has improved defensive armament to deal with more modern emerging threats.\n\r\nThe Ropucha-class craft are in service with the navies of Russia, Ukraine, and Yemen. Russian types were used in combat during the War in South Ossetia in 2008 against Georgia. Ukraine managed only one ship, U402 Kostiantyn Olshansky, but this example was later captured by Russian forces in its takeover of Crimea from Ukraine. The sole Yemeni example was eventually sold off to private operators.\r\n\t\t", "ship_name": "Ropucha (class) / Project 775", "ship_type": "Amphibious Assault Landing Ship"}, {"id": "9e7f842f-0e50-48b1-9860-435c2671b650", "year_model": "1973", "description": "\r\n        \tStorozhevoy  was a 1135 Burevestnik-class ASW (Anti-Submarine Warfare) frigate built in 1973 for the Soviet Navy. This series of large frigates was specifically designed to counter the new American missile-capable Polaris-class submarines. By 1975, Premier Leonid Brezhnev had spent vast sums of money upgrading the armed forces and the new Burevestnik ASW frigates were the pride of the Soviet Navy. Brezhnev felt the Soviets needed to keep pace with the American Navy, resulting in an ongoing arms race during the Cold War. \n\r\nWith Communist victories in Southeast Asia and Latin America and a booming national economy in Russia, many felt the Soviet Union appeared to be winning the Cold War. By the early 1970s, the Soviet Union was at the peak of its power. The Communist Party remained the only political party in the Soviet Union and forced economic reforms allowed the Empire to have a strong economy and an increased standard of living for its citizens.\n\r\nThe NATO callsign for the new frigate class was the \"Krivak\" and the frigate Storozhevoy was attached to the Soviet Baltic Fleet based at Riga at the Gulf of Riga.  The design started in 1957 and developed into a large anti-submarine ship in the 1960s. A total of 40-plus ships were built for the Soviet Navy, the KGB Maritime Border Guard, Ukraine and India.  \n\r\nThe sleek design was 405 feet long and she weighed 3,300 tons. The vessel could make 32 knots with her gas turbines outputting at 40,000 horsepower.  She was on guard against the American submarine threat with upgraded radar - the Don Kay and Don 2. The Storozhevoy featured downward-looking \"Eye Bowl\" radar along with  the \"Pop Group\" sky-looking radar.  Her bow sonar was known as the \"Bull Nose\" and she towed a sonar array called the \"Mare Tail\" used in anti-submarine warfare sweeps.  \n\r\nThe ship's armament made her a tiger on the high seas with a bow-mounted anti-submarine RBU6000 missile box. She fielded 4 x 533mm torpedo tubes along her deck that would swing out to port and starboard at amidships to counter enemy subs at various angles. Additional submarine missiles aboard included the SA-N-4 \"Silex\" ASW (Anti-Surface Warfare) missiles and for anti-ship defense and  2 x 76mm Dual Purpose (DP) cannons for close-in aircraft defense. The Storozhevoy was traditionally crewed by 200 personnel made up of both officers and enlisted sailors. The funnel and the angled mast earned it a nickname among US Navy sailors that came from her silhouetted identification - \"Hot Dog Pack, Smokestack, Guns in Back - Krivak.\"\r\n\t\t", "ship_name": "Storozhevoy (Project 1135)", "ship_type": "Frigate / Submarine Hunter Warship"}, {"id": "91468c50-8e9b-44c4-a2a8-0bbb9cd5a418", "year_model": "1969", "ship_name": "Nanuchka (class) / (Project 1234 Ovod)", "ship_type": "Missile Corvette Warship"}, {"id": "c02bb713-44a3-474b-9f10-066d8e1d6373", "year_model": "1967", "ship_name": "Shmel-class (Project 1204)", "ship_type": "Armored Artillery Gunboat / Patrol Boat"}, {"id": "0be003f4-a395-430b-b8e3-a0e68a120ae0", "year_model": "1958", "ship_name": "Foxtrot (class) / (Project 641)", "ship_type": "Diesel-Electric Ocean-Going Attack Submarine"}, {"id": "876f59bc-2e47-43ed-81ee-8fcd6f073b3f", "year_model": "1958", "description": "\r\n        \tThe 1950s saw considerable growth for the Soviet Navy in regards to its submarine fleet which eventually rivaled that of the United States. The Romeo-class (Project 633) was a new diesel-electric powered group that proved one of the most numerous of its type during the Cold War period (1947-1991), numbering 133 total boats before the end. The series went on to see service with the Soviet Navy as well as the navies of China, North Korea, Algeria, Bangladesh, Bulgaria, Egypt, and Syria but its arrival was dampened somewhat by the rise of nuclear-powered submarines begin to take hold in the Soviet naval inventory.\n\r\nThe Romeo-class succeeded the Whiskey-class boats in Soviet service but were, themselves, succeeded by the much improved Foxtrot-class.\n\r\nThe modern North Korean Navy makes some use out of its obsolete Romeo-class fleet (as of 2017). These were received from China in pre-assembled kits which were then completed at North Korean shipyards. At least twenty or so are thought to be in inventory though their value tactical remains suspect. The fleet is thought to be facing (or has already faced) decommissioning in favor of the arriving Sang-O class (detailed elsewhere on this site). The Romeo-class boats from China were known as \"Type 033\" and this design emerged as a local development/evolution of the Romeo-class boat forced on the nation due to the Sino-Soviet Split. Improvements and redesigns were made to the class throughout its service life by China.\n\r\nAs designed, the Romeo-class boats had a surfaced displacement of 1,475 tons and a submerged displacement of 1,830 tons. Overall length reached 251.2 feet with a beam measuring 22 feet and a draught of 17 feet. Power was from 2 x Marine diesels outputting 4,000 horsepower for surface running and a pair of electric motors for undersea running. These all drove power to 2 x shafts astern. Surfaced speeds could reach over 15 knots and submerged speeds topped at 13 knots. Range was out to 9,000 miles.\n\r\nAboard was a crew of fifty-four which included ten officer-level personnel. A complete radar, sonar and Electronic Warfare (EW)/countermeasures fit was also installed. Armament was 8 x 533mm (21\") torpedo tubes arranged as six bow-facing and two stern-facing mountings.\r\n\t\t", "ship_name": "Romeo (class) / (Project 633)", "ship_type": "Diesel-Electric Attack Submarine"}, {"id": "98e49645-492e-4f2e-83a7-050a32b86200", "year_model": "1913", "description": "\r\n        \tThe Derzky-class, also known as the Bespokoiny-class, was an Imperial Russian Navy (IRN) destroyer class of the World War 1-era (1914-1918). The class was in commission from 1913 until 1941, the early part of World War 2 (1939-1945), and numbered nine ships in all. The series enjoyed a certain level of success against the Turks in the Black Sea during operations concerning World War 1 where there was nothing in the region that could match them on the enemy's side. The class was used to succeed the slightly larger destroyer \"Novik\" and was itself succeeded by the newer Fidonisy-class of 1916.\n\r\nThe vessels had traditional silhouettes with their midships dominated by three inline smoke funnels. The bridge was held well-forward of midships at the forecastle with a single gun emplacement fitted ahead. The bow hull line was raised while the rest of the vessel featured a low line running unbroken to the stern. A second hull superstructure was fitted aft of the inline smoke funnels. There were to masts, one forward and one aft.\n\r\nPower stemmed from five boiler units feeding 2 x Brown Boverei turbines developing 25,500 horsepower to twin shafts. Maximum speed in ideal conditions reached 34 knots which gave the vessels good legs in open sea.\n\r\nArmament centered on 3 x 102mm (4\") main guns with 2 x 47mm (1.9\") Anti-Aircraft (AA) guns and 3 x 7.62mm machine guns. 10 x 457mm (18\") torpedo tubes were carried in five twin-tubed launcher sets. Up to eighty naval mines could also be carried and used to deny water routes to the enemy.\n\r\nDimensions included a running length of 321.5 feet with a beam of 30.5 feet and a draught of 10.5 feet. Displacement reached 1,100 tons under standard load and 1,350 tons under full load. Aboard was a crew of some 125 sailors.\n\r\nThe nine ships of the class were Bespokoiny, Derzky, Gnevny, Pronziteiny, Bystry (later renamed Frunze), Gromki, Pospeshny, Pylki and Schastivy. Construction of the group was split between several shiyards - Nikolayev Navy Yard, Metal Works (Kherson) and Putilov Yard. The first ships, Bespokoiny and Gnevny, were both launched on October 31st, 1913 with Gromki following on December 19th of that year. The remaining vessels were all in service for 1914.\n\r\nTheir operational tenure was heavily disrupted by the Russian Civil War (1917-1923) that all but ended Imperial Russian involvement in World War 1 and Imperial Russia as a whole. Many of the ships in the class were scuttled by their crews to avoid capture by the revolutionaries and were the last remnants of the Black Sea Fleet loyal to the Empire.\n\r\nOf the nine Derzky-class destroyers completed, three were lost in service. Bespokoiny was interned at Bizerte and scrapped in 1924 as was Dersky, Gnevny, Pospeshny and Pylki. Pronzitelny was scuttled on June 18th, 1918 near Novorosiysk as was Gromki. Schastiivy was run aground on October 24th, 1919 while under tow to its internment site. Bystry was scuttled by her crew in 1919 to avoid capture but eventually raised and reconstituted back into service with the newly-born Soviet Navy. It sailed into the 1940s where it was dive-bombed into history by German Stukas on September 21st, 1941.\r\n\t\t", "ship_name": "Derzky-class (Bespokoiny-class)", "ship_type": "Destroyer Warship"}, {"id": "04c13593-8f66-417d-ba56-ceafe2a7cfd9", "year_model": "1905", "description": "\r\n        \tThe word \"Slava\" itself translates to \"Glory\" in Russian and her representative vessel was the last of the Borodino-class battleships to be built. She was launched in 1903 and commissioned in 1905, this timing making her a \"pre-dreadnought\" battleship.  Her class design was copied from the Russian battleship \"Tsesarevich\" which itself was constructed in France from a blueprint that was devised from a team of both French and Russian engineers. Due to the lack of shipbuilding space across Russia, many of her surface vessels were constructed through these foreign port arrangements. Slava was commissioned too late to take part in the Russo-Japanese War of 1904-1905 though the other four ships of her class were either sunk or surrendered by/to the Imperial Japanese Navy (IJN).  After conclusion of hostilities, Russia had lost many of her capital ships, making Slava one of her most powerful vessels still operating with the Baltic Fleet.\n\r\nHer Krupp-brand steel belt armor was 5.9- to 9.0-inches (150-230mm) thick and her deck was covered over in 2.25-inches (57mm) of armor to protect against plunging fire. The 12-inch main gun turrets and their crews 10-inches (250mm) of armor while secondary 6-inch turrets received 5.9-inches (150mm) of armor. Along with the bridge, the conning tower was protected by up to 10-inches (250mm) of armor plate. \n\r\nAs a whole, Slava was 397 feet, 3 inches (121.08 meters) long and her beam was 76 feet, 1 inch (23.19 meters) along a draft of 29 feet, 2 inches (8.89 meters). Her displacement registered at 15,520 long tons. For steaming, Slava was equipped with a pair of 4-cylinder, vertical, triple expansion steam engines fueled by coal heating water across 20 tube boilers - both constructed by the Baltic Works Company. The engines outputted 15,800 ihp (11,782 kW) and produced 16,378 ihp (12,213 kW) resulting in a top speed of 17.64 knots (32.67 km/h; 20.30 mph). She could carry 1,350 long tons (1,370 tons) of coal that allowed her to steam out to 2,590 nautical miles (4,800 km) at a reduced speed of 10 knots (19 km/h) using her twin shafts with four-bladed screw propellers.\r\n\t\t", "ship_name": "Slava", "ship_type": "Pre-Dreadnought Battleship"}, {"id": "dab5446f-e0c5-45b1-96ae-daaf1f55b2af", "year_model": "1903", "description": "\r\n        \tIn the late 1800s, Russia acquired Port Arthur in Manchuria (through coerced lease) and this was notable because it represented an ice-free port for its Navy with free access to the Pacific. To defend its control, Russian leader Tsar Nicholas II ordered several warships to be constructed with one of these becoming the Tsesarevich. Due to a lack of shipbuilding capabilities within Russia, the warship was constructed in France and delivered to the Russian Navy upon completion. Tsesarevich was ordered on July 20th, 1898 and built by Forges et Chantiers de la Mediterranee of France. Her keel was laid down on July 8th, 1899 and she was launched on February 23rd, 1901. Her commissioning followed on August 31st, 1903.\n\r\nThe Tsesarevich was a pre-Dreadnought battleship which predated the arrival of HMS Dreadnought (1906). HMS Dreadnought brought about the rise of the all-big-gun, steam powered capital ship and rendered mixed gun, coal-powered warships obsolete as a result. As such, Tsesarevich carried a mixed-gun armament consisting of 2 x 305mm (12\") main guns, 6 x 152mm (6\") secondary guns, 20 x 75mm (3\") guns, 20 x 47mm (1.9\") guns and 8 x 37mm (1.5\") guns. Additionally there were 4 x 381mm (15\") torpedo tubes fitted. Power was from 20 x Belleville boilers feeding 2 x Vertical triple-expansion steam engines driving 16,300 horsepower to 2 x Shafts. Maximum speed was 18 knots with a range out to 5,500 nautical miles.\n\r\nAs built, Tsesarevich exhibited a length of 388.8 feet, a beam of 76 feet and a draught of 26 feet. Her crew complement numbered 778 and armor protection reached 10\" at the conning tower. The belt held up to 9.8\" and the decks up to 2\". Her profile featured a forward set bridge superstructure, midships-based smoke funnels and a twin-mast arrangement. On the whole, her appearance was consistent with warship design of the late-1800s.\n\r\nAfter entering service in 1903, Tsesarevich was sent to the Far East and took up station in Port Arthur before the end of the year. She represented the more formidable warship in the Russian Navy fleet at the time and a considerable foe for Japan when the two nations went to war in the Russo-Japanese War of 1904-1905.\n\r\nIn the opening rounds of the conflict, Japanese torpedo boats struck the Russian fleet where it berthed on the night of February 8th - Tsesarevich being one of the targets. The vessel took a torpedo into her side that caused a noticeable list but counter-flooding was able to right the warship and keep it afloat. However, once she got moving, she ran aground at the port entrance and remained in her damaged state until June 7th. She then broke down while attempting to break the Japanese blockade and was part of several inconclusive actions against the Japanese fleet thereafter. It managed to reach the German treaty port of Tsingtau and was disarmed and interned for the duration of the war.\n\r\nThe vessel was then returned to Russia and formed part of the Baltic Fleet. In 1906 it took part in suppressing the Sveaborg rebellion, a Russian military mutiny born from the 1905 Russian Revolution.  That same year her profile changed some as her superstructure was shortened and she lost some of her 75mm guns. Her next participation was in response to the Messina earthquake in December of 1908. Her propulsion scheme was drastically updated from 1909 to 1910.\n\r\nTsesarevich was still in commission by the time of World War 1 (1914-1918) but saw little action in the conflict. There was another mutiny, this time involving Tsesarevich as a host ship, in the early part of 1917. Following the February Revolution, the warship was renamed to \"Grazhdanin\" on April 13th. Then came her participation in the Battle of Moon Sound during October 1917 which ended as a German victory in the Baltic Sea. Grazhdanin took several direct hits from German guns and retreated.\n\r\nBefore the end of the year, she was taken over by the Bolsheviks and retired by May 1918. She was scrapped in 1924 and her name was stricken from the Naval Register on November 21st, 1925.\r\n\t\t", "ship_name": "Tsesarevich", "ship_type": "Predreadnought Battleship"}, {"id": "392e8a49-5976-4290-89e2-4f36bddb3bc1", "year_model": "1874", "description": "\r\n        \tThe idea of a circular battleship emerged in a 1868 report from Scottish shipbuilder John Elder and evolved by the Royal Navy's Edward Reed but not officially realized until Rear-Admiral Andrei Popov of the Russian Navy pressed home the concept. The design revolved around a shallow-draft vessel capable of traversing low-level waters such as rivers and lakes, giving it proper access to more battlefronts than traditional well-armed warships could ever reach. The concept also spread out the displacement of both armor and armament, leading to a (theoretically) more powerful warship than possible through conventional designs. The end result, however, became one of the most panned warships ever completed - the \"Novgorod\" which was to represent a class of such ships. Its circular hull did allow for the expected armoring and armament benefits but it suffered from stability in anything more than calm waters and accuracy of its main armament was left wanting.\n\r\nOnly one example of this unique, and mostly forgettable, ship was built for the Russian Navy.\n\r\nThe Novgorod was intended as a new class of Russian monitors to help protect Black Sea and Dnieper River positions. She was named after the Russian city of Novgorod and constructed by the New Admiralty Shipyard of Saint Petersburg from the span of 1871 until 1874. Her keel was laid down on December 29th, 1871 and she was launched to sea on June 2nd, 1873. Completed in 1874 she began formal service with the Russian Navy.\n\r\nOriginally Novgorod was developed along the lines of a monitor ironclad. Her dimensions included a length of 101 feet with a beam equaling that while her draught was just 13.5 feet. Displacement was 2,500 tons (long) and power was from six compound-expansion steam engines fed by eight boilers - all this driving six shafts (the outboard pair were removed in 1876-1877 due to their minimal propulsion benefits). At best, the ship could hope to make upwards of 6.5 knots in ideal conditions.\n\r\nTwo smoke funnels - one at port side and the other starboard - were fitted along the sides of the circular shape with the main armament seated at direct center. The wheelhouse was fitted over the rear section of the circle (added between 1873 and 1874) and elevated walkways (\"bridge wings\") were featured as extensions from the funnel towers. A large-area superstructure (housing crew quarters) was added to the bow section and hand rails ran around nearly the entire diameter of the hull. Primary armament was 2 x 11\" (280mm) guns though, while rifled, remained muzzle-loading weapons. A rotating turntable gave the guns their inherent traversal and could be aimed and fired jointly or independently of one another. Provisions were also made for carrying a \"spar\" torpedo weapon. Armor protection ranged from 9\" at the belt to 9 inches at the barbette. The deck offered up to 2.75\" of protection.\n\r\nNovgorod's first, and only real, call-to-arms came during the Russo-Turkish War (1877-1878) where she was stationed at Odessa to act as a floating deterrent.  Additional armament was added at about this time, this in the form of 2 x 4-pounder (3.4\") cannon to improve her all-around defense - particularly against enemy torpedo boats which had grown to become a primary threat to capital ships. The war ended in March of 1878 with a Russian-Coalition victory.\n\r\nIn the post-war period, armor was added to her engine area and the main gun battery. In 1892 she was redesignated a \"coastal defense ironclad\" and had 2 x 37mm cannons added. From then on she made a few cruises in good weather periods but eventually deteriorated to the point that her services were no longer needed. She was struck from the Naval Register in July 1903 and sold for scrapping before the end of 1911.\n\r\nThus ended the idea of a circular metal-clad warship.\r\n\t\t", "ship_name": "Novgorod", "ship_type": "Circular Monitor Ironclad Warship"}, {"id": "bca17502-03ed-4682-adcf-b3a6d79af9ee", "year_model": "1869", "description": "\r\n        \tSMS Konig Wilhelm was originally ordered by the Ottoman Navy as \"Fatikh\" and saw her keel laid down in 1865 by Thames Iron Works of London. However, her future quickly changed when she was sold off to the Kingdom of Prussia in early 1867 but her eventually career would be with Germany after the demise of the Prussian Navy. Launched on April 25th, 1868. SMS Konig Wilhelm saw her construction end in 1869 and commission forthcoming on February 20th, 1869. When taken into service with the Prussian Navy, she made up the most powerful vessel in the fleet.\n\r\nThe warship displaced 10,755 tons (short) and featured a length of 368 feet, a beam of 60 feet and a draught of 28 feet. Her propulsion power came from 8 x trunk-style boilers feeding a single Maudslay, Son & Field (London) 2-cylinder horizontal single-expansion steam engine driving a single shaft. She could make headway at nearly 15 knots in ideal conditions and held a range was out to 1,300 nautical miles. Despite her machinery the vessel was still outfitted with three sailing masts to help supplement her more onboard propulsion system - such was the warship design practice of the day.\n\r\nThe crew complement for Konig Wilhelm numbered 730 men. Armor protection reached up to 395mm thickness at the belt and 150mm thickness at the battery. Main armament originally 33 x 72-poundr guns but this later became 18 x 9.4\" (240mm) main guns backed by 5 x 8.3\" (210mm) secondary guns. Improvements to her armament suite also later included the addition of torpedo tubes and smaller-caliber gun installations.\n\r\nUnder Prussian ownership, the vessel originally carried the name of \"Wilhelm I\" but this was officially changed to \"Konig Wilhelm\" on December 14th, 1867. Due to her power and prestige, the warship quickly was made the flagship of the Prussian Navy. With the arrival of the Franco-Prussian War (1970-1871), the Konig Wilhelm was placed into action for the first time in her sailing career. However, the warship would see no direct combat in the conflict as her machinery was plagued with unreliability. In the post-war period, Konig Wilhelm suffered considerable damage when colliding with the ironclad Grosser Kurfurst. Repair work spanned from 1878 to 1882 at Wilhelmshaven.\n\r\nIn the decades following, Konig Wilhelm went on to serve in various roles that would see her become fleet flagship and a ceremonial platform as well as partake in training exercises. In 1895 she was placed in drydock and modified for the role of armored cruiser which revised (and improved) her armament fit. It was at this time that she lost her original sailing masts and saw a pair of pole masts take their place. The crew complement was also increased beyond 1,100 personnel.\n\r\nKonig Wilhelm re-entered German naval service in January of 1897 to which her career now took her to reserve status for 1904. While laying in harbor, she was given the role of barracks ship from 1904 until 1907. From there, she served as a floating training platform throughout World War 1 (1914-1918). While surviving the conflict, her days on the water were numbered and she fell to the scrapman's torch in the massive worldwide military drawdown that followed the conflict. Her name was struck from the Naval Register on January 4th, 1921 and her stripped hulk was soon sold for scrapping - bringing about an end to over fifty years of service to both the Prussian and German navies.\r\n\t\t", "ship_name": "SMS Konig Wilhelm (1869)", "ship_type": "Armored Frigate / Armored Cruiser Warship"}, {"id": "23f9ae2a-5357-4f92-a154-fc4227cb8079", "year_model": "1865", "description": "SMS Arminius", "ship_name": "SMS Arminius", "ship_type": "Ironclad Warship"}]