[{"id": "63683225-437b-46cc-bda9-dfc3c39a2ef7", "year_model": "1975", "description": "\r\n        \tBeginning in the late 1960s, the Soviet engineers began design and development of a new 152mm towed field gun. Following the requisite trials in the early1970s, the weapon was formally adopted for service as the 2A36 \"Giatsint-B\" in 1975. Today, it remains an active inventory portion of several  operators including Russia, Armenia, Azerbaijan, Belarus, Finland (as the \"152 K 89\"), Georgia, Moldova, Iraq, Lebanon and Uzbekistan. Production of the 2A36 spanned from 1975 into 1989 by the Perm Automobile Factory SKV and the same gun also makes up the main armament of the 2S5 \"Giatsint-S\" self-propelled gun (SPG) platform.\n\r\nThe 2A36 is largely of a conventional design as towed artillery pieces go. It features a four-wheeled, rubber-tired carriage useful for transporting the massive gun by mover vehicle. The carriage also features a split-trail arrangement that doubles as the recoil \"legs\" when the gun sits in its emplacement (for firing). The rifled barrel is of single piece construction featuring a multi-slotted muzzle brake at its business end and an integrated recoil mechanism down at the mounting. The weapon utilizes a semi-automatic breech block action when loading/reloading with hydraulic power used in elevation, this spanning from -2 to +57 degrees to serve in both the direct- and indirect-fire role as needed. Traverse is limited to -25 to +25 degrees to either side. As a system, the 2A36 weighs a hefty 21,500lb and showcases a length of 40 feet when set up to fire. The carriage provides a wide of 7 feet, 8 inches.\n\r\nFiring a 152.4mm cartridge (charges are loaded separate), the 2A36 can make use of a variety of projectile types including conventional HE (High-Explosive), Anti-Tank (AT), nuclear, submunitions and a rocket-assisted shell which dramatically improves realistic effective ranges. Shells exit the muzzle at up to 3,100 feet per second with listed ranges for conventional ammunition out to 19 miles. Rocket-assisted projectiles gain a range out to 25 miles. The artillery piece relies on an operating crew of eight made up of a group leader, ammunition handlers and gun layers.\n\r\nDespite their Cold War-era origins, 2A36 operators have moved ahead with modernization programs to help keep their guns viable on today's battlefield. Additions include digital support and satellite positioning for improved accuracy at range.\r\n\t\t", "vehicle_name": "2A36 Giatsint-B (Hyacinth)", "vehicle_type": "152mm Towed Field Gun"}, {"id": "926499de-a02f-4c1a-af4b-bb0639b37fae", "year_model": "1987", "description": "\r\n        \tIntroduced in 1987 - the last few years of the Cold War between the Soviet Union and the West - was the 152mm 2A65 \"MSTA-B\" towed howitzer system. The weapon was brought along as a conventional artillery produce featuring a twin-wheeled, split-trail carriage, minimal gunshield, and multi-baffled muzzle brake. Design work spanned 1976 to 1986 by the Central Design Bureau (Titan) and production has been ongoing out of the Motovilikha Plant since.\n\r\nAs designed, the weapon features a combat weight of 15,000 lb and is operated by a crew of up to ten personnel. It traditionally fires a High-Explosive (HE) shell out to 18 miles through a 2,720 feet-per-second muzzle velocity though there is support for various other projectile types - anti-infantry, chemical, nuclear, etc... The standard gun mounting hardware allows for an elevation span of -3.5 degrees to +70 degrees and traversal of 28 degrees from centerline. Rate-of-fire is listed at eight rounds-per-minute in burst fire phases.\n\r\nOperators of the 2A65 series include Armenia, Azerbaijan, Belarus, Georgia, Kazakhstan, Russia and Ukraine. Russia is, by far, the largest operator of the weapon with some 750 units in inventory. \"M-390\" is the designation used to mark export versions of the 2A65. A fume extractor differentiates the other export-minded version - the \"MZ-146-1\". The 2A65 is known to NATO as the \"M1987\" (\"Model 1987\"). The 2A65 is also the primary weapon aboard the 2A19 Self-Propelled Gun (SPG) artillery vehicle (detailed elsewhere on this site).\n\r\nBecause both the Russians and the Ukrainians have invested in the 2A65 system, it has been featured for both sides of the fighting in the Donbass Region (\"War in Donbass\", 2014-Present).\r\n\t\t", "vehicle_name": "2A65 MSTA-B", "vehicle_type": "152mm Towed Howitzer"}, {"id": "50a8258e-15d8-47da-a6c9-413a53deff0a", "year_model": "1972", "description": "\r\n        \tThe 2S1 Gvozdika (translating to \"Carnation\") was a standard Red Army self-propelled howitzer platform. The type was recognized in the West in 1974 and given the appropriate designation of \"M1974\". Production of the type was undertaken at state factories in the Soviet Union, Bulgaria and Poland to which several thousand of these capable systems were delivered. Operators beyond the Red Army included various satellite nations, communist allies and Soviet-friendly nations the world over. The initial 2S1 prototype was completed in 1969 and the type entered service with the Red Army sometime in the early 1970s. Once in operational service, the 2S1 was available in large numbers.\n\r\nThe Soviet Army gained much valuable experience in their dealings with the capable German Army in World War 2. In the decades following, a commitment to ever-improving army support was key to the might of the Soviet land army. Such systems in development became large caliber mortars, field guns, main battle tanks and self-propelled artillery. The advent of the missile age also helped to expand the lethal reach of Soviet military hardware and its weapons were shipped off to any pro-Soviet regime. The 2S1 self-propelled howitzer was one such implement that utilized proven mechanical components with a powerful main gun. Its howitzer nature ensured that it would have been used in support of Soviet troop and armor actions should the Cold War in Europe had ever turned \"hot\".\n\r\nThe 2S1 borrows much of its design from the MT-LB multi-role tracked vehicle. The hull is rather long and featureless, making room for the flat, all-welded turret emplacement to which a 122mm, double-baffled main gun is fitted. This provides the 2S1 with a low profile and squat appearance, making her easy to conceal and more difficult to identify. The glacis plate is well sloped towards the turret roof for optimal ballistics protection. The multi-faceted turret is fully powered and holds three of the four crew - the commander, loader and gunner while the driver mains a forward left-hull position. The turret can traverse a full 360 degrees and provides for an elevation range of +70 to -3 degrees. A fume extractor is clearly identified along the gun barrel. The engine is fitted to the front of the hull. The running tack systems are fitted to each hull side and sport seven road wheels and feature and adjustable suspension system. The drive sprocket is at the front with the track idler at the rear. No track return rollers are present. Beyond the main gun fitting, there are no other secondary weapon systems available to the crew. Armor protection is 20mm at its thickest.\n\r\nOne of the key qualities of the 2S1 design is its fully amphibious nature, allowing it to traverse water sources with little preparation on the part of the crew. While no dedicated propulsion jet is fitted, the 2S1 is propelled through water by the motion of its own track systems.\r\n\t\t", "vehicle_name": "2S1 Gvozdika (M1974)", "vehicle_type": "122mm Self-Propelled Artillery (SPA)"}, {"id": "cdad3e87-2910-4eb5-89a4-b3a547f4a517", "year_model": "1989", "description": "\r\n        \tThe 2S35 Koalitsiya-SV self-propelled artillery system has been developed for the Russian Army as a successor to the late-Cold-War-era 2S19 MSTA series vehicle (detailed elsewhere on this site). The 2S35 was debuted during the 2015 Moscow Victory Day Parade and the product has been inching ever closer to full operational service in the inventory of Russian ground forces. Service entry is expected sometime in 2018 or later.\n\r\nThe 2S35 was born as an offshoot of the existing 2S19 design and prototypes were devised along this line, utilizing the same running gear, powerplant and chassis as the original (though with a slightly altered turret). One form relied on a twin-barreled 152mm arrangement but this approach was not furthered / adopted. The revised design, essentially an all-new offering, was brought online around late-2014 and state trials were had leading to an order for serial production of the vehicles.\r\n\t\t", "vehicle_name": "2S19 MSTA", "vehicle_type": "Self-Propelled Artillery (SPA) Vehicle"}, {"id": "5f836c5d-20ee-4985-8028-3b1a8c017996", "year_model": "1971", "description": "\r\n        \tTo match the capabilities of the United States Army and its introduction of the 155mm-armed M109 SPA (Self-Propelled Artillery), the Soviet Union took to development of a similar-minded system of 152mm (152.4mm) caliber in the 2S3 \"Akatsiya\" (\"Acacia\"). The Soviet vehicle, designated as the \"M1973\" in American nomenclature, began its development during 1968 to which manufacture was directed by Uraltransmash and production spanned from 1967 to 1993. Several major forms ultimately emerged including all-modernized versions to keep the system a viable artillery piece. The 2S3 has since gone on to see considerable battlefield activity and proven itself on more than one occasion through its accuracy and mechanical reliability. As such, many remain as frontline use today (2014), primarily with former Soviet states and global allies.\n\r\nThe heart of the 2S3 is its D-series L/27 main gun based on the D-20 army howitzer. Typically, a single vehicle carried 40 to 46 projectiles in a mixed arrangement to include HE-FRAG (High-Explosive, FRAGmentation), HEAT-FS (High-Explosive, Anti-Tank, Fin-Stabilized), Armor-Piercing, Tungsten (AP-T), smoke and illumination projectiles. The main gun is affixed to a turret allowing for full 360-degree traversal to be achieved. The mounting also gives an elevation range of -4 to +60 degrees. Loading is through a semi-automatic, vertical wedge breech with a rate-of-fire reaching four rounds per minute. Conventional shells range out to 11.5 miles while Rocket-Assisted Projectiles (RAPs) can reach out to 15 miles. Secondary armament (optional) included a remote-controlled 7.62mm PKT machine gun to which 1,500 x 7.62mm rounds were carried.\n\r\nThe 2S3 is typically fielded with a crew of six made up of the driver, vehicle commander, gunner, loader and a pair of ammunition handlers though some versions are seen with a crew of four. Armor protection ranges from 15mm to 30mm, the thickest sections along the front of the hull and turret.\n\r\nThe vehicle's drivetrain includes a V-59 series 12-cylinder, water-cooled, diesel-fueled engine developing 520 horsepower at 2,000rpm. This is mated to a planetary gearbox. The running gear (track-over-wheel arrangement) showcases six double-tired road wheels to a hull side, the drive sprocket at front and the track idler at rear. The hull sits atop an independent torsion bar suspension system with hydraulic shock absorbers found at the first and sixth wheel pairings. Performance specifications include a maximum road speed of 40 miles per hour.\n\r\nOriginal 2S3 vehicles were designated simply as \"2S3\" and these saw production from 1970 to 1975. The 2S3M mark followed as a modernized version and introduced a slightly revised hatch arrangement as well as increased internal stowage for more 152mm projectiles among other features. The main gun was updated to support laser-guided, RAPs and production spanned from 1975 to 1987. The 2S3M1, which was produced from 1987 to 1993, marked a new 2S3 standard when introduced, given a new sighting device and additional equipment to improve battlefield support and awareness. Earlier 2S3 and 2S3M marks were eventually updated to this standard. The 2S3M2 of 2000 became another further modernized mark and introduced use of an automatic Fire Control System (FCS) as well as externally-mounted smoke grenade dischargers and a satellite-based navigation system. This mark has been exported under the 2S3M2-155 designation. The 2SM3 is a known developmental 2S3 mark incorporating a new FCS and new howitzer gun, more in line with that as found on the modern 2S19 Msta SPA. As such, it can share the same ammunition clearances.\n\r\nOperators of the 2S3 have proven plentiful with many still showcasing the system as frontline weapon. Beyond the obvious Russian Army connection (which absorbed thousands of the ex-Soviet Army stock), the vehicle has been taken on by the armies of Azerbaijan, Algeria, Angola, Armenia, Belarus, Cuba, Ethiopia, Georgia, Hungary, Kazakhstan, Libya, Russia, Slovakia, Syria, Turkmenistan, Ukraine, Uzbekistan and Vietnam. Former operators include Bulgaria, East Germany and Iraq. The United States Army gained access to four examples from Germany following the fall of the Berlin Wall and an additional three were gained in dealings with the Ukrainian government following the fall of the Soviet Union.\n\r\nThe Russian Army maintains about 930 active 2S3 systems in its inventory with a further 1,600 believed to be held in storage. It is also used by the Russian Marines.\n\r\nThe 2S3 has become a truly battle-tested weapon system, first used in anger during the Soviet involvement in Afghanistan (1979-1989). It was then pressed into action during the Tajikistan Civil War (1992-1997) and used during both of the Chechen Wars (1994-1996, 1999). In the 2008 South Ossetia War, the 2S3 was again in play with good results. Foreign forces have dutifully showcased their 2S3s in turn, as in the 2011 Libyan Civil War and the ongoing Syrian Civil War, also originating in 2011.\r\n\t\t", "vehicle_name": "2S3 Akatsiya (SO-152) / (M1973)", "vehicle_type": "152mm Self-Propelled Artillery (SPA)"}, {"id": "f01c79ba-8773-49d2-84d5-5da02ca149f6", "year_model": "2003", "description": "\r\n        \tThe 2S34 \"Chosta\" is a Russian modernization of the Soviet-era 2S1 \"Gvozdika\" self-propelled artillery (SPA) platform to coincide with changing battlefield requirements of the new Russian Army. The vehicle fulfills an important role in the Army by supplying heavy mobile artillery fire at range with a variety of ammunition types at its disposal. Various improvements to the original platform have been introduced to keep the vehicle a viable battlefield component and make her an essentially new design.\n\r\nThe vehicle maintains the same low-profile and dimensions as the 2S1 including its running gear. There are seven road wheels to a track side with a front-mounted drive sprocket and rear idler. There are no track return rollers present. The engine is fitted to the front-right of the hull with the driver at the front-left. This allows the center-rear of the vehicle to seat the traversing powered turret housing the main crew, ammunition stores and main armament. Access hatches along the turret roof line allow entry/exit for the turret crew. The driver is granted a vision block and access hatch at his position as well as a hinged armor panel. The engine is exhausted through a port along the front-right side of the hull. The glacis plate is well-sloped which provides a shallower target. The vehicle showcases a maximum road speed of 60 kilometers with an operational of 500 kilometers thanks to its diesel engine installation.\n\r\nKey changes to the original 2S1 system include the installation of a new, more potent 120mm 2A80 main gun, replacing the standard 122mm 2A31 series. A new Fire Control System (FCS) is mated to the gun that promises improved accuracy, rate-of-fire and support for more ammunition types at the disposal of the Russian Army (including guided munition types). Two banks of three smoke grenade dischargers have been added to the turret sides allowing the vehicle to screen its own movements in-the-field. A trainable mounting at the commander's hatch supports a 12.7mm anti-aircraft machine gun.\n\r\nTo date (February 2014), the current Russian Army inventory counts approximately 30 2S34 vehicles. \r\n\t\t", "vehicle_name": "2S34 Chosta", "vehicle_type": "Self-Propelled Howitzer (SPH)"}, {"id": "fc7b8e8d-e732-4aa6-a1c1-72627eed7fd9", "year_model": "2018", "description": "\r\n        \tThe 2S35 Koalitsiya-SV self-propelled artillery system has been developed for the Russian Army as a successor to the late-Cold-War-era 2S19 MSTA series vehicle (detailed elsewhere on this site). The 2S35 was debuted during the 2015 Moscow Victory Day Parade and the product has been inching ever closer to full operational service in the inventory of Russian ground forces. Service entry is expected sometime in 2018 or later.\n\r\nThe 2S35 was born as an offshoot of the existing 2S19 design and prototypes were devised along this line, utilizing the same running gear, powerplant and chassis as the original (though with a slightly altered turret). One form relied on a twin-barreled 152mm arrangement but this approach was not furthered / adopted. The revised design, essentially an all-new offering, was brought online around late-2014 and state trials were had leading to an order for serial production of the vehicles.\r\n\t\t", "vehicle_name": "2S35 Koalitsiya-SV", "vehicle_type": "Self-Propelled Artillery (SPA) Vehicle"}, {"id": "385d7848-6dc8-44eb-a64a-fa5fd2bd815e", "year_model": "1975", "description": "\r\n        \tThe 2S4 \"Tyulpan\" was developed as a fully-tracked, self-propelled heavy mortar platform. The 30-ton system was first witnessed by the West in 1975 which gave birth to the NATO designation of \"M1975\" (not to be confused with the 2S7 \"Pion\", also given the NATO designation of M1975). It still maintains an active presence in the Russian Army inventory and has seen noted combat actions in Afghanistan (1979-1989) and Chechnya (1999-2009). The Soviet designation was consistent with the accepted practice of an alpha-numeric system (\"2S4\") and the association to a flower (\"Tyulpan\").\n\r\nThe Red Army witnessed the value of large-caliber mortar systems first-hand in World War 2. The Soviets therefore fielded a large collection of field mortars ranging from infantry level types to massive 240mm caliber monsters in their fight against the Germans. By the end of the war, the large-caliber mortar had managed a permanent foothold in the Red Army inventory and little was to change with the upcoming Cold War against the West. Development of a self-propelled and modern mortar carrier began in 1960.\n\r\nOverall, the 2S4 is a rather utilitarian weapon system consistent with Soviet armor doctrine - \"quick production and a big gun\". The vehicle is assigned an operating crew of up to nine personnel making up both vehicle and mortar gunnery elements. The vehicle portion of the 2S4 is nothing more than a modified chassis of the GMZ-class minelayer complete with a torsion bar suspension system for adequate off road travel capabilities in keeping up with the main armored force. The hull contains the engine, transmission and driver position with the driver is seated front left. Power is supplied by a single V-59 series diesel engine developing 520 horsepower output. As a tracked vehicle, the 2S4 makes use of six double-tired road wheels to a track side along with a drive sprocket at the front of the hull and a track idler at the rear. There are four track return rollers present with no side armor skirts being used to protect these vulnerable areas. The hull superstructure is multi-faceted and rather low-set against the lower hull portion of the vehicle. The crew is relatively protected (20mm thick armor) but the 2S4 is not intended for direct combat against seen foes. It instead makes use of ranged fire support for the benefit of other allied ground components in action. The mortar portion of the vehicle consists of a massive 240mm M240 series heavy field mortar made up of a launch tube and baseplate. The mortar is externally attached to the rear portion of the hull and lowered into position to be set along the ground at the vehicle rear, made ready to fire by the associated gunnery crew. Mortar projectiles are loaded via the breech as opposed to the muzzle as in infantry-level mortars. Up to 40 x 240mm projectiles were afforded the crew. There is a cupola aft of the driver's position along he hull roof that houses an access hatch and gun mount to which a 7.62mm PKT series machine gun can be affixed for anti-infantry defense.\r\n\t\t", "vehicle_name": "2S4 / SM-240 Tyulpan (M1975)", "vehicle_type": "Self-Propelled Mortar"}, {"id": "fe08bfe8-d6fd-46b5-ae86-31b97a121c96", "year_model": "1978", "description": "\r\n        \tThe 2S9 \"Nona\" (\"Newest Ordnance Ground Artillery\") was introduced with Soviet Army forces in 1981 as a self-propelled, tracked, light armored artillery mortar vehicle. Design work began in the mid-to-late 1970s and resulted in the requisite trials period and subsequent serial production spanning from 1979 to 1989. The vehicle maintains an active status in the modern Russian Army and has found homes in the inventories of several global armies worldwide. Production has reached at least 1,000 units.\n\r\nAt the heart of the 2S9 is its 120mm 2A60 heavy field mortar which is fitted to a powered, traversing turret set atop the hull of the BTR-D. The BTR-D was introduced in 1974 as a lightweight airborne multirole tracked platform. With its compact dimensions and light-class weight, the vehicle proved an air-transportable system and could serve typically lightly-armed units behind enemy lines. The 2S9 is a 9.6-ton vehicle powered y a 5D20 series, V8, water-cooled, diesel-fueled engine of 240 horsepower mounted in the rear. Road speeds reach 37 miles per hour with an operational range out to 310 miles. Cross-country travel is aided by the torsion bar suspension system. Armor protection for the crew of four is up to 15mm at its thickest. Some 40 to 60 120mm mortar rounds are carried for the primary weapon while local defense is through a 7.62mm coaxial machine gun. Six smoke grenade dischargers allow for self-screening actions.\n\r\nLike other Soviet-era vehicles of this class, the hull is fully amphibious and propelled through use of twin waterjets located at the lower rear of the hull. This continues the long-accepted Soviet doctrine of assault through all possible avenues in regards to armored warfare. Amphibious qualities are not always part of the makeup of Western armored vehicles.\n\r\nAs a mortar-carrying weapon, the 2S9 has the ability to engage target areas through indirect fire, lobbing its explosive shells over enemy defenses. The turret has its own elevation span which enables various angles of fire to be reached while the crew operates in a protected environment - albeit slightly cramped. Dimensions of the vehicle include a running length of 6 meters with a width of 2.6 meters and a height of 2.3 meters. It sports a low profile which, coupled to its inherently compact size, makes for a harder target to effectively engage at range along the horizon. Various mortar shell types also broaden the tactical reach of the vehicle in action beyond the standard HE (High-Explosive) types - smoke and illumination shells are noted.\n\r\nOperators of the 2S9 went beyond the old Soviet guard. This has included Afghanistan, Azerbaijan, Belarus, Kazakhstan, Turkmenistan, Ukraine, Uzbekistan, and Venezuela. Russia maintains a fleet of about 275 vehicles including those based on the BTR-80 Armored Personnel Carrier (APC) as the \"Nona-SVK\".\n\r\nA towed version of the 120mm gun system is recognized as the \"Nona-K\".\r\n\t\t", "vehicle_name": "2S5 Giatsint-S (Hyacinth) (M1981)", "vehicle_type": "Self-Propelled Artillery (SPA)"}, {"id": "3bd87bd1-3be1-4d29-bb6a-f338d12cd774", "year_model": "1976", "description": "\r\n        \tSoviet armored doctrine was wholly rewritten during World War 2 (1939-1945) following the German invasion of the Soviet Union through \"Operation Barbarossa\". A large focus was eventually placed upon mobile artillery support that involved rocket fire (\"Katyusha\" systems) with towed artillery elements and, beyond that, Self-Propelled Gun (SPG) units. This wartime experience considerably influenced designs that would appear after the war which saw \"big-gunned\" vehicles become the norm in supporting major offensives. The 2S7 \"Pion\" (Peony\") was taken into inventory in 1976 and its design was centered around a massive 203mm gun barrel which sat atop a tracked chassis. Despite its Cold War roots, this effective fire support vehicle remains in service to this day (2015).\n\r\nWhen recognized by the West, NATO assigned the designation of \"M1975\" (\"Model 1975\") to the 2S7. It carried the official Soviet Army designation of \"SO-203\" as well. When adopted by the service, the 2S7 became the largest Self-Propelled Artillery (SPA) vehicle in service anywhere in the world.\n\r\nWith the arrival of the T-80 Main Battle Tank (MBT), the Soviet Army had an all-modern track-and-wheel chassis from which to spawn a line of associated vehicles from. The 2S7 was developed to support offensive actions involving tanks as well as infantry and other mobile assets for frontline service involving indirect fire. The 2S7 became a 46.5-ton vehicle mating the 203mm 2A44 series howitzer atop the T-80 tank chassis which utilized a V-46-I V-12 turbocharged diesel-fueled engine of 840 horsepower and was fitted at the middle of the hull. The vehicle component retained its torsion bar suspension system for off-road travel and could reach speeds of 31 miles per hour with an operational road range out to 400 miles. Overall length was 10.5 meters with a width of 3.38 meters and a height of 3 meters. Armor protection was for only the crew held in the hull (in a forward-mounted cab sporting roof hatches) and measured 10mm in maximum thickness.\n\r\nThe standard operating crew numbered fourteen (seven were carried on the primary vehicle with the remainder brought along in an assist vehicle) though only the driving and command positions located at the front cabin were wholly protected. This meant that the gunnery grew was completely exposed at the rear-top of the hull and also at the mercy of the elements and nuclear/biological/chemical warfare.\r\n\t\t", "vehicle_name": "2S7 Pion / Malka (M1975)", "vehicle_type": "203mm Tracked Self-Propelled Howitzer (SPH)"}, {"id": "33973b89-4cc2-412f-a098-779aef9683bd", "year_model": "1981", "description": "\r\n        \tThe 2S9 \"Nona\" (\"Newest Ordnance Ground Artillery\") was introduced with Soviet Army forces in 1981 as a self-propelled, tracked, light armored artillery mortar vehicle. Design work began in the mid-to-late 1970s and resulted in the requisite trials period and subsequent serial production spanning from 1979 to 1989. The vehicle maintains an active status in the modern Russian Army and has found homes in the inventories of several global armies worldwide. Production has reached at least 1,000 units.\n\r\nAt the heart of the 2S9 is its 120mm 2A60 heavy field mortar which is fitted to a powered, traversing turret set atop the hull of the BTR-D. The BTR-D was introduced in 1974 as a lightweight airborne multirole tracked platform. With its compact dimensions and light-class weight, the vehicle proved an air-transportable system and could serve typically lightly-armed units behind enemy lines. The 2S9 is a 9.6-ton vehicle powered y a 5D20 series, V8, water-cooled, diesel-fueled engine of 240 horsepower mounted in the rear. Road speeds reach 37 miles per hour with an operational range out to 310 miles. Cross-country travel is aided by the torsion bar suspension system. Armor protection for the crew of four is up to 15mm at its thickest. Some 40 to 60 120mm mortar rounds are carried for the primary weapon while local defense is through a 7.62mm coaxial machine gun. Six smoke grenade dischargers allow for self-screening actions.\n\r\nLike other Soviet-era vehicles of this class, the hull is fully amphibious and propelled through use of twin waterjets located at the lower rear of the hull. This continues the long-accepted Soviet doctrine of assault through all possible avenues in regards to armored warfare. Amphibious qualities are not always part of the makeup of Western armored vehicles.\n\r\nAs a mortar-carrying weapon, the 2S9 has the ability to engage target areas through indirect fire, lobbing its explosive shells over enemy defenses. The turret has its own elevation span which enables various angles of fire to be reached while the crew operates in a protected environment - albeit slightly cramped. Dimensions of the vehicle include a running length of 6 meters with a width of 2.6 meters and a height of 2.3 meters. It sports a low profile which, coupled to its inherently compact size, makes for a harder target to effectively engage at range along the horizon. Various mortar shell types also broaden the tactical reach of the vehicle in action beyond the standard HE (High-Explosive) types - smoke and illumination shells are noted.\n\r\nOperators of the 2S9 went beyond the old Soviet guard. This has included Afghanistan, Azerbaijan, Belarus, Kazakhstan, Turkmenistan, Ukraine, Uzbekistan, and Venezuela. Russia maintains a fleet of about 275 vehicles including those based on the BTR-80 Armored Personnel Carrier (APC) as the \"Nona-SVK\".\n\r\nA towed version of the 120mm gun system is recognized as the \"Nona-K\".\r\n\t\t", "vehicle_name": "2S9 Nona", "vehicle_type": "Self-Propelled Artillery (SPA)"}, {"id": "40ee425a-75a6-455b-b7de-71a19750d930", "year_model": "2011", "description": "\r\n        \tSince the dark days of World War 2, the Russian (then Soviet) Army has placed a premium on wheeled Multiple Launch Rocket Systems (MLRSs). The trend continues today with the 9A52-4 \"Tornado\" 8x8 wheeled rocket projector which was adopted in 2011 as an upgrade replacement for the aged BM-21, BM-27  and BM-30 MLRS lines. The vehicle is manufactured by the Motovilikha Plant of Perm, Russia and some 36 have been procured heading into 2014. It is expected that the new design will outright replace all comparable models within the next decade.\n\r\nThe Tornado is a complete mobile weapons platform consisting of a fully-suspended, heavy-duty mover vehicle (with integrated crew cabin) and a rear-mounted rocket launcher system. The vehicle portion itself is the KamAZ-63501 truck designed specifically for heavy-duty military service while being powered by a single JamAZ-740.50.360 diesel-fueled engine of 360 horsepower output. The 8x8 wheeled nature of the chassis allows the vehicle to traverse cross country when necessary as well as reach its maximum speed of 90 kilometers per hour on paved roads. Operational range of the vehicle is 1,000 kilometers. A typical operating crew is just two personnel (including a driver) thanks to heavy use of automation in the firing sequence. The overall vehicle weight is in the range of 24.5 tons and, dimensionally, features a length of 11.2 meters with a width of 2.5 meters and a height of 3.15 meters.\r\n\t\t", "vehicle_name": "9A52-4 Tornado", "vehicle_type": "Wheeled Multiple Launch Rocket System (MLRS)"}, {"id": "f5aca3bb-db82-4c20-b52d-2e3ebab880db", "year_model": "1965", "description": "\r\n        \tAt a time when tensions between East and West ran extremely high during the Cold War period (1947-1991) and another major war in Europe seemed all but inevitable, the Soviet Union invested heavily in frontline rocket-projecting weapons to stave off an attack. One such development of the period became the 8x8 wheeled 9K52 \"Luna-M\" battalion-level mobile battlefield rocket launcher carrying a single large rocket over the modified chassis of a ZiL-135LM military truck. The rocket was capable of unleashing conventional, chemical, and nuclear payloads at range, reaching speeds of Mach 3 in flight, and could \"touch\" targets as far out as 40 miles. The vehicle was initially developed (under the designation of \"3R-11\" and \"9R11\") as a nuclear-capable solution to deter any advanced from the West, mainly in and around East Germany, but were later converted to a conventionally-minded variant to better serve a Soviet frontline assault.\n\r\nThe vehicle was known to NATO as \"Frog-7\" and remains in limited use worldwide. In practice, it proved inaccurate, sensitive to weather/environment, and required a resupply vehicle on hand to replenish the single-shot rocket component. As such, it was eventually succeeded in the Soviet inventory by the more effective OTR-21 \"Tochka\" (NATO: SS-21 \"Scarab\") of 1976 detailed elsewhere on this site.\n\r\nFirst-use of this battlefield system was by Syria in 1973 during the Yom Kipper War against Israel. They remained in inventory long enough to be used in today's long-running civil war by Syria.\n\r\nMajor rocket variants of the line included the nuclear-minded 9M21B, the conventional 9M21F (High-Explosive, FRAGmentation - HE-FRAG), and the chemical-capable 9M21Kh. The 9M21E offered cluster munition capability and the Laith-90 was the version used by Iraq in its wars against neighboring Iran and, later, the West. The PV-65 designation covered training systems.\n\r\nThe 9K52 series had a prolific reach for its time, utilized in conflicts ranging from the Soviet-Afghan War (1979-1989) and Iran-Iraq War (1980-1988) to the Syrian Civil War (2011-Present) and the Yemeni Civil War (2014-Present). Its reach was such that it is still found on some battlefields today.\n\r\nActive operators include former Soviet/Russian allied players such as Algeria, Bosnia and Herzegovina, Belarus, Cuba, Egypt, Libya, North Korea, and Ukraine. Former operators of note include Czechoslovakia, East Germany, Iraq, Kuwait, Poland, and Romania.\r\n\t\t", "vehicle_name": "9K52 Luna-M (Frog-7)", "vehicle_type": "8x8 Mobile Battlefield Rocket Launcher"}, {"id": "a3cb3c97-5f48-4b3e-91bc-8ef5f8b16db5", "year_model": "2022", "description": "\r\n        \tThe Marker is an Unmanned Ground Vehicle (UGV) designed, developed, and manufactured by Russian industry. Development was headed by Android Technologies along with Advanced Research Foundation of Russia. The system is capable of remote autonomous operation and the test phase involved a pair of prototypes fielded in July of 2019. In December of that year, a modified form with lower glacis plate was showcased with a quadcopter over its rear section.\n\r\nThe vehicle's design is consistent with that of a tank as the primary version of the Marker makes use of a track-and-wheel arrangement driven by its engine (another form has a conventional all-wheeled arrangement). There are five roadwheels to a hull side, collectively providing the machine with enhanced travel when going cross-country or across uneven terrain. Over the center of the hull is a 360-degree traversing turret mounting optics, sensors, and weaponry. A machine gun is fitted to an attachment along the left side while a quadruple missile launcher component is seated along the right. Additional optics are set about the hull for situational awareness. Headlamps are embedded in the forward corners of the bow. Over the rear of the hull resides a staging area for cargo and compact Unmanned Air Systems (UASs) launching - giving an additional tactical edge to the machine.\n\r\nSensor fits include day-night optics, thermal imaging, laser-range-finding, and laser warning receiver. \n\r\nAt present, the Marker is said to be deploying to the Donbas region of Ukraine in the ongoing war following the Russian invasion of the country in February 2022.\r\n\t\t", "vehicle_name": "AT/ARF Marker", "vehicle_type": "Unmanned Ground Vehicle (UGV)"}, {"id": "4335e33e-a6b6-47d0-97f1-1ea67b102cda", "year_model": "1964", "description": "\r\n        \tIt is standard practice for a proven tank design to make up a larger family of vehicles by way of proven running gear and operational experience. This helped to produce the TOS-1 (also \"TOC-1\") where the popular T-72 Main Battle Tank (MBT) chassis has formed the basis of a Multiple Launch Rocket System (MLRS). MLRSs are used as indirect fire weapons over range, often times attached to artillery regiments for massed firepower. Battlefield rockets have provided a tactical and psychological effect on enemy forces for generations and continues to do so today. Many modern armies stock special vehicles like MLRSs as a result.\n\r\nOmsk Transmash Design Bureau of the former Soviet Union headed design work on the vehicle in 1988. Obvious modifications to the existing T-72A model MBT included removal of its entire turret assembly, this structure accordingly replaced by a large and rectangular multi-shot rocket pack seated atop a traversing mount. The vehicle retained the original tank's crew of three and weighed 100,000 lb. Dimensions included a running length of 9.5 meters with a width of 3.6 meters and height of 2.22 meters. Power was through a standard V-84 diesel-fueled engine developing 840 horsepower. Performance specifications included a road speed of 37 miles per hour with an operational range out to 340 miles.\n\r\nThe multi-shot launcher pod was originally given 30 launch tubes in the TOS-1M variant. This was later reduced to 24 in the TOS-1A upgrade with sported a 3 x 8 tube arrangement. The rockets were of 220mm caliber and could carry variable warhead types to engage fortifications, light armored vehicles, and troops out in the open. The vehicle has been resupplied through a pair of accompanying TZM-T (KrAZ-255B) trucks which are modified especially for the rocket resupply role.\n\r\nPilot vehicles were evaluated operationally from 1988 into 1989 during the latter stages of the Soviet-Afghan War (1979-1989) and found to be useful short-to-medium range assault weapons. Their development was kept rather \"close to the vest\" for it was not until 1999 that the vehicle was actually showcased to the public and seen in military parades since. Production had been from 1988 onwards and appears to continue today (2015).\n\r\nThe TOS-1 has managed to survive the post-Soviet defense budget crunch and is in operational service with the modern Russian Army which has allowed it to see additional combat actions as was the case during the Battle of Grozny (1999-2000) against Chechnya forces. A few foreign operators also exist, these being former Soviet satellite countries and Cold War-era customers - Azerbaijan, Iraq, and Kazakhstan - though none have operate the TOS-1 family in the numbers that the Russians field.\n\r\nDuring 2001, the Russian Army adopted a modernized and improved version of the original TOS-1M as the aforementioned TOS-1A. Changes to the base design included a reduction in the number of launch tubes used, installation of a new ballistics computer, and increased engagement ranges out to 3.7 miles. \n\r\nIraqi TOS-1 vehicles were used as recently as 2014 where their firepower was brought to bear on elements of ISIS during the assault on Jurf Al Sakhar in October. These were upgraded TOS-1A systems.\r\n\t\t", "vehicle_name": "BM-21 (Grad)", "vehicle_type": "Multiple Launch Rocket System (MLRS)"}, {"id": "62213961-9981-42bd-8543-4f203cd07ac6", "year_model": "1975", "description": "\r\n        \tThe BM-27 / 9P140 \"Uragan\" (\"Hurricane\") is a large, multi-wheeled self-propelled rocket launcher design consisting of an enclosed crew cab, launcher installation and eight-wheeled heavy duty chassis. The Soviet Union relied heavily on the inherent firepower of \"rocket projectors\" throughout World War 2 (through their heavy use of \"Katyusha\" systems) in staving off defeat at the hands of Hitler's Germany and inevitably carried this tactical doctrine into the Cold War years against the West. Rocket projectors held the uncanny ability to provide area suppression while delivering powerful psychological effects on enemy troops unlucky enough to be found within its \"reach\". Such rocket systems could saturate a target area ahead of the main advancing force made up of combat tanks, armored vehicles and infantry elements.\n\r\nDeveloped in the 1970s, the BM-27 was formally inducted into Red Army service in the latter portion of the decade. The large 8x8 wheeled vehicle mounted no fewer than 16 x 220mm rockets which it could launch at targets some 22 miles away. The chassis was nothing more than a modified development of the ZiL-135 series 8x8 wheeled truck and completed with an armored cab for the crew. The massive vehicle was powered by a pair of gasoline-fueled engines installed in a side-by-side arrangement. Each wheel, therefore, drove the wheels along its respective side of the chassis allowing for full 8x8 support. The wheels were arranged in a rather unique way with the front and rear axles set well apart from the inner second and third axles. Consequently, only the front and rear axles became steerable in the design. The BM-27 system maintained an operation road range of up to 311 miles, less so when traversing over uneven terrain over long distances. Despite its Cold War origins, the BM-27 is still in use today.\r\n\t\t", "vehicle_name": "BM-27 (Uragan ) / 9P140", "vehicle_type": "Self-Propelled Multiple Rocket Launcher"}, {"id": "04f915ef-0517-4a6d-8a53-f8a54529a559", "year_model": "1989", "description": "\r\n        \tLong relying on large collections of Multiple Launch Rocket Systems (MLRSs) as cheap, effective fire support weapons, the Soviet Army adopted the BM-30 \"Smerch\" (\"Whirlwind\") series in 1989 for its long-range, battlefield rocket projection needs. The type was formed from the chassis of the MAZ-543M (or MAZ-79111) series of 8x8 wheeled heavy military trucks and included a forward-set crew compartment (front-left) and a rear-mounted, trainable launcher unit containing twelve 300mm launch tubes. Able to fire rockets containing a variety of warheads (including chemical types), the Smerch saw widespread adoption with Soviet-supported and aligned nations and states from Armenia to Venezuela. Even after the dissolution of the Soviet Empire, the vehicles were passed on to successor states while local models has been maintained by the new Russian Army. While its footprint today remains evermore limited compared to its peak worldwide usage period, the vehicle still holds much battlefield value to its operators.\n\r\nRussia manages a current (2015) stock of over 100 systems though the series has since been superseded on paper by the adoption of the more modern 9A52-4 \"Tornado\" line (detailed elsewhere on this site).\n\r\nThe Smerch series is a whole weapon system containing several key critical components for effective functioning. BM 9A52-2 is the 8-wheeled launch vehicle making up the heart of the system. It is a unit weighing nearly 44 tons (long) and features  a length of 12 meters with a width of 3 meters and a height of 3 meters. It is powered by a single V-12 D12A-525A series diesel-fueled engine developing 525 horsepower located at the vehicle's front-right side. The hull is suspended across all eight vehicles allowing a cross-country capability. Road speeds reach 37 miles per hour with operational ranges out to 530 miles.\n\r\nThe launcher component of the launch vehicle sits over the rear section of the truck and features traverse and elevation controlling which means the vehicle can be parked facing any direction. The launch tubes are arranged in three groups of four tubes each with two groups set across from one another in a 2x2 arrangement. The remaining tubes are arranged in a single row across the top of the other eight - this helps to clear the lift controls and support structure found at the base of the launcher pack. Prior to firing, the vehicle must come to a complete stop and have its recoil legs lowered. The operating cabin for the launcher is featured aft of the driver's compartment and over/between the first and second axles. The Smerch can be made ready-to-fire in three minutes and displace (move to another location) in a little as two. Its twelve rocket payload can clear the launcher unit in 38 seconds while reloading takes approximately 20 minutes.\n\r\nThe TZM 9T234-2 serves as the reload vehicle / ammunition carrier and carries with it twelve 300mm rockets. 1K123 \"Vivary\" designates the accompanying Command Post (CP) component and the PM-2-70 MTO-V serves as the system's direct maintenance / support vehicle. 9A52 formally designates the BM-30 series and now includes the 9A52-4, a lighter-weight model featured on a KamAZ-6350 series truck with variable launcher packs supported (as such it is made more modular). 9A52-2T designates the export Smerch featuring a Tatra T816 series truck chassis.\n\r\nOver the life of the BM-30's operational service, several rocket projectiles were developed beyond the standard 9M528 High-Explosive, Fragmentation (HI-FRAG) variant. This has come to include cluster-based munition/mine dispensers (anti-personnel, anti-tank types), HEAT (High-Explosive, Anti-Tank) rockets, and thermobaric (high temperature fuel-air bomb) rockets.\n\r\nDespite its Cold War origins, the Smerch series was not used in combat until the 2014 during the Syrian Civil War by government forces against rebel groups. That same year, it was featured by Ukrainian government forces in their offensives against Russian-backed rebels in the Ukrainian east. While an unknown number of Syrian Army BM-30s remain in service, the Ukrainian Army was known to possess some near-100 systems at one point. Pakistan locally produces the BM-30 as the A-100E through its Supako Factory of Karachi. Some 36 vehicles have since entered service with the Pakistani Army. Neighboring India is another operator with 42 9A52-2T models in service.\r\n\t\t", "vehicle_name": "BM-30 (Smerch) / 9A52-2", "vehicle_type": "8x8 Wheeled Multiple Launch Rocket System (MLRS)"}, {"id": "d9fec799-7c77-44d4-b97a-47ebb8c0c480", "year_model": "1966", "description": "\r\n        \tThe Soviet military was first major military power to widely adopt the concept of an \"armored fighting infantry carrier\" through their revolutionary BMP-1 series of 1967. The type incorporated a conventional track-and-wheel design with low-profile hull and turret fitting substantial armament designed to transport combat-ready infantry in relative (armored) safety while being able to bring its own anti-infantry/tank-killing firepower to bear. The vehicle was fast enough to compete with the main mechanized force as it advanced deeper into enemy-held territory and its amphibious capabilities allowed it to traverse off-road, poorly defended areas with due diligence, thusly overwhelming even a prepared enemy such as those expected to be encountered during the Cold War across the European battlescape. \n\r\nThe BMP-1 was primarily developed to replace the limited BTR-50 series vehicles (in particular the BTR-50P model) to which the much improved 8x8 wheeled BTR-60 Armored Personnel Carrier (APC) was also developed in conjunction and produced on an equally large scale alongside the more technologically-laden BMP-1 family. Both vehicles went on to see considerable usage overseas and across countless conflicts dotting the Cold War decades. Despite having entered Soviet Army service in 1966, the BMP-1 was first identified by the West in November of 1967 and is now generally recognized as the first \"true\" Infantry Fighting Vehicle (IFV), classified as such due to its ability to transport troops, disembarking them and then being able to operate as a stand-alone armored fighting vehicle (AFV). Thusly the BMP-1 was something of a revolutionary hybrid design incorporating the best assets of a light-class tank with the benefits of an armored personnel carrier - essentially creating a new sub-class of armored vehicle. Contemporary Western counterparts have since gone on to include the American Bradley, British Warrior and German Marder.\n\r\nThe BMP-1 designation is born of the words \"Boyevaya Mashina Pekhoty 1\" which translates to \"Infantry Fighting Vehicle 1\". Due to the limited nature of intelligence fielded by the West during the Cold War, the BMP-1 was initially recognized as the \"M1967\"before evolving into the \"BMP-1\" designation.\n\r\nDesign work on the BMP-1 series began in 1959-1960 through competition involving various concerns. The resulting winner became the \"Obyekt 764\" prototype which seemingly incorporated all of the design features sought by the Soviet Army (firepower, performance and protection). The first pilot vehicle was completed in 1964 and testing of more evolved models occurred into 1965 before the type was adopted in 1966 after having passed the requisite state trials.\n\r\nThe BMP-1 proved a departure from previous armored infantry carriers in that most early versions of such vehicle featured an open-air passenger cabin which exposed its infantry to all manner of battlefield dangers and environmental effects and hazards (namely the threat of nuclear war realistically persistent throughout the 1950s). The Soviet design incorporated a low-profile hull with extremely sloped glacis plate and basic operating crew of three (driver, gunner and commander). The engine was fitted to a front-right compartment to open the rear of the design for the passenger compartment and entry/exit through the unobstructed rear. The turret was set at center with unfettered views around the hull. The rear of the hull serviced eight infantry seated across two benches (four infantry per bench) facing outwards (fuel was stored between the two seat rows). The hull sides were given protected firing ports (four to a side) which allowed passengers the ability to help defend the vehicle through small arms fire from their own personal weapons (periscopes allowed for direct aiming though the ports themselves were not stabilized). Entry/access for the troops was through a pair of outward-opening hinged doors found at the rear face of the hull, each also sporting their own firing ports and aiming periscopes. The driver sat at the front-left in the hull with a personal hatch over his position and vision blocks for when the vehicle was \"buttoned down\". The turret maintained a hatch for the gunner while the commander resided in a special position just aft of the driver in the hull. As designed, and in keeping with common Soviet armored doctrine of the time, the BMP-1 was fully-amphibious and able to traverse open bodies of water with relative ease while being propelled about by the motion of its own tracks. Preparation consisted of raising a front-mounted trim vane and bilge pumps were turned on prior to any deep water entry. Water speeds totaled just 4.3 mph.\r\n\t\t", "vehicle_name": "BMP-1 (Boyevaya Mashina Pekhoty)", "vehicle_type": "Infantry Fighting Vehicle (IFV) / Light Tank"}, {"id": "eb578290-c76b-4baf-bd77-2af49595bcfb", "year_model": "1982", "description": "\r\n        \tThe Soviet Union introduced the concept of the Infantry Fighting Vehicle (IFV) with the adoption of its BMP-1 in 1966. The type immediately proved revolutionary and was exported to over 40 Soviet-allied nations and states while, with the fall of the Soviet Union in 1991, absorbed by various emerging home nations where collections resided. The type's reach proved so popular that thousands were produced with many still in active circulation today (2013). However, the design showcased several key tactical limitations, particularly during the Arab-Israeli wars and the Soviet-Afghanistan War that an improved type was ordered. This eventually became the \"BMP-2\" family of tracked armored vehicles.\n\r\nThe \"BMP\" name is derived from the Russian \"Boyevaya Mashina Pekhoty\" which, when translated, becomes \"Infantry Combat Vehicle\".\n\r\nThe IFV concept emerged with the Soviet plan to introduce a vehicle that offered performance suitable for fast-moving mechanized forces, protection and troop-carrying capabilities of an Armored Personnel Carrier (APC) with the firepower of a light tank. This endeavor inevitably produced the BMP-1.\n\r\nWhile successful at its core, the BMP-1 offered some notable inherent limitations on the ever-evolving battlefield. It was, for all intents and purposes, designed for fighting across the European battlescape. First combat actions were in Arab hands against Israeli forces during the 1973 Yom Kippur War and results were not promising when many fell to large-caliber machine gun fire and small caliber artillery systems. When pressed into service across the dry, hot and rugged terrain of Afghanistan against non-conventional forces wielding RPGs (Rocket Propelled Grenades), the design proved vulnerable in several key areas. \n\r\nThe base armament of 73mm cannon with onboard support for a 1st Generation anti-tank missile was surpassed by counters emerging in the West. The 73mm cannon itself proved particularly inaccurate at the required engagement ranges. The AT-3 \"Sagger\", designed as a wire-guided anti-tank missile, required the operator to be exposed out of the turret roof when guiding the missile to its target. Other limitations including the internal arrangement which sat the commander directly behind the driver in the hull. Not only did this limit his tactical vantage point of the situation ahead, a single direct hit from an enemy projectile could kill both crew - rendering the vehicle a complete loss. The internal passenger seating arrangement was also of note as the twin back-to-back benches were set about the fuel stores fitted in-between, this proving an obvious hazard to passengers and crew alike. Similarly, the ammunition stowed about the hull was exposed and could explode if taken a direct hit.\n\r\nWhile a modernization program produced the improved BMP-1P, the endeavor was an interim design pending the arrival of a new type. This begat work on such a product in 1972, a direct successor as the aptly-designated \"BMP-2\". \n\r\nThe new BMP-2 held a form and function that remained largely faithful to the original save for a few key qualities which instantly set it apart for the better. The hull was shortened and widened for a new internal arrangement and minimized side profile along the horizon. The driver remained at the front-left of the hull with the powerpack to his immediate right. The commander, however, was moved from his hull placement to the new two-man turret, joining the gunner. This arrangement now provided a better communications arrangement between gunner and commander. The passenger cabin was reworked and reduced to include space for only six infantry (down from the original's eight seating) while the twin doors (opening outward) at the rear hull face allowed for infantry entry/exit as normal. An additional infantryman was stationed behind the driver in the commander's old position. Passengers, once again, sat across two benches fitted back to back with access to firing ports that contained periscopes for aiming. Four firing ports were allotted to the left hull side with three along the right which allowed passengers to defend the vehicle with personal weapons as necessary. Night vision equipment remained standard for all three crew positions and NBC (Nuclear, Biological, Chemical) protection was required on the nuclear-driven Cold War battlefield. The BMP-2 retained the former's all-amphibious approach though improved such qualities through a sharper prow at front and lengthened deflector at rear with propulsion based on the motion of the moving tracks so no dedicated waterjet was required. However, prior to water entry, the vehicle required the crew to erect a trim vane and turn on bilge pumps as in the BMP-1. Unlike early production BMP-1 vehicles, which relied on an internal exhaust-based smoke generation system, the BMP-2 was fielded complete with 6 x electrically-operated smoke grenade dischargers (three per turret front side) while retaining the engine-based system as well. Armor protection was 33mm at the thickest, mostly along the critical frontal facings though the armor protection scheme as a whole was reportedly improved based on actions in the Middle East and Afghanistan.\r\n\t\t", "vehicle_name": "BMP-2 (Boyevaya Mashina Pekhoty)", "vehicle_type": "Infantry Fighting Vehicle (IFV)"}, {"id": "7bfffd10-0e10-45b3-8415-d44a81e88d13", "year_model": "1987", "description": "\r\n        \tThe Soviet military was first major military power to widely adopt the concept of an \"armored fighting infantry carrier\" through their revolutionary BMP-1 series of 1967. The type incorporated a conventional track-and-wheel design with low-profile hull and turret fitting substantial armament designed to transport combat-ready infantry in relative (armored) safety while being able to bring its own anti-infantry/tank-killing firepower to bear. The vehicle was fast enough to compete with the main mechanized force as it advanced deeper into enemy-held territory and its amphibious capabilities allowed it to traverse off-road, poorly defended areas with due diligence, thusly overwhelming even a prepared enemy such as those expected to be encountered during the Cold War across the European battlescape. \n\r\nThe BMP-1 was primarily developed to replace the limited BTR-50 series vehicles (in particular the BTR-50P model) to which the much improved 8x8 wheeled BTR-60 Armored Personnel Carrier (APC) was also developed in conjunction and produced on an equally large scale alongside the more technologically-laden BMP-1 family. Both vehicles went on to see considerable usage overseas and across countless conflicts dotting the Cold War decades. Despite having entered Soviet Army service in 1966, the BMP-1 was first identified by the West in November of 1967 and is now generally recognized as the first \"true\" Infantry Fighting Vehicle (IFV), classified as such due to its ability to transport troops, disembarking them and then being able to operate as a stand-alone armored fighting vehicle (AFV). Thusly the BMP-1 was something of a revolutionary hybrid design incorporating the best assets of a light-class tank with the benefits of an armored personnel carrier - essentially creating a new sub-class of armored vehicle. Contemporary Western counterparts have since gone on to include the American Bradley, British Warrior and German Marder.\n\r\nThe BMP-1 designation is born of the words \"Boyevaya Mashina Pekhoty 1\" which translates to \"Infantry Fighting Vehicle 1\". Due to the limited nature of intelligence fielded by the West during the Cold War, the BMP-1 was initially recognized as the \"M1967\"before evolving into the \"BMP-1\" designation.\n\r\nDesign work on the BMP-1 series began in 1959-1960 through competition involving various concerns. The resulting winner became the \"Obyekt 764\" prototype which seemingly incorporated all of the design features sought by the Soviet Army (firepower, performance and protection). The first pilot vehicle was completed in 1964 and testing of more evolved models occurred into 1965 before the type was adopted in 1966 after having passed the requisite state trials.\n\r\nThe BMP-1 proved a departure from previous armored infantry carriers in that most early versions of such vehicle featured an open-air passenger cabin which exposed its infantry to all manner of battlefield dangers and environmental effects and hazards (namely the threat of nuclear war realistically persistent throughout the 1950s). The Soviet design incorporated a low-profile hull with extremely sloped glacis plate and basic operating crew of three (driver, gunner and commander). The engine was fitted to a front-right compartment to open the rear of the design for the passenger compartment and entry/exit through the unobstructed rear. The turret was set at center with unfettered views around the hull. The rear of the hull serviced eight infantry seated across two benches (four infantry per bench) facing outwards (fuel was stored between the two seat rows). The hull sides were given protected firing ports (four to a side) which allowed passengers the ability to help defend the vehicle through small arms fire from their own personal weapons (periscopes allowed for direct aiming though the ports themselves were not stabilized). Entry/access for the troops was through a pair of outward-opening hinged doors found at the rear face of the hull, each also sporting their own firing ports and aiming periscopes. The driver sat at the front-left in the hull with a personal hatch over his position and vision blocks for when the vehicle was \"buttoned down\". The turret maintained a hatch for the gunner while the commander resided in a special position just aft of the driver in the hull. As designed, and in keeping with common Soviet armored doctrine of the time, the BMP-1 was fully-amphibious and able to traverse open bodies of water with relative ease while being propelled about by the motion of its own tracks. Preparation consisted of raising a front-mounted trim vane and bilge pumps were turned on prior to any deep water entry. Water speeds totaled just 4.3 mph.\r\n\t\t", "vehicle_name": "BMP-3 (Boyevaya Mashina Pekhoty)", "vehicle_type": "Infantry Fighting Vehicle (IFV) / Light Tank"}, {"id": "3bc35e92-c0e2-4bee-8cc4-0b95cfbd3739", "year_model": "2011", "description": "\r\n        \tRussian Army urban combat experience in the First and Second Chechen Wars resulted in a need for a new type of armored combat vehicle for the support role. The vehicle would be paired with Russian tanks and other frontline fighting vehicles and provide additional offensive capabilities in-the-field all the while retaining the protection and mobility of a tank and Infantry Fighting Vehicle (IFV). In 2011, the BMPT (recognized as the \"Terminator\") was revealed, the heavily armed and armored tracked system being based on the existing chassis of the classic Soviet-era T-72 Main Battle Tank (MBT). The vehicle is manufactured by Uralvagonzavod.\n\r\nThe BMPT is neither tank nor IFV as it lacks a heavy-caliber turreted main gun to serve as the former and does away with troop-ferrying facilities to serve as the latter. Instead it is a true support vehicle featuring a standard crew of five, weighing in at 53 tons (short), and showcasing a bevy of armament options suitable for engaging both heavy- and light-weight enemy vehicles at range as well as defending allied tanks against enemy infantry attacks. Primary armament are 2 x 30mm 2A42 series autocannons coupled with 4 x 130mm \"Ataka-T\" Anti-Tank Guided Missile (ATGM) launchers fitted to the turret - these provide considerable firepower against armored targets at range. Secondary armament comes in the form of 2 x 30mm AG-17D \"Plamya\" 30mm automatic grenade launchers for suppression of enemy infantry and the vehicle also carries 1 x 7.62mm PKTM for extremely local defense. Armor protection is a combination arrangement involving composite, steel, and reactive armor. Dimensions include an overall length of 23.6 feet, a width of 11 feet, and a height of 11.2 feet allowing the vehicle to be transported by railway, heavy duty truck, or certain transport aircraft.\n\r\nAs the vehicle utilizes the existing T-72 running gear, it has six double-tired roadwheels to a hull side with the drive sprocket found at rear and the track idler located at front. The upper track section is well protected through side skirt armor plates. Drive power is from a single Model V-92S2 diesel-fueled engine supplying 1,000 horsepower. Coupled with the torsion bar suspension, this provides the vehicle with a maximum road speed of 37 miles per hour and an operational road range out to 340 miles. Off-road travel is also possible though with reduced performance characteristics. Ground clearance is a useful sixteen inches.\n\r\nThe need for such a heavy-class vehicle originally arose through the Soviet commitment in the Soviet-Afghanistan War where BMP vehicles proved highly susceptible to close-range, guerilla-style ambush attacks. These vehicles also lacked the flexibility and versatility needed in combating a more fluid, though rather primitive, enemy force. Design work on a solution began in the 1980s and several prototype vehicles were reviewed. The need was further pressed home with combat experience in the First Chechen War where fighting in city streets proved the norm. Again, existing BMP type vehicles failed to provide the necessary engagement capabilities and crew protection being sought by commanders in-the-field.\n\r\nThis led to further work on additional prototypes which ultimately begat the Object 199 model. Unveiled in 2000, the vehicle entered serial production in 2002. Very well-armed and armored, the BMPT was, rather interestingly, passed on by the modern Russian Army - authorities citing the Cold War-era T-72 origins as the primary reason. Instead, the vehicle has found its first export operator in Kazakhstan with interest being generated by the governments of Algeria, Azerbaijan, and Peru. The Russian Army will instead move on securing a new generation of armored fighting vehicles most likely tied to the new T-99 \"Armata\" family line which includes the T-14 MBT and the T-15 IFV (both detailed elsewhere on this site).\n\r\nUralvagonzavod has offered a \"Terminator 2\" package to retrofit existing T-72 MBTs for the Heavy Armored Support Vehicle (HASV) role. Despite its Cold War roots, the T-72 maintains healthy active numbers with many operators across the globe - from Algeria and Angola to Vietnam and Yemen.\r\n\t\t", "vehicle_name": "BMPT (Terminator) (Object 199)", "vehicle_type": "Heavy Armored Support Vehicle (HASV)"}, {"id": "fe9e5ac6-7059-4b45-b3e3-cf9fd6e7fe5c", "year_model": "1966", "description": "\r\n        \tThe BRDM-2 primarily served as an armored scout car with the Soviet Army during the height of the Cold War. She was a direct replacement to the limited BRDM-1 scout car series and, like many of the Soviet Cold War offerings, the newer BRDM-2 proved a cheap yet still capable system, making it a popular export product the world over. Thousands of examples were ultimately produced and the type was fielded in anger throughout several of the key global conflicts between the years 1960 and 2000. While she still serves with many nations across the globe (mostly Soviet-allied customers), the BRDM-2 now remains a limited product all her own when set on the modern battlefield. Regardless, she has proven herself a combat-capable system and has enjoyed the successes of her rather simplistic yet utterly reliable design.\n\nThe PT-76 Light Tank\n\r\nIn 1949, designs were on the boards for a new amphibious light tank to be used in the reconnaissance role for the Soviet Army. This design evolved into the PT-76 which entered service in August of 1952. The PT-76 lent itself well to the blossoming mobile army doctrine of the Soviets and allowed for unprecedented access to both land and water at speed. What the new system would need now is a comparable reconnaissance vehicle that could keep up with the inherent mobility of the new light tank - something which the current Soviet inventory found elusive in the available offerings. As such, the BRDM-1 scout car was born.\n\nThe BRDM-1\n\r\nThe BRDM-1 (originally as the \"BRDM\" before there was a \"BRDM-2\") was an initial scout car design that first appeared in the Soviet Army inventory in 1957 (design beginning in 1954). Of note was her 4x4 off-road capability and her amphibious quality, the former aided by a pair of powered belly wheels and the latter coming in the form of a rear-mounted water jet for propulsion. The engine was mounted in the front hull with the crew compartment set to the middle-rear. The BRDM-1 led a healthy existence, seeing over 10,000 examples produced and delivered to a large portion of Soviet allied nations in varied battlefield forms - she was adapted to carry a range of anti-tank missiles as well, improving her tactical usefulness to an extent. However, the BRDM-1 design was inherently limited at its core. She maintained no trainable turreted armament system (the gunner need expose himself to enemy fire to operate the external machine gun) nor was her crew protected from the effects of a nuclear war - prevalent in the Cold War years. Additionally, she was not given night vision equipment, making her a liability in such an environment. To add insult to injury, the BRDM-1 also lacked any sort of specialized reconnaissance-minded vision equipment - considering her role as a reconnaissance scout car, this was a wholly major drawback.\n\nThe BRDM-2\n\r\nAs such, it wasn't long before the BRDM-2 series of scout cars was born to \"right the wrongs\" of the previous design. The BRDM-2 first appeared in 1962 (a design credited to V.K. Rubtsov) and came online as a direct replacement for the BRDM-1. The BRDM-2 brought along with it several key improvements that made for a better system - including revisions and improvements to the amphibious capabilities, on-road/off-road performance and armament. Additionally, the BRDM-2 was fitted with NBC (Nuclear, Biological, Chemical) protection as well as night vision equipment.  The engine was moved to the rear of the hull with the crew compartment positioned to the middle-front. A powered turret was added to hold the armament and the powered belly wheels were retained. Production was handled by the Molotov GAZ Plant in Gorkiy, Russia. In all, some 7,200 examples went on to see production (from 1962 to 1989) and, at her usage height, some 40 nations fielded the BRDM-2. She proved a regular at Soviet pride parades during the Cold War and was publicly seen for the first time to Western observers in 1966.\n\nBRDM-2 Walk-Around\n\r\nIt is easy to dismiss the BRDM-2 based on looks alone for she maintains a rather utilitarian appearance with little to recommend herself. However, she is a capable wheeled system that has seen use the world over. The design is characterized by her four large road wheels offering full 4x4 support, these set on leaf springs with hydraulic shock absorbers. The wheels are spaced well apart, particularly when viewed in the side profile. Wheel wells are high-arcing and promote flexibility in steering while collecting and deflecting the mud and dust of the terrain. The lower hull is slab-sided along the sides and rear panels but sloped upwards along the front. The lower front hull angles up to the nearly-flat glacis plate. The glacis plate contours into the hull superstructure and allows a forward panel for vision ports afforded to the front-seated personnel. The sides of the superstructure are angled inwards towards the top. The design is capped by a rounded, low-profile, flat-topped, fully-enclosed turret structure that itself maintains relatively unfettered 360-degree rotation (these is only a communications antenna to the forward right-hand side of the design, near the commander's hatch). Headlamps are held at the forward extreme corners of the upper hull glacis plate and partially protected by armored rails. The driver makes use of external mirrors to view his immediate and distant surroundings. The forward armor vision panels can be raised and lowered at operator discretion. When raised, the glass-covered vision port (bulletproof) allows for improved forward visibility. Vision blocks for the crew are set at the upper access hatches as well as the sides of the hull superstructure while the commander and driver also have use of periscopes when the vehicle is fully \"buttoned down\". The engine is fitted to the rear of the hull unlike the BRDM-1. There is an integrated winch system built into the front hull of the BRDM-2 design as well as a central tire pressure system. The tire pressure system allows the driver to adapt one or all of his road wheels \"on-the-fly\" to the terrain ahead.\r\n\t\t", "vehicle_name": "BRDM-2", "vehicle_type": "4x4 Wheeled Amphibious Light Armored Scout Car"}, {"id": "36006c1d-f8c0-45a2-927f-34a2006ffc8e", "year_model": "1977", "description": "\r\n        \tThe 9P148 \"Konkurs\", also incorrectly identified by some as the \"BRDM-3\", is a variant of the base BRDM-2 Amphibious Scout Car series appearing in 1962, developed to replace the BRDM-1. The BRDM-2 series proved itself quite an adaptable and capable battlefield system since its inception and went on to see service beyond the Soviet Union with some 40 countries worldwide - many continuing its operation even today. The Konkurs derivative is mechanically similar to the base BRDM-2 vehicle and only differentiated by its mounting of the Konkurs (NATO: \"Spandrel\") anti-tank missile launcher atop the hull. The end-product is, therefore, a highly mobile, cross-country, anti-tank support vehicle that can reconnoiter terrain, report enemy positions and defend itself against enemy armor.\n\r\nOutwardly, the 9P148 highly mimics the original BRDM-2 Scout Car as it retains the rather utilitarian appearance of the original including its four wheel 4x4-power layout, slab lower hull and angled upper hull facings. It also retains the four auxiliary wheels that can be lowered at the center of the vehicle sides. Various vision ports allow the crew of two or three personnel sighting opportunities from the relative safety of the vehicle. Multiple access hatches allow for entry/exit of the vehicle. The boat-like front hull is purposefully designed as the 9P148 - like the base BRDM-2 before it - is fully amphibious, propelled through water by a propeller system buried at the rear facing of the lower hull.\n\r\nConcerning the support for the Konkurs missile, the 9P148 sports a five-launcher rail for the 9M113 Konkurs series wire-guided, anti-tank missile system (NATO: AT-5 \"Spandrel\"). The 135mm missile was introduced in 1974 to provide Soviet anti-tank teams a counter to NATO armor in-the-field. The missile packed a tandem HEAT (High-Explosive, Anti-Tank) warhead coupled with a solid-fueled rocket booster while detonation was by way of direct force contact. With an effective range of 2.5 miles, the Spandrel could reach out to enemy tanks at distance with good penetration results. As a wire-guided weapon, however, the operator could only control the missile (via thrust vectoring) during flight so long as the data wire attached to missile and launcher had not been severed. Sighting was accomplished by way of a device installation mounted along the front right of the upper hull. The launching system was specifically designed to be retractable and rest along the turret roof during transport while also decreasing the vehicle's side profile. The crew could launch all five missiles from within the protective hull or remotely by way of a relay cable, the crew positioned up to 80 meters away from the vehicle. Reloading was, however, managed externally from the onboard supply of missiles and as many as 14 could be carried. The crew reloaded the launcher rails through a hatch located aft of the launcher itself.\n\r\nIt is worth noting that early production 9P148 forms were restricted to firing only the 9M113 Konkurs series missile but the system has since evolved to support the 9M111 \"Fagot\" (NATO: AT-4 \"Spigot\") as well. Modernization to the 9P148 series has brought about the installation of a \"whip\" aerial communications antenna  as well as newer sighting devices relying the latest available technologies for much improved day and night support.\r\n\t\t", "vehicle_name": "BRDM-2 / 9P148 (Spandrel / Konkurs)", "vehicle_type": "Anti-Tank Guided Missile (ATGM) Carrier / Armored Scout Car"}, {"id": "5718b552-0caf-4817-823c-bed99bf4bcee", "year_model": "1960", "description": "\r\n        \tOne of the most important vehicles of the Soviet Union during the Cold War (1947-1991) became the BTR series of 8x8 wheeled, amphibious Armored Personnel Carriers (APCs). The line began with the BTR-40 armored truck of the 1950s and advanced into the tracked BTR-50 of 1954 (both detailed elsewhere on this site). In 1959 there debuted the definitive 8x8 wheeled form as the BTR-60 and this was followed by the improved BTR-70 (1972) and BTR-80 (1986) models. In the 1990s, the line was evolved once more, becoming the all-modern BTR-90, still in service with Russian Army (Internal Troops) forces today (2017).\n\r\nThe BTR-90 saw development begin in the early 1990s (about 1994) by the Arzamas Machine Building Plant, otherwise known as \"AMZ\" (part of GAZ). A pilot form became available for testing and evaluation as soon as 1994.\n\r\nRetaining all of the form and function of its predecessors, the BTR-90 adds a few new elements to the mix: it is dimensionally larger than the earlier BTR-80 with greater internal space for crew and passengers and improved survivability and protection. Power is from a turbocharged multi-fuel diesel engine developing 510 horsepower, driving power to all four axles. The driver manages his position at the front of the vehicle in the traditional way while the turret of the BMP-2 Infantry Fighting Vehicle (IFV) is seated directly aft with full 360-degree traversal. The turret sides house electronically discharged smoke grenades for a self-screening effect and can mount Anti-Tank Guided Missile (ATGM) launchers (Spandrel series), searchlights and optic assistants. Two crew are featured in the turret itself which also houses the 30mm Shipunov  2A42 automatic cannon ( with 500 projectiles carried) and a coaxial 7.62mm PKT machine gun (2,000 rounds carried). A remote-control 30mm Automatic Grenade Launcher (AGL) is also offered for suppression of soft enemy targets at range.\r\n\t\t", "vehicle_name": "BTR-60", "vehicle_type": "8x8 Armored Personnel Carrier (APC)"}, {"id": "62457b49-2d94-45cc-9787-f5341f5c892b", "year_model": "1972", "description": "\r\n        \tThe BTR-70 represents a further development of the successful line of BTR-60 armored personnel carriers of Soviet design. They are eight-wheeled lightly armored systems capable of off road and amphibious travel and can field up to seven combat-ready personnel into battle. The BTR-70 features improvements over the preceding BTR-60 design in the way of a more powerful engine, power-to-weight ratio and side firing ports for the passengers. The system is still in active service with a variety of operators around the world.\n\r\nOutwardly, the BTR-70 retains the look of the BTR series as a whole and follows along the lines of the BTR-60PB model. Armor is sloped on the front, sides and rear of the vehicle and eight large rubber road wheels are present (four to a side) with the front four being power assisted. A tire pressure regulation system ensures proper balance. A crew of three is standard and seating for up to seven passengers is available via an entry/exit door along the side of the hull between road wheels two and three. The vehicle's commander sits at front along with the driver. The sloped-armored turret (standard on the base model - some models remove the turret based on specialty) sits to the front top portion of the hull with a primary armament of 14.5mm KPVT heavy caliber machine gun and a secondary 7.62mm PKT anti-infantry machine gun. The turret is manually traversed but has a field of fire covering 360 degrees and is the same weapon system as found on the BRDM-2 scout car and BTR-60PB armored personnel carriers. The troop compartment makes up most of the rear portion of the hull which also includes the engines. Power is generally derived from gasoline engines developing about 120 horsepower each, allowing for ideal road speeds of up to 80 kilometers per hour.\r\n\t\t", "vehicle_name": "BTR-70", "vehicle_type": "8x8 Wheeled Armored Personnel Carrier (APC)"}, {"id": "b64d022b-27bd-4486-9c50-ee7651c6dac8", "year_model": "1987", "description": "\r\n        \tThe BTR-80 was the logical evolution of the wheeled armored personnel carrier (APC) BTR series that more or less hit its stride in the 1960s with the development of the BTR-60. The BTR-80 itself was developed to replace both the BTR-60 and the similar BTR-70 models and entered production in 1986, seeing operational service soon after. The BTR-80 was based on the lessons learned from the design and operation of the BTR-70 and incorporated several key strengths of its design while bringing into the fold various technological suites as required by today's battlefield environments.\n\r\nTaking the BTR-70 as a starting point, Soviet engineers did away with the twin gasoline engine setup of the former BTR-60 and BTR-70 designs and instead fitted a single V-form 8-cylinder KamAZ-7403 series diesel engine to deliver 260 horsepower at 2,600rpm. The characteristic eight road wheel arrangement was retained. The implementation of the new powerplant required some restructuring of the rear engine compartment which raised the rear hull line. Modernized sighting devices (nightvision to both the driver and the commander) were installed as was an infra-red search light. Armament was fitted to a revised, low-profile one-man turret and given 360-degree traverse and 60+ degrees elevation to counter low flying aircraft and engage targets even if the vehicle was hampered along sloped terrain. Primary armament came in the form of a 14.5mm KPVT anti-aircraft heavy machine gun supported by a 7.62mm PKT general purpose machine gun.\n\r\nThe standard operating crew included the driver, commander and gunner while up to eight combat ready soldiers could be ferried in relative safety in the revised fighting compartment. The driver and commander were situated at the front of the hull under the shallow glacis plate while the gunner manned the powered turret system. Passengers could take part in a given firefight thanks to the inclusion of rounded firing ports complete with ball mounts located at the side (three each side) and front facings of the hull. The vehicle's operating weight was listed at nearly 15,000kg while displaying a running length of 7.65 meters, a width of 2.90 meters and a height of 2.35 meters. Independent suspension and drive power was afforded to all eight wheels and operational ranges were listed out to 600 kilometers. Steering was assisted at the front four wheels only. A centralized tire air pressure system maintained the required levels to all eight wheel systems and was controlled by the driver for when managing varied terrain \"on-the-fly\".\n\r\nThe BTR-80 was designed with a certain level of self-survivability in mind and could manage to lose two of its eight road wheels and still keep itself viable. Top speed was 80 kilometers on smooth paved surfaces, lesser on rough and uneven terrain. The BTR-80 was given amphibious capabilities and could traverse relatively calm waters at roughly 9 kilometers per hour with its integrated water jet propulsion system that required no outward preparation by the crew. The crew was also protected in the event of nuclear fallout and chemical weapons by a new Nuclear, Biological and Chemical (NBC) suite and a pressurized fighting compartment. Six 81mm smoke grenade dischargers were fitted to the rear of the turret and set to fire forwards for self-protection in a combat environment. Armor was designed heavy enough to deflect or stop small arms fire and artillery spray but was not specifically designed to withstand direct hits from larger caliber weapons, rocket grenades or anti-tank missile weapons. Troops exited/entered the BTR-80 hull through split doors found on the hull sides between the forward and rearward wheel pairings (between axles two and three). Each door was split horizontally with the upper portion hinged to open forwards and the lower portion folded down to become a step capable of supporting the weight of a soldier. A third door section along the hull roof could similarly flip upwards (towards centerline) for increased headroom and speedy insertion/extractions.\n\r\nOnce in service, the BTR-80 had proven a winner for the Red Army, with off-road performance equal to that of any tracked vehicle systems coupled with excellent on-road performance. Where it lacked in protection and firepower (not its specifically designed forte) it made up for in mobility and speed. Such was the success of the BTR-80 that it went into service with a plethora of national armies the world over including Columbia, Hungary, Romania, Ukraine, North Korea and South Korea among others. The Ukrainians took initiative and branched their BTR-80 series family into further improved indigenous lines to benefit their mobile army units. The BTR-80 chassis has also proven highly adaptable to the fitting of various armament types (machine guns, cannons) as well as flexible enough for several required battlefield roles to include that of command vehicle, battlefield ambulance, signals vehicle and mobile communications station.\n\r\nA new YaMZ-238M2 engine was introduced into the BTR-80 line in 1993, further enhancing inherent capabilities. As of this writing, at least 5,000 BTR-80s have been placed into service with 35 countries.\r\n\t\t", "vehicle_name": "BTR-80", "vehicle_type": "Armored Personnel Carrier (APC)"}, {"id": "ad345e6d-48a9-4372-80fb-892732aec1f1", "year_model": "2004", "description": "\r\n        \tOne of the most important vehicles of the Soviet Union during the Cold War (1947-1991) became the BTR series of 8x8 wheeled, amphibious Armored Personnel Carriers (APCs). The line began with the BTR-40 armored truck of the 1950s and advanced into the tracked BTR-50 of 1954 (both detailed elsewhere on this site). In 1959 there debuted the definitive 8x8 wheeled form as the BTR-60 and this was followed by the improved BTR-70 (1972) and BTR-80 (1986) models. In the 1990s, the line was evolved once more, becoming the all-modern BTR-90, still in service with Russian Army (Internal Troops) forces today (2017).\n\r\nThe BTR-90 saw development begin in the early 1990s (about 1994) by the Arzamas Machine Building Plant, otherwise known as \"AMZ\" (part of GAZ). A pilot form became available for testing and evaluation as soon as 1994.\n\r\nRetaining all of the form and function of its predecessors, the BTR-90 adds a few new elements to the mix: it is dimensionally larger than the earlier BTR-80 with greater internal space for crew and passengers and improved survivability and protection. Power is from a turbocharged multi-fuel diesel engine developing 510 horsepower, driving power to all four axles. The driver manages his position at the front of the vehicle in the traditional way while the turret of the BMP-2 Infantry Fighting Vehicle (IFV) is seated directly aft with full 360-degree traversal. The turret sides house electronically discharged smoke grenades for a self-screening effect and can mount Anti-Tank Guided Missile (ATGM) launchers (Spandrel series), searchlights and optic assistants. Two crew are featured in the turret itself which also houses the 30mm Shipunov  2A42 automatic cannon ( with 500 projectiles carried) and a coaxial 7.62mm PKT machine gun (2,000 rounds carried). A remote-control 30mm Automatic Grenade Launcher (AGL) is also offered for suppression of soft enemy targets at range.\r\n\t\t", "vehicle_name": "BTR-90", "vehicle_type": "8x8 Armored Personnel Carrier (APC)"}, {"id": "db213007-05d3-451a-b393-e2e873443e77", "year_model": "1963", "description": "\r\n        \tThe D-30 122mm howitzer became the standard Soviet artillery battlefield system in 1963, replacing the aging World War 2-era 122mm M-30 model of 1938. The original system was developed to serve in support of motorized rifle elements equipped with the BTR series of wheeled Armored Personnel Carriers (APCs). On the whole, the D-30 became a largely conventional artillery piece, reliable and robust under battlefield conditions, making it a favorite of Soviet allied nations and states during the Cold War decades. It still serves in surprising numbers on today's battlefields (2015).\n\r\nThe D-30 is cleared to fire standard FRAG-HE (FRAGmentation, High-Explosive) and HEAT-FS (High-Explosive, Anti-Tank, Fin-Stabilized) rounds. It is also capable of launching chemical rounds including TNT-detonated Sarin gas types. Rocket-Assisted Projectiles (RAP) extend the range of the weapon to that of 21,900 meters (13.6 miles). Sustained fire by a capably trained and well experienced gunnery crew can reach 4-8 rounds per minute. The gun has an elevation / depression limit of +70/-7 degrees and indirect fire and direct fire is possible. The gun mounting hardware sits atop a tripod base which also serves as the two-wheeled tow unit. Traversal is a full 360-degrees from centerline. Recoil is handled through a hydopneumatic system.\n\r\nAs with other artillery pieces, the D-30 is towed into action. For Russian (and related forces), the primary mover vehicle has been the tracked MT-LB or Ural-375 wheeled vehicle though many other haulers are possible replacement candidates. Design of the weapon system has been attributed to F.F. Petrov with manufacture through the Motovilikha Plant.\n\r\nSeveral variants have been manufactured beyond the original D-30 - which also carried the designator of \"2A18\". The weapon has been produced locally by China, Croatia, Egypt, Iran, Iraq, Yugoslavia (Serbia), and Sudan resulting in various localized designations appearing. The Egyptian D-30-M model has been featured in the Egyptian Self-Propelled Gun (SPG) platform as the SPH-122 (American M109 howitzer chassis) and T-122 (Soviet T-34 tank chassis). \r\n\t\t", "vehicle_name": "D-30 / 2A18 (Model 1963)", "vehicle_type": "122mm Towed Field Howitzer"}, {"id": "7340eac1-52e2-404a-a436-dc61c4ec1e4a", "year_model": "1982", "description": "\r\n        \tThe DT-30 (Vityaz) is a lightly-armored, tracked, multi-purpose battlefield vehicle originating from the Soviet Cold War era and continues to provide service with the Russian Army today. Design work on the vehicle began in 1971 which led to serial production models coming off the Ishimbai Transport Machine-Building Plant assembly lines by 1982. The near-60-ton design offers excellent off-road mobility and undertakes heavy-cargo carrier roles for the service.\n\r\nThe vehicle was born out of a Soviet need in the 1960s for increased mobility, particularly as a war against the West in Europe was all but inevitable - requiring the mammoth Soviet Army to cut across the European landscape in short order. What was needed was a heavy hauler to carry across these landscapes heavier loads than what was currently being offered by in-service systems of same function. The result was the oversized Vityaz with its wide beam, low ground pressure, and articulated rear section to relatively easily move cargo from Point A to Point B.\n\r\nState trials involving the prototype vehicles DT-LP and DT-L then followed, resulting in the DT-30 articulated vehicle being approved for widespread production and service. What the Soviet Army received was a product capable of operating in extreme weather conditions and on soft terrain, making it ideal for operations in the Arctic, Antarctica, and the unforgiving northern territories of the vast Soviet expanse. Even the Oil and Gas industry went on to benefit from this rugged \"go-anywhere\" vehicle.\n\r\nStructurally, dimensions include a running length of 45 feet, a width of 9.2 feet, and a height of 8.10 feet. All-welded construction makes up the hull. Inside there is a standard operating crew of two and the engine sits behind the crew compartment, the powerplant being a 12-cylinder engine coupled to a manual transmission system. Externally, each track side features six road wheels and the drive sprocket sits at front with the track idler at rear. The rear hull component also mimics this track-an-wheel arrangement for consistency. Access to the cabin is through hinged, automobile-style doors and the short hull nose offers an elevated, commanding view of the terrain ahead - viewed through three rectangular window panes each having their own windshield wiper. Headlamps are positioned over the cabin and at the front of the hull for low-light/night time driving. Ground clearance is excellent making the vehicle ideal for cross-country/uneven terrain travel and even amphibious crossings. The forward unit can operate even if the rear component has failed. The DT-10P variant weighs in at 31 tons while the DT-30 is a hefty 58 tons.\n\r\nNo defensive armament as the DT-30 is essentially a logistics support vehicle - though personal weapons can be carried by the crew. The distinct design of the hull also provides some (light) protection against hidden mines and IEDs.\n\r\nSlovakia is the only other known operator of the DT-30 series and this is strictly through their Fire and Rescue Corps.\r\n\t\t", "vehicle_name": "DT-30 Vityaz", "vehicle_type": "Articulated Tracked Utility Vehicle"}, {"id": "6b9ad8a9-4a61-411e-9cbb-be76f73f1007", "year_model": "2007", "description": "\r\n        \tThe Russian originated GAZ-2975 \"Tigr\" (\"Tiger\") is the Russian Army equivalent to the ubiquitous HUMVEE multipurpose 4x4 wheeled vehicle of the American military. The type saw its design phase begin in 2001 through the Military Industrial Company (MIC) with production beginning in 2004 and service entry occurring during 2006. The vehicle shares some broad physical similarities with the American offering and has the same multirole, multipurpose, all-terrain battlefield functionality as its competing design.\n\r\nThe Tigr was first showcased to the public during IDEX 2001.\n\r\nThe vehicle is a 16,000lb machine with an overall length of 19 feet, a width of 7.9 feet and a height to the hull roof of 7.9 feet. The forward windscreen is of a two-section arrangement with the sides of the vehicle featuring thick rectangular vision ports. The hull roof line is flat and can mount the optional gun position as in the HUMVEE. Entry/exit for the occupants is by way of hinged, automobile-style doors. The vehicle is suspended atop a torsion bar suspension system for off-road travel and comfort with its four large road wheels set to the extreme corners of the chassis for strong balance. Armor protection ranges from 5mm to 7mm depending on configuration.\n\r\nPower for the Tigr is served through various American Cummins diesel-fueled offerings in the 6-cylinder mold as well as a YaMZ-534 4-cylinder model. Output ranges from 180- to 215-horsepower depending on installation. The engine is mated to a GAZ JSC 5-speed manual transmission and can alternatively be paired with the Allison LCT-1000 automatic series or the GM 545RFE line. Operational ranges reach 620 miles on internal fuel with a maximum road speed of 87 miles per hour on roads and 50 miles per hour off-road. The driver sits at the front-left of the passenger cabin with a passenger seat to his right over the center console containing the transmission control.\n\r\nArmament is variable and generally based on mission need. Typical load outs include a single 7.62mm PKP general purpose machine gun or the 30mm AGS-17 automatic grenade launcher - much in the same vein as the American HUMVEE.\n\r\nThe Tigr is the standard high mobility vehicle of Russian military forces. Serial production began in full during 2007. A civilian market version has emerged as the Tigr-2. Internal security make use of the SPM-1.\n\r\nOther variants include the GAZ-2330 unarmored mark and the five-door GAZ-23304. The GAZ-233011 and GAZ-233012 are four- and two-door haulers (respectively) with a flat bed. The GAZ-233013 is an unarmored three-door mark. The Tigr-M is a new updated version with extra armor protection, a diesel powerplant and increased passenger seating. The Kornet-D/EM is the Tigr with the Kornet-EM anti-tank missile launcher fitted atop its roof. The Tigr-6A SPV is a proposed officer battlefield transport.\n\r\nTo date, the Tigr line has been adopted by the militaries and police forces of Armenia, China (partial local production), Congo, Guinea, Mongolia, Nicaragua and Uruguay.\r\n\t\t", "vehicle_name": "GAZ Tigr (Tiger)", "vehicle_type": "4x4 Infantry Mobility Vehicle (IMV)"}, {"id": "9580279a-72d3-4f2a-aa1a-1a17bc45cf02", "year_model": "2016", "description": "\r\n        \tIn both form and function, the relatively new, in-trials VPK-3927 \"Volk\" serves as the Russian Army's take on the ubiquitous American \"HUMVEE\" - a high-mobility, multi-purpose vehicle designed to undertake a variety of roles on-and-off the battlefield. Design work began in 2010 with the GAZ \"Tigr\" used as a starting point - suitable modifications being made to fulfill a joint security / military request. The Volk was debuted in 2010 during IDELF.\n\r\nThe VPK brand label falls under the GAZ Group brand name.\n\r\nThe result is a 11.25 ton (short) vehicle utilizing a 4x4, fully-suspended (independent hydropneumatic) wheel arrangement. A standard operating crew is two with passenger seating for up to eight combat-ready personnel. Dimensions of the vehicle include a running length of 22.10 feet, a width of 8.1 feet and a height of 6.10 feet. Armor protection is suitable against small arms fire and artillery spray while up-armored forms can protect up to STANAG 4569 Level 3. The car showcases automobile-style doors along the side of the hull for general entry/exit of the driver and forward passenger while rear passengers utilize a rear door arrangement.\r\n\t\t", "vehicle_name": "GAZ VPK 3927 (Volk)", "vehicle_type": "Light Armored Infantry Mobility Vehicle (IMV)"}, {"id": "2abc35b3-5944-4e0e-98cd-e41d82f5e0f9", "year_model": "2005", "description": "\r\n        \tLong-time truck-maker Iveco of Italy (founded 1975 in turin) lends its design and manufacturing talents to the production of the multi-faceted \"Light Multirole Vehicle\" - or \"LMV\". The product was designed during the latter hald of the 1990s and entered production in 2001 and remains ongoing today (2017). The vehicle has been adopted by a plethora of operators outside of the Italian armed forces (where it is known as the VTLM \"Lince\") including Albania, Austria, Belgium, Brazil, Croatia, the Czech Republic, Lebanon, Norway, Russia, Slovakia, Spain, Syria, Tunisia and the United Kingdom. Its global reach showcases the type's inherent versatility and robustness across today's battlefields.\n\r\nThe LMV was originally known to Iveco under the model number of M65E19 WM-4x4. Initial pilot vehicles were readied in 2001 for testing.\n\r\nAt its core, the LMV is a 6.5 ton system with an overall length of 4.7 meters, a width of 2 meters and a height of 1.95 meters. It features a crew of one+four and a \"stretched\" model adds two more passengers. Armor protection for the occupants is up to STANAG 4569 though the armor arrangement is highly modular and suited to the mission role as needed. Power is from an in-house Iveco F1D Common Rail EURO 3 diesel unit of 182 horsepower fitted to the front section of the chassis and coupled to a 6-speed automatic transmission system. This provides road speeds nearing 130 kmh and an operational range out to 500 kilometers. The vehicle sports four large roadwheels (with run-flat capability) suitable for road and cross-country travel and the chassis features an independent, double A-arm suspension package. A high ground clearance allows the vehicle to manage low-lying water sources and other battlefield obstacles.\n\r\nThe LMV makes heavy use of off-the-shelf parts and components to reduce procurement costs and make the product logistically-friendly to any one nation requiring the services of a 4x4 wheeled performer like the LMV. Two distinct wheelbases are offered - 3.2 meters and 3.5 meters. Standard equipment includes a heated front windscreen, air conditioning for the passenger section and power-assisted steering (to go along with the automatic transmission fit).\r\n\t\t", "vehicle_name": "IVECO LMV (Light Multirole Vehicle)", "vehicle_type": "Infantry Mobility Vehicle (IMV)"}, {"id": "08ca5f5d-a9a8-4394-b149-a49d9ce098d9", "year_model": "2014", "description": "\r\n        \tAs more and more battlefield roles are turned over to unmanned vehicles, the Russian Army is embracing additional types for more dangerous actions typically handled by humans. The 6-ton \"Uran-6\", by JSC 766 UPTK, is a relatively new entry to the Russian ranks, developed for the all-important, ultra-critical role of mine-clearance/demining. The vehicle is in active service with Russian armed forces and has seen deployment to the Chechen Republic in mid-2014, Syria in 2016, and - most recently - as part of the peacekeeping-minded Russian contingent in Azerbaijan across war-torn Nagorno-Karabakh.\n\r\nThe vehicle is designed to actively participate in mine removal/mine destruction operations in dense urban or lightly-populated remote areas.  The Uran-6 carries on its hull a mine flail under a dozer-like housing at the bow and has access to other implements for the role: a tiller, \"gripper\", crane, and heavy mine-roller. A robotic arm allows for more precise manipulation of items and ground obstacles when needed and this component is supported by a fork-lift and shovel attachment. All of this can be controlled by a single ground operator positioned safely from the work zone at distances up to 1 kilometer away.\n\r\nDimensions of the Uran-6 vehicle include a length of 14.6 feet with a width of 6.56 feet and a height of 4.89 feet. This allows it to be transportable in a conventional Russian military truck and made ready-to-use in short order. Beyond this, its compact footprint allows it to be air-transportable via helicopter (Mi-8 or similar) or in the hold of a tactical-level transport.\n\r\nThe vehicle is powered by a diesel-fueled engine developing 240 horsepower and driving the system to road speeds of 5 kmh. Range is equal to five consecutive hours of operation. The track-over-wheel nature of its design ensures some cross-country capability as the vehicle is able to traverse angles of 20-degrees and climb obstacles up to four feet in height. Its inherent weight and armor protection allow the Uran-6 to survive modest explosions with little impact to core operating systems - tested against 132lb of explosive material.\r\n\t\t", "vehicle_name": "JSC Uran-6", "vehicle_type": "Unmanned Mine-Clearing Vehicle"}, {"id": "5f1c7d45-a162-4807-b5c8-75a15fd36f03", "year_model": "2015", "description": "\r\n        \tThe future of modern warfare revolves around unmanned systems, both on the ground and over it. Rosoboronexport markets the Uran-9 Unmanned Combat Ground Vehicle (UCGV) for the former and has been developed to fulfill various mission roles including reconnaissance, infantry support (particularly in urban environments), and counter-terrorism actions where risk-of-life is high. The vehicle was developed and is manufactured by JSC 766 UPTK and has been taken into service, in limited numbers, by the ground forces of Russia.\n\r\nThe vehicle showcases a boxy appearance with an angled glacis plate and near-vertical sides. Side skirts protect the upper reaches of the track link sections though the roadwheels remain exposed. The drive sprocket is at the rear with the track idler at front. There are six road wheels to a hull side. Headlamps provide illumination in low-light settings and an optics fit is seen at the glacis plate. Additional equipment is carried atop the turret which sits atop the forward section of the hull roof line.\n\r\nAll of the armament is installed on the turret which provides a full 360-degree traversal. At the front plate is the 30mm 2A72 automatic cannon offering a good counter to light- and moderately-armored vehicles at range while also serving as a very capable area suppression weapon against infantry. To either side of the turret is fitted a pair of 9M120 \"Ataka\" Anti-Tank Guided Missiles (ATGMs) for countering armored threats at range. The 130mm Ataka SACLOS (Semi-Automatic Command-to-Line-of-Sight) missile is a product of the latter-Cold War period and sports a tandem HEAT (High-Explosive, Anti-Tank) warhead for maximum penetration upon impact. The armament suite is rounded out by the six Shmel-M thermobaric rocket launchers with three seated above each Ataka launcher fit. These 93mm rockets provide additional firepower against both vehicles and infantry at range.\n\r\nIn June of 2018 it was revealed that the Uran-9 has been deployed in active combat alongside Russian Army forces in the ongoing Syrian Civil War. A post-action report detailed several major deficiencies in its showing there, particularly in operator communications being cut-off from the vehicle after certain ranges. Additionally its running gear reliability was called into question.\r\n\t\t", "vehicle_name": "JSC Uran-9", "vehicle_type": "Unmanned Ground Combat Vehicle (UGCV)"}, {"id": "2ce50271-7dda-4a2f-b7f0-086f7130ab8a", "year_model": "2009", "description": "\r\n        \tThe Russian military has certainly made strides towards modernization in the last decade or so. For its land forces, a host of armored wheeled vehicles have been introduced or are under evaluation. One such example of the former is the BPM-97 (Boyevaya Pogranichnaya Mashina = \"BattleVehicle Border Guard\"), a 4x4 wheeled, armored personnel carrier designed around modern armored vehicle concepts and technologies. Design is attributed to Andrei Nikolaev and manufacture is handled by Kamskiy Avtomobilny Zavod (KAMAZ). Production has been ongoing since 1999 to which some 150 examples have been delivered to Russian Border Guard units. The KAMAZ-43269 \"Dozor\" is an army-minded model and the KAMAZ-43269 \"Vystrel\" (\"Shot\") is available as a newer, upgraded form.\n\r\nTo date (2017), users include Russia, Azerbaijan, Kazakhstan and Syria.\n\r\nIn its design, the 10.5 metric tonne BPM-97 uses a conventional automobile-style layout complete with forward windshield, a 4x4 road wheel arrangement and front-mounted engine. The road wheels are large and rubber-tired, providing excellent ground clearance (400mm), ground displacement and cross-country mobility. Power is from an in-house KAMAZ 740.10-20 V8 diesel engine of 240 horsepower output and the chassis relies on a leaf spring suspension system. Road speeds can reach 90 kmh and operational ranges are out to 1,100 kilometers. Dimensions of the vehicle include a length of 5.3 meters, a width of 1.9 meters and a height of 2.3 (hull roof line). Internally there is space for two operating crew and up to eight passengers. Entry and exit is by way of traditional hinged side doors as well as a rear access point. Hatches are also fitted along the roof. The crew compartment is fully-enclosed and protected (aluminum alloy constructed) while being rated against weapons up to 25mm cannon projectiles.\n\r\nArmament is variable as the vehicle can accept different turret fits. As such, 7.62mm, 12.7mm and 14.5mm machine guns can be fitted. Secondary installations typically involve a 30mm automatic grenade launcher for maximum enemy troop suppression at range. This is in addition to any personal weapons carried by the crew (in the form of standard-issue small arms).\n\r\nThe BPM-97 is a noticeable upgrade for Russian Border Guard units who had outgrown their aging GAZ-66 trucks. Some of the cars are also in service with various special Russian military departments and the line has been furthermore identified in-action during the War in Donbass against Ukraine as well as in the long-running Syrian Civil War, the local government being backed by Russian military might. The BPM-97 family of vehicles is set to broaden with the arrival of special-mission types featuring evolved role-players such as mine clearance and increased troop-hauling versions. A 6x6 wheeled armored form with lengthened hull is known as the SBA-60K2 \"Bulat\". Introduced in 2013, the KAMAZ product is built by Zaschita of Russia.\r\n\t\t", "vehicle_name": "KAMAZ BPM-97 (Boyevaya Pogranichnaya Mashina)", "vehicle_type": "4x4 Armed Reconnaissance Vehicle"}, {"id": "7460d561-2af5-4965-b4e0-31b12c1f9908", "year_model": "2013", "description": "\r\n        \tAs the battlefield has become more mobile, the Russian Army has modernized and equipped with various wheeled vehicles that includes the 4x4 wheeled \"BPM-97\" (detailed elsewhere on this site) and its lengthened 6x6 wheeled counterpart, the SBA-60K2 \"Bulat\" - both manufactured by KAMAZ in Russia. The SBA-60K2 harkens back to the Soviet Cold War period when the BTR-152, with its long 6x6 wheelbase, permeated the Soviet inventory from the 1950s onward. Some 15,000 of this design were completed before the end of its production run.\n\r\nThe SBA-60K2 \"Bulat\" is an all-modern offering, designed along the lines of an Armored Personnel Carrier (APC). The vehicle weighs in between 16 and 19.5 tons depending on mission load out and armament fit and has a running length of 8 meters with a beam of 2.5 meters and a height of 2.6 meters. Internally, there is an operating crew of two with seating for eight combat-ready troops. If armed, the vehicle carries a 7.62mm or 12.7mm machine gun in a Remote Weapon Station (RWS) over the hull roof. The engine is installed at the bow with the driver at front-left.\n\r\nThe chassis is based in the KAMAZ-5360 6x6 wheeled military truck with an all-new angled armored hull superstructure fitted. The hull features entry/exit points at the sides and rear while firing ports are provided for the passengers. The roof line contains six roof hatches. An air conditioning system is standard.\n\r\nDrive power is from a KamAZ-740.31-240 turbocharged diesel-fueled engine of 240 horsepower coupled to a 6x6 wheeled arrangement. The engine is coupled to a 10-speed manual gearbox. Road speeds can reach up to 90 kmh with an operational range out to 800 kilometers.\n\r\nWhile lightly armored, the SBA-60K2 includes several survival features: bullet-resistant windows, a central tire inflation / regulation system, fire suppression system, optional 360-degree camera, and powered winch. The angled armor plates give basic ballistics protection as well while the hull armor is V-shaped to deflect blasts occurring under the car - enhancing crew and passenger survivability to an extent. Mine-resistant seats are also given to the occupants.\n\r\nDevelopment of the design began in 2010 and series production followed in 2013 and the line takes an active presence in the modern Russian Army. Zaschita assists in the production effort. At least 65 of the vehicles are in service (2020).\r\n\t\t", "vehicle_name": "KAMAZ SBA-60K2 Bulat", "vehicle_type": "6x6 Wheeled Armored Personnel Carrier (APC)"}, {"id": "606ff484-30b5-432f-a6f7-a4fcec2ed3fc", "year_model": "2014", "description": "\r\n        \tThe KAMAZ Tornado-G is a mobile, self-propelled, wheeled Multiple-Launch Rocket System (MLRS) developed by local Russian industry for the Russian Army. It is being used to succeed the aging line of Cold War-era BM-21 \"Grad\" MLRSs (detailed elsewhere on this site) in same battlefield role.  Over 150 of the systems are thought to be currently (2018) in active service with the Russian Army.\n\r\nThe \"Tornado\" name is used to cover a family of related rocket-projecting vehicles in the Russian inventory including the \"Tornado-U\" and \"Tornado-S\" models - all have slightly different battlefield roles concerning their rocket-launching capabilities.\n\r\nThe G-model vehicles use a proven six-wheeled truck arrangement (KAMAZ or Ural-4320 type) with the engine and driving cab set at the front and a flatbed section set over the rear of the chassis. The rear section seats the 122mm rocket-launching pack atop a traversing / elevating mount for true 360-dergee fields of fire. This is tactically sound in that the truck does not need to face the direction of fire at any one point in the action. The launcher component is available in two distinct forms - 1 x 40 version and a 2 x 15 version. The chassis relies on a 6x6 wheeled arrangement with a single, steerable axle at front and two fixed axles at the rear supporting the bulk of the rocket launcher pack's weight. Ground clearance is excellent and the chassis is designed for cross-country mobility. Protection is very minimal, however, for these weapon systems are not intended for direct-combat, front-line operation.\n\r\nThe Tornado-G fires the 9M538, 9M539, and 9M541 rocket types which can carry variable warhead types including High-Explosive, FRAGmentation (HE-FRAG), Anti-Personnel (AP), and the like. The launching system is simplified to the point that rockets vacate the launcher unit in just seconds and rearming is accomplished in short order (via support from an accompanying resupply vehicle. Combined with the quality of mobility inherent in a 6x6 drive vehicle and the Tornado-G is an all-in-one ranged battlefield solution.\n\r\nSeries production of the vehicles began in 2013 and export approval was granted in 2018.\r\n\t\t", "vehicle_name": "KAMAZ Tornado-G", "vehicle_type": "6x6 Wheeled Mobile Multiple-Launch Rocket System (MLRS)"}, {"id": "e0bd5f44-af35-4a1f-8b4d-4b4ef1d67463", "year_model": "2014", "description": "\r\n        \tThe wars of the late 1990s and 2000s gave rise to a whole new class of armored vehicle called Mine-Resistant, Ambush-Protected (MRAP) providing frontline ground forces with enhanced protection in urban settings. The MRAP was used to good effect throughout the American and coalition wars in Afghanistan and Iraq where surprise attacks from mines, Improvised Explosive Devices (IEDs), and guerilla-style assaults proved commonplace. A long-time fixture of South African forces, the MRAP eventually became a mainstay of major fighting forces such as the United States, Great Britain, and Russia.\n\r\nOne of the available Russian forces is the KAMAZ-53949 - also known as the Taifun K-53949 - born of the versatile \"Typhoon\" line of vehicles manufactured en mass by the KamAZ concern of Russia. The general form entered serial production in 2014 and has branched to include various types in 4x4, 6x6, and 8x8 wheeled configurations. The K-53949 is a 4x4 wheeled form serving as both an Armored Personnel Carrier (APC) of sorts and an armored cargo vehicle.\n\r\nMRAPs get their classification from the ability to sustain extensive damage or showcase enhanced resilience from blasts that would otherwise destroy or debilitate a traditional light-armored wheeled vehicle. A typical design quality of such vehicles is a Vee-shaped undercarriage used to deflect blasts away from the vehicle and its occupants. In addition to this, blast-resistant seats are usually part of the design makeup, increasing the likelihood of passenger survival in active warzones. Other notable qualities include blast/bullet resistant walls and windows, gun ports, and multiple entry-exit hatches/doors.\n\r\nThe K-53949 utilizes a conventional automobile-style layout with the engine at front and crew/passenger cabin middle-aft. Large road tires are featured with a run-flat ability and the vehicle is given high ground clearance. Armor protection is against small arms fire and artillery spray. An amphibious quality is granted by way of a ducted, raised exhaust stack originating from the right side of the engine compartment. The rear of the vehicle can be configured for various battlefield roles including cargo-hauling, Command Post (CP), Anti-Tank Guided-Missile (ATGM) missile carrier, and battlefield ambulance (known as the \"Linza\"). Armament (including Remote Weapon Stations - RWSs) is variable and seated atop the roof of the vehicle for complete 360-degree traversal of the weapon emplacement. Also, any personal weapons carried by the occupants can come into play as needed.\n\r\nInterestingly, there is heavy reliance on Western components in the general makeup of the Russian-borne Taifun. This includes the Cummins 6ISBe 350 series P-6 diesel-fueled engine which powers the 4x4 wheeled arrangement and coupled to an Allison 6-speed automatic transmission system. The engine propels the vehicle to road speeds of 105 kmh out to a range not exceeding 850 kilometers. The hull is developed by Israel-based Plasan Sasa.\n\r\nThe vehicle measures an overall length of 6.4 meters, a beam of 2.5 meters, and a height of 3.3 meters - giving proper clearance for air transportation in the hold of both tactical- and strategic-type airlifters. Two crew are typically featured with seating for an additional eight personnel. Entry-exit is through four automobile-style hinged doors and a rear access point. The vehicle can ford water sources of 1.75 meters deep (some preparation is required) and cross 0.5 meter trenches. Its gradient traverse limited is 60%. The vehicle sits atop a Timoney (of Ireland) hydropneumatic suspension system which aids in cross-country travel.\n\r\nThis Typhoon entry was developed as a private venture in 2010 and unveiled in 2013. By 2020, it has become a fixture with Russian fighting forces.\r\n\t\t", "vehicle_name": "KAMAZ Typhoon", "vehicle_type": "Mine-Resistant, Ambush-Protected (MRAP) Vehicle"}, {"id": "f5b44177-f3c1-48b2-a29f-47cae2c0a5d5", "year_model": "2020", "description": "\r\n        \tThe wars of the late 1990s and 2000s gave rise to a whole new class of armored vehicle called Mine-Resistant, Ambush-Protected (MRAP) providing frontline ground forces with enhanced protection in urban settings. The MRAP was used to good effect throughout the American and coalition wars in Afghanistan and Iraq where surprise attacks from mines, Improvised Explosive Devices (IEDs), and guerilla-style assaults proved commonplace. A long-time fixture of South African forces, the MRAP eventually became a mainstay of major fighting forces such as the United States, Great Britain, and Russia.\n\r\nOne of the available Russian forces is the KAMAZ-53949 - also known as the Taifun K-53949 - born of the versatile \"Typhoon\" line of vehicles manufactured en mass by the KamAZ concern of Russia. The general form entered serial production in 2014 and has branched to include various types in 4x4, 6x6, and 8x8 wheeled configurations. The K-53949 is a 4x4 wheeled form serving as both an Armored Personnel Carrier (APC) of sorts and an armored cargo vehicle.\n\r\nMRAPs get their classification from the ability to sustain extensive damage or showcase enhanced resilience from blasts that would otherwise destroy or debilitate a traditional light-armored wheeled vehicle. A typical design quality of such vehicles is a Vee-shaped undercarriage used to deflect blasts away from the vehicle and its occupants. In addition to this, blast-resistant seats are usually part of the design makeup, increasing the likelihood of passenger survival in active warzones. Other notable qualities include blast/bullet resistant walls and windows, gun ports, and multiple entry-exit hatches/doors.\n\r\nThe K-53949 utilizes a conventional automobile-style layout with the engine at front and crew/passenger cabin middle-aft. Large road tires are featured with a run-flat ability and the vehicle is given high ground clearance. Armor protection is against small arms fire and artillery spray. An amphibious quality is granted by way of a ducted, raised exhaust stack originating from the right side of the engine compartment. The rear of the vehicle can be configured for various battlefield roles including cargo-hauling, Command Post (CP), Anti-Tank Guided-Missile (ATGM) missile carrier, and battlefield ambulance (known as the \"Linza\"). Armament (including Remote Weapon Stations - RWSs) is variable and seated atop the roof of the vehicle for complete 360-degree traversal of the weapon emplacement. Also, any personal weapons carried by the occupants can come into play as needed.\n\r\nInterestingly, there is heavy reliance on Western components in the general makeup of the Russian-borne Taifun. This includes the Cummins 6ISBe 350 series P-6 diesel-fueled engine which powers the 4x4 wheeled arrangement and coupled to an Allison 6-speed automatic transmission system. The engine propels the vehicle to road speeds of 105 kmh out to a range not exceeding 850 kilometers. The hull is developed by Israel-based Plasan Sasa.\n\r\nThe vehicle measures an overall length of 6.4 meters, a beam of 2.5 meters, and a height of 3.3 meters - giving proper clearance for air transportation in the hold of both tactical- and strategic-type airlifters. Two crew are typically featured with seating for an additional eight personnel. Entry-exit is through four automobile-style hinged doors and a rear access point. The vehicle can ford water sources of 1.75 meters deep (some preparation is required) and cross 0.5 meter trenches. Its gradient traverse limited is 60%. The vehicle sits atop a Timoney (of Ireland) hydropneumatic suspension system which aids in cross-country travel.\n\r\nThis Typhoon entry was developed as a private venture in 2010 and unveiled in 2013. By 2020, it has become a fixture with Russian fighting forces.\r\n\t\t", "vehicle_name": "KAMAZ-53949 (Taifun K-53949)", "vehicle_type": "Mine-Resistant, Ambush-Protected (MRAP) Vehicle"}, {"id": "12766175-e334-4c80-9252-8afa66ed2880", "year_model": "2014", "description": "\r\n        \tKrasukha (\"Night Shade\") is the designation of the Russian Army's most capable, land-based Electronic Warfare (EW) system (\"Mobile Electronic Warfare Complex\"). Due to its wheeled nature, the system is inherently mobile, transported on the chassis of the BAZ-6910-22 four-axle, 8-wheeled military truck. In-the-field, the complete solution is used to counter / target enemy frequencies and signals. Production of the Krasukha has been ongoing since 2010 by the KRET Corporation and known variants include the 1L269 \"Krasukha-2\" and 1RL257 \"Krasukha-4\" models, these featuring an operational range of 155 miles (250 km) and 185 miles (300 km), respectively. The truck component is manufactured by the Bryansk Automobile Plant.\n\r\nElectronic Warfare is just one layer of a complex modern war which sees all manner of airborne, land-based, and ocean-going elements at play. The Krasukha is designed to counter the capabilities of radars deployed by such units in an active campaign, providing an active, mobile defense against guided missile attack, reconnaissance drones, enemy AWACS, and spy satellites as well as those systems receiving signals via GPS (Global Positioning Satellite) such as drones. The system relies on a multi-functional jamming component to target radar frequencies and radio-emitting sources while the physical section of the unit employs a series of radar dishes, antenna, and sensors atop a traversing mount.\n\r\nThe first major deployment of the Krasukha EW system is believed to have been during Syrian Civil War (2011-Present) by Russian forces supporting the Syrian regime. Since them, they are believed to have played a more limited role in the Nagorno-Karabakh conflict between Armenian and Azerbaijan. More recently, the jammer has been deployed during the Russian invasion of neighboring Ukraine (February 2022- Present).\n\r\nGlobal operators of the Krasukha system beyond the Russian Federation include long-time Soviet-Russian allies in Algeria, Iran, Libya, and Serbia.\r\n\t\t", "vehicle_name": "Krasukha MEWC", "vehicle_type": "Mobile Electronic Warfare Complex"}, {"id": "f2c73c46-0496-466f-ae36-b7ca7e60c6a9", "year_model": "1950", "description": "\r\n        \tBefore the arrival of surface-to-air, anti-aircraft missiles, nations depended on simple artillery-based guns to protect airspace. All of the major participants of World War 2 understood the value of these close-in defensive network systems and the Soviets proved no exception. At the end of the war, development continued on more powerful and capable anti-aircraft artillery systems to combat the forces of the West. These endeavors eventually produced the \"KS-19\" series of 100mm caliber in the late 1940s. The 100mm systems were intended to replace the aged 85mm systems then in use. Design of the KS-19 was attributed to L.V. Lulyev and these guns saw considerable combat actions in both the Korean and Vietnam wars, naturally on the side of the communists. Approximately 5,000 KS-19 guns were produced - some still seeing frontline active service with nations today.\n\r\nDesign-wise, the KS-19 was highly conventional in its approach and clearly showcased its World War 2 influence based on German and Soviet experiences. The system consisted of several major components making up the overall weapon which included the barrel, gun mount, platform and the transport carriage. The 100mm (3.94inch) barrel was of notable length and rifled for accuracy, further capped by a multi-baffled muzzle brake that dispelled gases away from the gun and crew. The barrel was set within a heavy duty mount which contained the recoil mechanism, elevation/traverse controls and gunnery platform for the operating crew. The carriage was wheeled with single rubber tires fitted to each corner of the assembly along steel rims with a folding vehicle tow loop installation at one end. Recoil absorbing \"legs\" were extended from the carriage sides and lowered for a firmer firing stance. Elevation was limited to +85/-3 degrees with a 360-degree traverse, this accomplished manually via various hand wheels. The crew would sit behind a small-area armored shield for some basic protection though no overhead, side or rear protection was given from the elements or battlefield dangers. The vehicle was traditionally towed by a heavy duty Soviet military tractor for it weighed over 21,000lbs and sported a 31 foot length to which the gun barrel was locked down for transport at one end of the carriage assembly. The firing action of the KS-19 consisted of a semi-automatic, horizontal sliding wedge breechblock system with a powered rammer and an automatic fuse-setter. All of this was tied to a PUAZO-6/19 directional system and a SON-9 series fire control radar array. The KS-19 crew consisted of no fewer than 15 personnel making up the various gunnery specialists, traverse/elevation personnel, ammunition handlers and setup/take down crew.\n\r\nAs an anti-aircraft defense weapon, the KS-19 was issued standardized high-explosive (HE), high-explosive fragmentation (HE-FRAG) and general fragmentation (FRAG) type single-piece, ready-to-fire projectiles. These served the weapon system well in their timed, area-detonated action in which the skies could be littered with exploding devices as enemy aircraft attempted to traverse the targeted airspace. Furthermore, the Soviets - like the wartime Germans before them - found the KS-19s inherent  firepower and penetration values suitable for the anti-armor role and developed equally suitable Armor-Piercing Tracer (AP-T) and Armor-Piercing Capped Tracer (APC-T) projectiles for this specific role. The KS-19 was also cleared to fire other like-minded 100mm-based projectiles as needed from the Soviet inventory, expanding its tactical, logistical and battlefield usefulness even more. A well-trained and experienced crew could let off up to 15 rounds per minute, provided good barrage fire into the sky - especially when linked to a network of such gun systems in defense of a given target area. Ranges against aircraft were out to 49,200 feet utilizing the proximity fuse and approximately 41,600 feet with the timed fuse. When used in the anti-armor role, the gun - now being fired horizontally as opposed to vertically - fielded a range of up to 13 miles.\n\r\nThe \"KS-19M2\" was one known variant of the KS-19 family line. In Chinese Army service, the gun was designated as the \"Type 55\".\r\n\t\t", "vehicle_name": "KS-19 (100mm Air Defense Gun)", "vehicle_type": "100mm Towed Anti-Aircraft Gun"}, {"id": "81d4fb17-945b-48b6-8252-77482da67445", "year_model": "1970", "description": "\r\n        \tThe M-240 is a Soviet Cold War-era smoothbore, heavy-class, vehicle-towed infantry mortar of 240mm caliber. The weapon fires a massive lethal projectile out to ranges of 9,700 meters (increased with rocket-assisted rounds). The weapon has been in service globally since the early-1970s and continues to be found on modern battlefields as a secondary solution.\n\r\nThe complete system utilizes a single-axle, twin-wheeled suspended carriage that features its own anchor / counter balance, sighting device, and elevation gear. The mounting hardware allows the barrel to take a \"muzzle-up\" stance when ready-to-fire and traversal of the gun tube is 18-degrees from centerline with an elevation span of +45 to +65 degrees. Due to the size and weight of the weapon and its ammunition, a crew of eleven personnel are required for optimal results. This still restricts the system to a rate-of-fire of just one projectile per minute.\n\r\nThe weapon is cleared to fire a variety of battlefield projectile types including High-Explosive (HE), High-Explosive (3F2 \"Gagara\"), FRAGmentation (HE-FRAG) (3O8 \"Nerpa\"), nuclear (3B11), and incendiary (\"Sayda\") types. Projectiles can weigh as much as 290lb.\n\r\nThe vehicle-mounted version of this same weapon is the 2S4 (SM-240) \"Tyulpan\" tracked carrier detailed elsewhere on this site.\n\r\nThe system has seen combat service since the days of the Cold War and includes exposure in the Yom Kippur War (1973) with Syria, the Soviet Invasion of Afghanistan (1985), the Lebanese Civil War (1975-1990), and the Syrian Civil War (2012-Present). Reports have shown the piece is still in use today during the ongoing Russo-Ukrainian War of 2022.\n\r\nThe M-240 continues to see operational service today (2022) though in far fewer numbers than at peak. Current operators include Bulgaria, Egypt, Russia, Syria, and Ukraine. Former operators are Czechoslovakia, Lebanon, and Romania.\r\n\t\t", "vehicle_name": "M-240 (240mm)", "vehicle_type": "Towed Heavy-class Mortar System"}, {"id": "b6c5bbf5-c13b-4968-b050-83e2c073334b", "year_model": "1955", "description": "\r\n        \tThe Soviet Army learned the value of tank-killing, armor-defeating weapons during World War 2 (1939-1945) when it squared off against the might of the Wehrmacht armored divisions. Most of the solutions centered around high-velocity, towed field guns with effective penetrating projectiles and it was this sort of thinking that continued for Soviets into the Cold War period (1947-1991). In 1955 was debuted a new, towed ant-tank gun and this product quickly became the standardized weapon of the Army and other Soviet-aligned nations and foreign allies followed in equipping the type. The MT-12 \"Rapira\" series was in operation service with Soviet forces up until the latter part of the 1980s but went on to serve a plethora of global operators from Algeria and Armenia to Ukraine and Uzbekistan - many of which continue to field the weapon even today (2017).\n\r\nThe MT-12 has also been recognized by the formal designation of \"2A19\" and also as the \"T-12\". The type was taken into service to replace the aging line of 100mm BS-3 series field guns which had been in service since 1944 (World War 2).\n\r\nAt the core of the T-12 design was its chosen 100mm projectile fired from a smoothbore barrel assembly. Compared to the BS-3, the MT-12 was given an all new gun tube and revised two-wheeled carriage to go along with a gun shield - all based on lessons learned from the fighting of World War 2. The barrel measured 63 calibers which made up a good portion of the overall length of 31 feet for the complete weapon system. The gun shield held a three-sided, angled appearance and was sloped for basic ballistics protection - a vision port being cut-out from the upper left side for the aimer. The carriage was of a traditional two-wheeled, rubber-tired design with tow arms located towards the rear. The wheels were elevated from the ground when the system was made ready-to-fire. The gun mounting hardware allowed for an elevation span of -6 to +20 degrees and traversal of 27-degrees right or left of centerline.\r\n\t\t", "vehicle_name": "MT-12 / 2A19 (Rapira)", "vehicle_type": "100mm Towed Anti-Tank (AT) Gun"}, {"id": "51494475-f54b-43a9-8d07-24503f7a6441", "year_model": "1968", "description": "\r\n        \tWorld War 2 warfare instilled on the Soviet Army the need for a very mobile armored force. After the war, the concepts proven in battle were furthered to all new levels. During the Cold War years, a slew of armored vehicles emerged with various battlefield roles in mind and one of these creations became the MT-LB multirole tracked vehicle. Development began in the 1960s, at the height of the Cold War between the Soviet Union and the West, to which the completed vehicle was adopted sometime in the latter part of the decade. Once identified by the West, the vehicle was designated in NATO nomenclature as the \"M1970\" (\"Model 1970\").\n\r\nThe MT-LB was developed as a direct replacement for the aged AT-P artillery tractor line. The design was largely formed from the work that also begat the successful PT-76 Amphibious Light Tank which was produced in over 12,000 examples. The initial product was the MT-L which then evolved to become the armored MT-LB. Production was assisted by the type utilizing many off-the-shelf components in circulation, and readily available, to the Soviet Army at the time. Manufacture was headed through the famous Kharkov tractor facility. The designation of \"MT-LB\" is born from the Russian translation describing \"Multi-Purpose, Light-Armored Towing Vehicle\".\n\r\nOne of the key qualities required of most any Soviet armored vehicle was amphibious support allowing the vehicle to cross moving water sources under its own power. The alternative was traversing bridges and similar checkpoints or arranging for engineers to construct a make-shift bridge over the span of hours and maybe days. The MT-LB was designed with this quality in mind, fully-amphibious, and propelled in the water by its own tracks, negating the need to activate a dedicated propulsion system.\r\n\t\t", "vehicle_name": "MT-LB (M1970)", "vehicle_type": "Multi-Purpose Tracked Vehicle"}, {"id": "3a1f9040-8a0d-4d37-a375-e75849722561", "year_model": "2011", "description": "\r\n        \tThe future battlefield looks to be robot-driven and Russian ground forces appear to be moving in that direction quicker than most. The \"Nerehta\" AUGV (Armed, Unmanned Ground Vehicle) is evidence of this - appearing as a remote-operator-driven, track-and-wheel battlefield infantry support vehicle. The type has been featured in Russian war games to date (2018) and adds an interesting element within existing modern Russian infantry doctrine. The vehicle is manufactured by the Degtyarev Plant of Russia and was first demonstrated in 2016. Testing of the product ensued in 2017 by Russian ground forces. It was further demonstrated at Army 2018.\n\r\nThe vehicle is of relatively compact form with an overall length of 2.5 meters, a width of 1.6 meters and a height of 900 meters. Its weight reaches 1,700 kilograms while its payload capacity is set around 700 kilograms. The vehicle sports the general appearance of a small tank, with its track-and-wheel arrangement seen on both sides of a low-profile hull. There are four double-tired road wheels to a hull side with the drive fitted aft and the track idler at front. Two track return rollers are used. Over center of the hull roof is a trainable, traversing weapons mount which sports a single (optional)  12.7mm Kord Heavy Machine Gun (HMG), Kalashnikov 7.62mm Medium Machine Gun (MMG) or 30mm AG-30M Automatic Grenade Launcher (AGL). For the transport role, this fitting is removed to make space for externally-mounted cargo. An operator is required for the proper battlefield function of this system and range of the remote-control is approximately 20,000 meters (extendable by way of mast assembly). Drive power is provided for by electric motors.\n\r\nThe Nerehta has been developed to take on a multitude of modern battlefield roles including general reconnaissance, artillery spotting/support, cargo transportation, and basic infantry fire support. its compact size certainly makes a good fit for lighter-armed elements such as airborne troopers and will most likely be a part of Russian Airborne in the near-future. The tank can also serve Army elements in urban fighting rather well. Its effectiveness on the battlefield will only be proven (or disproven) in time.\r\n\t\t", "vehicle_name": "Nerehta AUGV", "vehicle_type": "Armed Unmanned Ground Vehicle"}, {"id": "299064c8-fd96-4b30-8f0e-7c44e41f9173", "year_model": "2010", "description": "\r\n        \tThe RS-24 \"Yars\" (NATO codename of \"SS-29\") appears to be the successor to the SS-25 / SS-27 \"Topol\" mobile InterContinental Ballistic Missile (ICBM) launcher units. These vehicles were introduced in July 2010 and utilize the TEL MZKT-79221 eight-axle carrier vehicle as the launcher component. The rocket portion was evaluated in the mid-to-late 2000s before seeing introduction. The West believes these launchers to be in violation of the START Treaty as they perceive the design to be nothing more than an extension of the existing Topol missile series and launchers;  the Russians counter with the Yars being a direct response to the America-made missile shield being deployed to NATO allies across Europe near Russia's borders.\n\r\nThe missile component of Yars incorporates a solid-fueled booster rocket with an operational range out to 7,500 miles, reaching speeds in excess of 15,220 miles per hour. Guidance is through an inertial-based system and accuracy is within 250 meters. The launcher component is an eight-axle ultra-heavy-duty truck. The missile sits over the top of the truck and splits the forward mounted driving cab which overhangs the chassis. The sides of the hull are lined with large road wheels with a few of the axles being steerable. Special training is required for driving crews of the Yars mobile component.\n\r\nThe Yars system is deployed by Strategic Missile Troops of the Russian Army and currently stock the inventory of five divisions across the Russian frontier. At least twelve of the eighty-four deployed missiles are fixed, silo-based versions, leaving the remainder as mobile launch platforms.\r\n\t\t", "vehicle_name": "RS-24 Yars (SS-29)", "vehicle_type": "Mobile InterContinental Ballistic Missile (ICBM) Carrier Vehicle"}, {"id": "d660e899-89f0-44e7-b733-10332f0071dd", "year_model": "1978", "description": "\r\n        \tThe S-300 (NATO designation and codename of SA-10 \"Grumble) is a long-range surface-to-air missile system developed in the latter decades of the Cold War (1947-1991) years. The system was designed specifically to content with the rise in use of cruise missile weapons originating from the West which would have been used in the opening rounds of a full-scale war with the Soviet Union. The S-300 missile was developed by MKB from the period beginning in 1967 and entered Soviet military service in 1978. Consistent modernization programs have kept the S-300 series a viable battlefield instrument which, coupled to its powerful radar system, has let it remain a potent anti-aircraft defender despite its Cold War root. An export-minded version has also ensured its place among many global operators (mostly those with Soviet Cold war-era roots). The S-300 is comparable in its battlefield qualities and scope to the American MIM-104 \"Patriot\" battery and is now competing with designs such as the Chinese HQ-9 system recently adopted by Turkey over the Russian product.\n\r\nThe S-300 missiles are generally fielded through multiple-cell launchers which are fitted horizontally atop heavy industry trucks for mobility. The typical photographed transporter is an 8-wheeled vehicle with front-mounted engine and driving cabin offset to the left side of the chassis. The vehicle is deployed with its own dedicated radar vehicle to provide the scanning and tracking prowess required. When ready to launch, the launcher component of the vehicles is raised to a vertical position with setup time for the system being just five minutes. While the 8x8 chassis is typically used, the launchers can be set upon any wheeled or tracked vehicle capable of carrying the launcher's weight.\n\r\nThe S-300 missile and phased array radar series is highly-regarded in air-defense circles for its potency, even against modern aerial systems. Its radar can track upwards of 100 individual targets and can engage any twelve of them with improved qualities against any launched countermeasures. However, it deserves mention that no S-300 launcher/missile has been used in anger in any modern conflict to date (2013). Primary S-300 series missiles are the 9M82, 9M83 and 9M83ME reaching speeds in excess of 5,400 miles per hour and engagement altitudes of 98,000 feet depending on variant. These missiles carry a warhead of 330lb with guidance offered by a semi-active radar homing feature. Other missile types are also available, broadening the tactical value and foreign appeal of the S-300 family considerably.\r\n\t\t", "vehicle_name": "SA-10 (Grumble) / S-300", "vehicle_type": "Long-Range Anti-Aircraft Mobile Defense System"}, {"id": "bfb81052-4366-4a18-b2bc-4056116dd863", "year_model": "1979", "description": "\r\n        \tThe vast airspace over the Russian frontier and the combat-ready atmosphere of the Cold War required the Soviet Army to keep large collections of mobile surface to air missile platforms on hand. To further its reach, these systems were often times sold overseas to allied nations or satellite parties within the Soviet sphere of influence - intended to create all manner of headaches for Western warplanners, primarily the Americans. In 1970, the Soviet Army ushered in the SA-6 \"Gainful\" tracked mobile missile-based anti-aircraft system to counter low-to-medium flying threats - principally low-flying aircraft and helicopters. In the early 1970s, however, thought was already being given to complementing the existing system with a more advanced type capable of engaging all manner of threats at medium altitudes including cruise missiles. In 1972, Soviet government commissioned for such a system and its design would serve both land- and sea-based assets - the former in its basic tracked form and the latter in launcher only.\n\r\nOne of the key design detriments of the SA-6 Gainful series was multiple launchers reliant on a single fire control radar. The new missile system would, therefore, feature its own integrated fire control radar for improved tactical value. The 9M38 \"Buk\" missile was designed for placement atop a tracked chassis containing six double-tired road wheels to a track side with a rear-mounted drive sprocket. The completed system would sport a 360-degree traversing launch platform (with powered elevation) mounting 4 x 9M38 missiles.\n\r\nThe new missile system was evaluated during a period spanning 1977 into 1979 to which limited examples made their way into Soviet Army service in time until the system was formally cleared for service in 1980 (designated as the \"9K37-1 Buk-1\"). The requisite navalized variant became the 3S-90 \"Uragan\" and this followed in 1983. Recognition by NATO observers in the West produced the SA-11 \"Gadfly\" designation.\n\r\nThe complete systems package was designed around the 9M38 missile (later the 9M317 missile) which was powered by a solid propellant rocket motor. It sported an operational range out to 20 miles with a defended airspace up to 46,000 feet. The missile relied upon a semi-active radar homing guidance suite and detonated through a radar-based proximity fuse utilizing a fragmentation-high-explosive warhead in the nose cone. Stabilization fins were noted along the missile sides. Overall weight of individual missiles was 700kg. Each missile sported a running length of 5.55 meters. The benefit of such a system was its capability to be fired from various launch platforms not limited to a mobile, land-based vehicle. As such, fixed and naval variants could be developed from the basic design.\n\r\nBy 1983, the 9K37 family was modernized which subsequently led to development and acceptance of and improved missile with improved radar and further protection from enemy jamming signals intended to disrupt the service. The Soviet Army formally adopted this version in 1983 and an export mark then followed. Another modernization effort introduced an improved missile type - the 9M317 - that saw acceptance in 1998 and forced NATO to create the all-new SA-17 \"Grizzly\" designation to differentiate the two major production types. The Grizzly had the capability to track and intercept ballistic missiles in-air so range, accuracy and power were all improved. The land-based variant also ushered in an equivalent navalized form. A new missile with advanced capabilities was introduced in 2007. A vertical launch unit has also been developed.\n\r\n9K37 weapons were credited with the downing of at least four Georgian aerial drones during the fighting between Russia and Georgia during the South Ossetia War of 2008. Conversely, Georgian 9K37 systems downed four Russian aircraft in turn. During the conflict, the 9K37 proved its value to a very good extent. Despite its 1970s origins, the modernized forms could still keep pace with more modern aircraft and their respective countermeasures.\n\r\nBelarus and China have both produced localized copies of the Soviet/Russian 9K37 missile defense family. Both have been modernized in their own respective ways to keep them viable on the modern battlefield. Global operators of the Soviet/Russian design proper have included Belarus, China, Cyprus, Egypt, Finland, Georgia (by way of Ukraine), North Korea, Syria, Ukraine, and Venezuela. Russia maintains approximately 250 examples on hand.\r\n\t\t", "vehicle_name": "SA-11 (Gadfly) / 9K37 Buk", "vehicle_type": "Medium-Range Surface-to-Air Missile (SAM) System"}, {"id": "974e0fcb-70d3-4a7b-a06a-8da771215f64", "year_model": "1988", "description": "\r\n        \tThe S-300V (NATO codename of SA-12 Gladiator or Giant) was developed by the Soviets during the Cold War period (1947-1991) as part of the wider-ranging S-300 Anti-Aircraft (AA) Surface-to-Air Missile (SAM) defensive-minded line of vehicles. This series, however, ultimately emerged as a completely different form from the multi-wheeled S-300 airspace denial units. It was given to a different developer and manufacturer than those of the S-300 family while featuring altogether different missiles - the 9M82 \"Giant\" and the 9M83 \"Gladiator\". Two- and four-shot launcher forms were devised and the types have been fielded in the anti-ballistic missile role while also being able to provide protection against inbound aerial threats - such as aircraft and cruise missiles - at long range. It still sees service on today's battlefields despite its Cold War roots.\n\r\nThe S-300V series was taken into service in 1983 and full-strength was eventually before the end of the decade; around 1988.\n\r\nThe S-300V utilizes the chassis of the MT-T carrier tracked combat vehicle. The tracked nature of this chassis allows it to travel cross-country easily enough while keeping pace with the main mechanized fighting force. Over the top of the vehicle are large launch tubes housing the primary armament of 9M82 \"Giant\" or 9M83 series missiles and the launcher is hinged along the rear edge of the hull and propped upwards when the tubes are made ready-to-fire. The missiles can not only engage at long range but also high altitude - making them doubly-dangerous. A typical SA-12 arrangement in the Soviet/Russian ranks is up to six of these launcher vehicles assigned with a target detection/designation vehicle.\n\r\nChina has produced a local variant of the S-300V as the \"HQ-18\".\r\n\t\t", "vehicle_name": "SA-12 (Gladiator / Giant) / S-300V", "vehicle_type": "Long-Range, High-Altitude Self-Propelled Surface-to-Air Missile (SAM) System"}, {"id": "e25b9667-6d36-4fc5-b832-a22c458eac35", "year_model": "1979", "description": "\r\n        \tThe 9K35 \"Strela-10\" was developed by Soviet engineers to replace the 1960s-era 9K31 Strela-1 line (SA-9 \"Gaskin\") of mobile Surface-to-Air Missile (SAM) systems in service with the Red Army during the Cold War years. It was a budget alternative to more technology-laden programs of the period and therefore somewhat limited in terms of overall engagement capabilities. It lacked all-weather functionality though its more direct operator participation (it is optically-aimed and guided) made its engagement of aerial targets far less prone to jamming and evasion. Development work began in 1969 by KB Tochmash Design Bureau of Precision Engineering to which the 9K35 was taken into service in 1979. To NATO, the vehicle was known as the SA-13 \"Gopher\". It continues to see use today (2014), having been taken on by forces ranging from Afghanistan and Angola to Ukraine and Vietnam. Former operators include Czechoslovakia (dissolution), Poland, Slovakia, the Soviet Union, and Yugoslavia (dissolution). Modern Russian Army versions use a new missile.\n\r\nThe 13.55-ton SA-13 is built atop the existing hull and chassis of a slightly modified MT-LB multipurpose armored tracked carrier and therefore retains the same YaMZ-238 V diesel-fueled 240 horsepower engine and performance specifications of 37 miles per hour road speeds and 310 mile operational ranges. A torsion bar suspension allows for the necessary off-road capability and the hull is amphibious as in the original MT-LB, treading water at a 3-mile-per-hour-clip. Its crew numbers three - commander, driver, and gunner and armor protection is only against small arms fire, measuring 7mm thick. Primary armament is its four-shot 9M333 missile launcher which sits atop the hull on a trainable mount. The launchers are grouped as two pairs of launchers in a side-by-side format, the pairing separated by the radar array at center. The mounting hardware features full traversal and elevation controls. The launcher can also fire the older missiles of the Streal-1 family.\n\r\nThe original missile was the 9M31M of 1971 which used an impact and proximity fuse. This was followed by the 9M37 of 1976 and its proximity and impact fuse. Then came the 9M37M of 1981 and the 9M333 of 1989 - the latter introducing an eight-ray laser proximity and impact fuse. Maximum range has been progressively increased over the lifespan of the missile's evolution while minimum intercept altitudes have been steadily increased.\n\r\nOver the decades, the Strela-10 system has been continually improved to help expand its battlefield usefulness. This has produced the Strela-10M, Strela,10M2, and Strela-10M3 marks. Its combat service has ranged from the Angolan War (1975-2002) and Operation Desert Storm (1991) to the Kosovo War (1998-1999) and others though with mixed results.\r\n\t\t", "vehicle_name": "SA-13 (Gopher) / 9K35 Strela-10", "vehicle_type": "Self-Propelled, Tracked SAM System"}, {"id": "b6188f7a-f8fa-4901-a6ad-16504b13c93b", "year_model": "1986", "description": "\r\n        \tWith the rise of ever-faster and more powerful warplanes in the 1960s and 1970s, the missile age was forged as a direct counter. This led both the East and West of the Cold War period (1947-1991) to fund development of all manner of missile-based defenses. For the Soviet Union, this led to the creation of a new self-propelled Surface-to-Air Missile (SAM) system known as the 9K330 'Tor' (NATO codename of SA-15 \"Gauntlet\"). The system was specifically designed to engage aerial targets in the low-to-medium altitude envelopes - making it ideal for area defense.\n\r\nDesign work began in 1975 with Antey OKB leading the charge aided by MKB Fakel supplying the missile component. Manufacture of the series, introduced in 1986, was undertaken by IEMZ Kupol, Metrowagonmash (managing production of the tracked chassis), and MZKT (providing a wheeled chassis derivative). Production of the line has since spanned from 1983 until the present day and variants of the series now include the original 'Tor' and subsequent notable marks of enhanced capability - the 9K330 has been progressively modernized to keep it a viable air-defense missile platform for the foreseeable future.\n\r\nAt its core, the 9K330 features an operating crew of three and weighs in at 34 tonnes in its tracked chassis guise. Overall length of the chassis reaches 7.5 meters with a beam of 3.3 meters and a height up to the hull roof line of 5.1 meters. The tracking radar sits atop the hull and can be stowed away during transport. Power is from a V-12 diesel -fueled engine of 830 horsepower driving the conventional track-and-wheel running gear, the engine being mated to a hydromechanical gearbox. The hull is suspended atop a proven torsion bar suspension system ideal for offroad traveling and the vehicle complete can reach road speeds of up to 65 kmh and operate out to ranges of 500 kilometers - allowing it to keep up with the main mechanized force is need be.\n\r\nThe included solid-fueled, rocket-boosted missiles of the 9K330 SAM system are typically fielded in packs of four ready-to-launch munitions. These 10-foot long weapons are designed to engage more agile targets at range, the missiles reaching speeds of up to Mach 2. Guidance is through a command-input system allowing for changes/corrections on-the-fly while detonation is through an onboard proximity fuse-based arrangement. The base missiles have a listed engagement range out to 12 kilometers giving the overall vehicle a good \"reach\" in a warzone. The weapons can target and engage enemies at altitudes beyond 30,000 feet (depending on missile mark).\n\r\nThe Tor SAM system is currently (2020) operated by the military forces of Algeria, Azerbaijan, Armenia, Belarus, China, Cyprus, Egypt, Greece, Iran, Peru, Russia, Ukraine, Venezuela, Yemen, Morocco, and Syria. Russia is, by far, the largest operator of the series with some 172 units in service with production currently ongoing. Georgia and Kazakhstan has both given up use of the missile system.\n\r\nRussian forces deployed the Tor SAM system in the Syrian Civil War in support of the acting/current regime.\n\r\nVariants of the 9K330 SAM system include the original 9K330 'Tor' unit of 1986, these followed by the improved 9K331 'Tor M1' mark of 1991 which brought along the new 9M331 missile of greater accuracy and a multi-target engagement capability. The 9K332 'Tor-M2E' became an upgraded model of 2007 and marks the latest widespread version available - boasting an all-new, more accurate fire control capability as well as greater automation with increased reaction times. The smaller size of these missiles allow eight to be housed in a pack while engagement ranges are increased to 16 kilometers.\n\r\nThe 'Tor-M1-2U' is a model of 2012 given a broader target reach - therefore more useful against smaller UAVs becoming commonplace over the modern battlefield as well as traditional large fixed-wing aircraft and helicopters. An all-weather capability is built in, increasing the tactical flexibility of the unit. This form is beginning to become available in useful numbers as of this writing.\n\r\nThe 'Tor-M2KM' is more of a versatile \"mount-anywhere\" version with a 15 kilometer engagement range while the 'Tor-M2DT' is designed for cold weather operation (particularly in the Arctic environment where weather extremes prove more common). The 'Tor-2E' is a more mobile, versatile offering being marketed along with a wheeled vehicle chassis equipped with 16-shot missile modules and intra-vehicle communications for a shared exchange of target information.\n\r\nThe navalized form of the Gauntlet became the 3K95 'Kinzhal' (exported as 'Klinok') known to NATO as SA-N-9.  These missiles were introduced in 1989 and are similar in form and function to the 9M330 land-based weapons though optimized for on-water/over-water operation against aerial targets. The weapons are typically fitted on mid-to-large Russian Navy warships.\n\r\nThe HQ-17/FM-2000 is a Chinese variant thought to be based on the Soviet/Russian Tor SAM system.\n\r\nDespite its Cold War-era roots, the Tor SAM system maintains an active presence around the world, primarily with Soviet/Russian allied partners and nations.\r\n\t\t", "vehicle_name": "SA-15 (Gauntlet) / 9K330 Tor", "vehicle_type": "Self-Propelled Surface-to-Air Missile (SAM) Vehicle"}, {"id": "c0436f85-2169-49fb-b264-54328a0b0ac0", "year_model": "1982", "description": "\r\n        \tThe 2K22 \"Tunguska\" (NATO codename of SA-19 \"Grisom\") is a self-propelled, tracked air defense system that combines both rapid-fire automatic cannon power and surface-to-air missile capability. The targeting system relies on a radar sensor with fire control handled via IFF (Identification Friend or Foe). All of the primary tracking and engagement facilities are fitted to a traversing turret allowing for a base 360-degree arc of fire with elevation/depression at +80/-6 respectively. The vehicle is crewed by four personnel and powered by a V-46-4 turbocharged V12 water-cooled diesel engine outputting 780 horsepower. The Tunguska was developed and produced by the KBP Instrument Design Bureau between 1970 and 1980. Entering production in 1976, the Tunguska is in active service with a few forces as of this writing (2013).\n\r\nAs a tracked vehicle, the 2K22 has the inherent capability of moving off road as part of a mobile mechanized formation thanks to its engine fitting and hydropneumatic suspension system. The Tunguska features a top road speed of 40 miles per hour with an operational road range of 310 miles. The chassis can clear 1 meter obstacles.\n\r\nPrimary armament is 8 x missile launch tubes and this is supplemented by 2 x 30mm 2A38M cannons supported through 1,904 projectiles aboard. Missile support includes the 9M311, 9M311K, 9M311-1 or 9M113-M1 series missiles.\n\r\nThe type has since been produced in a handful of notable variants beginning with the 2K22 of 1982. The definitive production model then became the 2K22M of 1986 which was fielded on a GM-352M chassis. This was followed by the improved 2K22M1 of 1988 which was built upon the GM-5975 chassis and utilized a longer-range missile (9M311-M1) of 10 kilometers coupled to a modernized fire control system (FCS). The ultimate evolution of the Tunguska system is the 2K22M which features an all-new FCS and longer-range missile support (18 kilometers).\n\r\nThe 2K22 Tunguska will eventually be replaced in full within the inventory of the Russian military by the modern \"Pantsir-S1\" 8x8 wheeled anti-aircraft weapon system.\r\n\t\t", "vehicle_name": "SA-19 (Grisom) / 2K22 Tunguska", "vehicle_type": "Self-Propelled Air Defense System"}, {"id": "6eb9c967-ca23-4f7f-80fc-77f3c365ffd9", "year_model": "2007", "description": "\r\n        \tThe modern Russian military has made tremendous strides since the fall of the Soviet Empire - indeed it has gone on to surprise many-an-observer in the West with its latest developments. The country has long been a champion of a powerful air defense network and has keep investment in this sector strong resulting in systems such as the effective S-300 and improved 4th Generation S-400 \"Triumf\" mobile Surface-to-Air Missile (SAM) series. The S-300 was introduced into the Soviet inventory in 1978 and remains a potent air defense contributor while the S-400 has been brought along as its evolved form since arriving in 2007. Both are long range systems with proven capabilities.\n\r\nThe S-400 system functions under the SA-21 \"Growler\" designation in NATO nomenclature. It is described as being twice as effective as previous SAM units of Russian origin and supports the firing of five different missile types.\n\r\nDesign of the S-400 is by the Almaz / Antei Concern of Air Defense with manufacture handled by the Fakel Machine-Building Design Bureau.  The system encompasses a 6x6 wheeled heavy-duty military truck hauling a twin axle trailer containing the launcher unit. The launcher unit seats four large missiles which elevate to a vertical position when made ready for launch. The vehicle contains the entire crew aboard and serves as part of a Russian division. Work on the S-400 series began in the latter half of the 1990s though development proved slow and fraught with technological issues (understandable for such a complex product). Testing was undertaken before the end of the decade but the original missiles had a poor showing, delaying its service entry until the latter half of the 2000s. It has since become a Russian Army mainstay.\n\r\nThe S-400 is designed to fire off five different classes of missiles covering medium-range, long-range and \"extreme-long-range\". This has led to the development of at least three distinct missile types in the 9M96, 48N6 and 40N6 supporting the S-400 system. The 9M96 holds a range out to 120 kilometers while the 48N6 reaches out to 250km and the 40N6 out to 400km. Missile speeds span Mach 2.3 to Mach 6.2 depending on missile type in play.\n\r\nDue to its wheeled arrangement, the S-400 missiles can be transported along roads easily enough, providing a harder target to track down and destroy (ala the Iraqi SCUD launchers of the Persian Gulf War). It is said to hold lethality against all manner of Western aircraft - from smaller cruise missiles and regular combat aircraft to larger bomber types and reportedly even those aircraft protected by stealth features. Off road travel is possible as well though speeds are decidedly reduced during such actions. Automation has made for quick response times in setting up the S-400.\r\n\t\t", "vehicle_name": "SA-21 (Growler) / S-400 Triumf", "vehicle_type": "Mobile Surface-to-Air Missile (SAM) System"}, {"id": "3c28c6a4-23a0-4d1a-ba45-1a992ef2a9e6", "year_model": "2003", "description": "\r\n        \tWith ever-increasing capabilities being found in existing and next generation aircraft comes a desperate need for armies of the world to develop evolved air defense solutions. Such is the case with the Russian-originated \"Pantsir-1\", known to NATO as the \"SA-22 Greyhound\", a short- / medium-ranged, 8x8 wheeled, Self-Propelled (SP) Surface-to-Air Missile (SAM) system. The weapon system has been in active service (albeit in limited numbers) since 2003 and currently serves the Russian Army through over twenty examples as well as the army of Syria (a long-time Soviet customer). Furthermore, Algeria, Iraq, Jordan and the UAE are reported to have Pantsir-1 vehicles on order while Brazil is mentioned as a possible Pantsir-1 candidate in the near future. A naval version of the Pantsir-1 is also planned with the end-goal to equip various Russian naval destroyer warships and similar vessels with the potent defense product.\n\r\nThe Pantsir-1 is the actual surface-to-air component comprised of repeat-fire autocannons, a battery of missile launch tubes and an advanced integrated radar tracking/direction system. This component can, therefore, be affixed upon various chassis types including both wheeled and tracked as well as aforementioned warships. The wheeled version seen is a four-axle, 8x8 truck arrangement which an enclosed driving cab and attached operations cabin for the launch crew. The launcher component sits at the rear of the truck with an unfettered view of the action around the vehicle. The alternative identified form is a tracked offering with the launcher component affixed to the hull of a GM-352 vehicle. Development of the Pantsir-1 system began in 1990 as a replacement for the aging, though effective, \"Tunguska\" series anti-aircraft platforms.\n\r\nWork on a new air defense system culminated in a pilot vehicle (this on a Ural-5325 8x8 truck chassis) being unveiled in 1994. A more finalized version was showcased to potential customers during the 1995 MAKS show. However, lack of government funding slowed and ultimately shelved the project for a time until backers in the UAE provided the necessary capital to see the program through some five years later. The production model was then seen on the chassis of a KAMAZ-6560 8x8 truck and UAE Army versions were built atop the chassis of the MAN SZ 45 8x8 truck - showing the high adaptability of the Pantsir-1 system.\n\r\nThe Pantsir-1 is an all-modern, all-digital air defense weapon system coupling advanced tracking, search and engagement functionality to a hybrid cannon/missile armament to achieve high \"first-kill\" probability at short-to-medium ranges. Fixed upon the chassis of a mover vehicle, the Pantsir-1 becomes a capable mobile air defense platform ready to counter the challenges of the modern battlefield. The primary weapon system is the collection of 12 x 57E6 series radio-guided surface-to-air missiles held in four separate, three-tube launchers. The missile component is tied to 2 x 30mm 2A38M autocannons that fire can variable warhead types to suit the given defensive role. This \"one-two\" punch ensures a high kill probability against all manner of low-flying aircraft including fixed-wing, helicopters and cruise missile types. Fire control is directed by two phased-array, 360-degree coverage radar systems that reach out to detect at 36 kilometers while engagement can occur under 28 kilometers. The total vehicle crew is just three personnel - a driver for the vehicle and two system specialists for the launcher/guns.\n\r\nFirst combat use of the Pantsir-1 was through the Syrian Army when a system tracked and successfully downed an encroaching Turkish McDonnell Douglas RF-4E Phantom II reconnaissance aircraft in June of 2012. Beyond that, the exposure of the Pantsir-1 has been limited to due limited availability. That should drastically change with the number of systems currently on order - which may number as many as 250 units.\n\r\nIraq has received some Pantsir-S1 systems as part of a 48-strong deal with Russia signed in October of 2012.\r\n\t\t", "vehicle_name": "SA-22 (Greyhound) / Pantsir-S1", "vehicle_type": "Mobile Self-Propelled Anti-Aircraft System (SPAAS)"}, {"id": "243238d0-9ae7-4cf0-bfa5-38215ae0b8eb", "year_model": "1970", "description": "\r\n        \tDesign work on the 2K12 \"Kub\" system began in 1959 under the direction of NIIP/Vympel (for the missile) and MMZ (for the tracked chassis) at the behest of the Soviet government. After successfully completing the requisite trials (delayed by various technological challenges), the design entered serial production in 1968 which ran until 1985. The system was formally introduced into limited Soviet Army service in 1967 before seeing widespread use by 1970 and operations concerning the unit continue with many nations even today - despite its 1970s heritage. The type has since seen successful combat actions through the Yom Kippur War, the Chad Civil War, the Iran-Iraq War, the 1st Lebanon War, the 1991 Gulf War and the Yugoslav Wars of the 1990s. To date at least 500 launcher units have been processed with some 10,000 missiles delivered. NATO recognized the 2K12 as the SA-6 \"Gainful\".\n\r\nDesign of the 2K12 is centered around the use of three rail-launched guided missiles utilizing an optical sight and continuous wave target illuminator. Missiles can detonate on impact or be set with a proximity fuze and hold an effective range of 15 miles against targets up to 45,930 feet in altitude. Each is powered by a solid fuel rocket motor and can reach speeds of up to Mach 2.8 which places any modern aircraft at risk. The system is categorized as a low-to-medium altitude interception device and its tracked nature assures that it can be relocated to any positions in defense of key installations. In its tracked form, the chassis makes use of six double-tired road wheels with the drive sprocket at the rear of the hull. The crew is entirely sealed in their armored vehicle while the traversing launcher - fitting the three missiles - sits atop the hull roof.\n\r\nThe 2K12 was modernized in 1973 to become the 2K12 Kub-M1. A further evolution of the system produced the improved 2K12 Kub-M3 of 1976. This was then followed by the 2K12 Kub-M4 in 1978 which was based on the 2K1 Kub-M3 and developed to work in conjunction with the newer 9K37 \"Buk\" anti-aircraft missile systems - which were inspired by the 2K12 family. The export version of the 2K12 became the 2K12E \"Kvadrat\" and these have since seen widespread use in Soviet/Russian-allied states and countries. The 3M9M1 became a variant in 1977 that was given an all-new tracked chassis, recognized by NATO as the \"SA-6B\".\r\n\t\t", "vehicle_name": "SA-6 / 2K12 (Gainful / Kub)", "vehicle_type": "Mobile Surface-to-Air Missile (SAM) Defense System"}, {"id": "c4978980-bfe1-4fec-9365-3a597e0ca4d3", "year_model": "1972", "description": "\r\n        \tTo contend with ever-improving, more agile low-altitude aircraft emerging from the West during the Cold War, the Soviet military developed and ultimately adopted the 9K33 \"Osa\" (\"Wasp\") self-propelled, wheeled, amphibious Surface-to-Air Missile (SAM) vehicle. It was designated \"SA-8\" and codenamed \"Gecko\" by NATO once its existence was verified. Design work by the NII-20 Research Institute spanned from 1965 into the early 1970s to which the system began formal service in 1971 (continuing today - 2014). The SA-8 has proven a combat veteran, seeing action in the Lebanon Civil War (1982), the Angolan Civil War (1975-2002), the Persian Gulf War (1991), the South Ossetia War (2008), the Libyan Civil War (2011), and the Syrian Civil War (2011-present). It is estimated that some 1,200 units have been produced with several notable variants having appeared.\n\r\nThe 19-ton system features a vehicle section with a running length of 9 meters, width of 2.75 meters and a height of 4.2 meters. It's typical operating crew is five. The vehicle consists of a lightly-armored hull form atop a 6x6 wheeled chassis. The chassis supports cross-country travel while the hull is cleared for amphibious crossings which then played well into established Soviet ground warfare doctrine (forged largely by actions in World War 2 some decades earlier). The vehicle featured a D20K300 diesel-fueled engine of 300 horsepower output which provided driving ranges out to 500 kilometers and road speeds nearing 80 kmh. In water, the vehicle managed a pedestrian 8 kmh. The driving compartment lay at front in the usual way with the launcher component was sat over the rear of the vehicle, the radar element affixed over the frontal center mass. The six road wheels, three to a hull side, were large and well-spaced for good balance while the overall hull shape was quite shallow, presenting a smaller target along the horizon. The powered launcher component fitted two groups of three short-range missile launch tubes (for a total of six missiles) in a side-by-side arrangement - the launchers separated at center the radar component.\n\r\nThe missile series of choice became the \"9M33\" mark, a weapon weighing 170 kilograms with a length over 10 feet. Its diameter was 210mm while the warhead held a High-Explosive, FRAGmentation (HI-FRAG) payload with contact and proximity detonation. Propulsion was through a solid-propellant rocket booster aided by a guidance system with dual-thrust rocket steering for fine corrections. The missile reached an altitude of 39,000 feet and range over 9 miles with speeds over 1,000 meters per second.\n\r\nAs with other Soviet-sponsored weapon systems of the Cold War, the SA-8 found its way into the inventories of many Soviet-supported states, nations, and allies. This list included Algeria, Armenia, Azerbaijan, Belarus, Bulgaria, Cuba, Czechoslovakia (later the Czech Republic), East Germany (some sold to Greece post-reunification), Ecuador, Georgia, Greece (from Germany), India, Jordan, Libya, Poland, Romania, Syria, Turkmenistan, and Ukraine. Kuwait also fielded the type and many were captured in the 1990 Iraq invasion - now falling to the Iraqi defense inventory. Czechoslovakian models were absorbed into the new Czech Republic defense network but eventually phased out during 2006. Similarly, Soviet SA-8s were absorbed into the new Russian Army but these were modernized to contend with newer aerial threats - about 400 or so may still be in the active inventory. Belarus, Poland, and Jordan versions have followed suit and completed local modernizations to combat emerging regional threats.\n\r\nVarious official marks have resulting from the SA-8's lengthy, still-ongoing service career. 9K33 - the designation assigned the original incarnation by the Soviets - was the model of 1972 and designated SA-8A by NATO. The 9K33M was a navalized version and known to NATO as SA-N-4. In 1975, a new missile was used on the 9K33M2 and designated by NATO as SA-8B \"Gecko Mod-0\". The 9K33M3 then appeared in 1980 with upgraded missiles and improved engagement ranges to which NATO marked it as SA-8B \"Gecko Mod-1\". Export versions were known under the local name of \"Romb\". The 9K33-1T is a Belarusian upgrade. The Osa-AKM-P1 is a Polish approach.\n\r\nLatest active use of this SAM vehicle has been in the ongoing Syrian Civil War which began in 2011 as an offshoot of the Arab Spring from the 2010 revolutions.\r\n\t\t", "vehicle_name": "SA-8 (Gecko) / 9K33 OSA", "vehicle_type": "6x6 Wheeled Self-Propelled SAM Vehicle"}, {"id": "04c786fc-d1ed-4acb-8c8a-199fa014d293", "year_model": "1976", "description": "\r\n        \tWorld War 2 (1939-1945) finally brought to bear the power and lethality of in-direct missile strikes from one nation against another primarily through Germany's V-1/V-2 programs. In the post-war decades, the Soviets - already familiar with the inherent power of amassed formations of rocket projectors against its German foe - undertook considerable effort to bring about a plethora of missile/rocket-projecting solutions to bring to bear against the West should the Cold War ever have \"gone hot\". One of these creations, the OTR-21 \"Tochka\" (GRAU designation of \"9K79\", known to NATO as the SS-21 \"Scarab\") appeared in its original form in 1976.\n\r\nThis weapon, a 6x6 wheeled tactical ballistic missile launcher, has seen extensive combat service since, covering the clashes of the Yemeni Civil Wars (1994 and 2015), the First (1994-1996) and Second (2000-2009) Chechen wars, the Syrian Civil War (2011-Present), the War in Donbass (2014-Present), the Saudi involvement in Yemen (2015-Present), the Nagomo-Karabakh Conflict (2020), and the Russian invasion of neighboring Ukraine (2022).\n\r\nThe advancement of missiles led to larger, more powerful solutions that offered greater accuracy than that of carpeting an entire target area with rockets while still retaining the inherently terrifying psychological value. In-direct fire allows a launcher source to arc its lethal payload, from range, and rain down onto enemy positions or fixed targets, giving a tactical edge to the attacker in this scenario. The prospect of a wheeled delivery vehicle means that the system can be relocated to another firing location once resupplied with a fresh missile - however, this requires the commitment of accompanying resupply vehicles and additional support staff for optimal performance on the battlefield.\n\r\nSeries production of OTR-21 vehicles began in 1973 under the KBM (Kolomna) brand label followed by Soviet deployment of the mobile launchers in 1981 to East Germany. These were used to succeed an aging line of 9K52 \"Luna-M\" rocket projectors which arrived back in 1964.\n\r\nThe complete OTR-21 system involves a lightly-armored, all-wheel 6x6 military truck chassis capable of on-road / off-road travel seating a single missile launcher unit over the rear hull. The vehicle portion of the system is the 9P129. The rocket component - seated on the BAZ-5921 Mobile TEL launcher - is a single-stage, solid-fueled weapon with variable operational range depending on the production variant. These missiles reach speeds of Mach 5.3 and are guided to the target by inertial guidance systems (the \"Tochka-R\" version since added passive radar support to better engage radar-emitting installations).\n\r\nThe \"Scarab-A\" was the initial missile development of 1975 and could be used with High-Explosive (HE), FRAGmentation (FRAG), and nuclear warheads. These missiles featured an engagement range of about 43 miles but suffered from accuracy issues (error probability of less-than 490 feet). The \"Scarab-B\" (\"Tochka-U\") improved error probability accuracy by about 200 feet to less than 315 feet and range was enhanced to 75 miles. These missiles came online in 1989 after years of testing. B-models were then followed by the improved 'Scarab-C\" in the 1990s. Range was enhanced to 115 miles and error probability lowered to 230 feet - making for a much useful vehicle.\n\r\nMany former Soviet allies have since given up use of the OTR-21 system including Czechoslovakia (Czech Republic/Czechia), Poland, and Slovakia. However, the missile still remains in play for the forces of Russia, Ukraine, North Korea, Syria, Kazakhstan, Yemen, and others. Russian Army versions have been succeeded by the 9K720 \"Iskander\" series in time.\n\r\nThe OTR-21 has seen active use in the ongoing Russian invasion of Ukraine as Ukraine still fields it in number. About ninety were in inventory during peak usage.\r\n\t\t", "vehicle_name": "SS-21 (Scarab) OTR-21 Tochka", "vehicle_type": "6x6 Wheeled Ballistic Missile Launcher Vehicle"}, {"id": "19f639e2-5b46-4396-b99c-eb5441f722e9", "year_model": "1985", "description": "\r\n        \tBeyond maintaining land-based silos and a fleet of ballistic missile launching submarines, the Russian Army also maintains a squadron (Strategic Missile Troops) of mobile ballistic missile launcher vehicles through the RT-2PM \"Topol\" design, known to NATO as the SS-25 \"Sickle\". These massive vehicles were introduced in 1985 and are in active use with the modern Russian Army.\n\r\nThe missile component began development in July of 1977 as an improved version of an InterContinental Ballistic Missile (ICBM) able to reach any part of the world. It would be adopted to succeed an aging line of previous ICBM models then in inventory with the Soviet Army. By the middle of the 1980s, the missile had entered the requisite test stages and service introduction occurred that same year. Improvements made to the line followed into the 1990s to keep the weapon system a viable component of the modern battlefield.\n\r\nThe missile component carries the name of \"Topol\". it weighs some 99,400lb and has a length of 97 feet with a diameter of nearly 6 feet. The warhead is a single 800 kiloton fitting and the rocket motor a three-stage solid-fueled rocket engine. Range of the missile is out to 6,200 miles and the rocket can reach speeds of Mach 21 (16,000mph). An inertial autonomous guidance system guides the rocket along its course.\n\r\nThe carrier component of the Topol is the MZKT-79221 series ultra-heavy-duty trucks. These massive machines offer the strength and drive power needed in carrying the large ballistic missile to and fro. The vehicle's design is notable because of the multi-wheeled arrangement, seating eight axles with two-wheeled pairings each. The vehicle acts as the transporter erector launcher for the Topol missile and is a successor to the earlier MAZ-7917 vehicles, themselves having succeeded the MAZ-547 trucks of old. The operating crew is housed in a split forward cab at the front of the truck which overhangs the forward-most axle. The Topol missile itself overhangs the cab.\n\r\nThe Russian Army fields over 350 Topol missiles currently (2017). Modifications and modernizations to the system have continued. The Topol series is in service with the 35th Rocket Division stationed at Barnaul and this group maintains some 36 mobile launchers - though as many as 100 are thought to be on hand by Western observers.\n\r\nThe RT-2PM2 \"Topol-M\" is the latest incarnation of the mobile Topol system and is known to NATO as SS-27 \"Sickle B\".\r\n\t\t", "vehicle_name": "SS-25 / SS-27 / RT-2PM (Sickle / Topol)", "vehicle_type": "Mobile InterContinental Ballistic Missile (ICBM) Carrier"}, {"id": "e3b28ad0-3830-428c-9e19-4b49ef1ce2b4", "year_model": "2006", "description": "\r\n        \tThe 9K720 \"Iskander\" was introduced to Russian Ground Forces in 2006 as a successor to the aging line of OTR-21\" Tochka\" mobile (self-propelled) short-ranged ballistic missile systems. The Tochka was a Soviet product of the Cold War years, introduced in 1976, and went on to see considerable service - particularly with Soviet-aligned Middle East customers. The Iskander family improves upon capabilities needed of short-ranged ballistic missiles on the modern battlefield and thus far it has been exported only to Armenia and Nigeria while having seen combat action in the ongoing Syrian Civil War (2011-Present).\n\r\nThe 9K720 Iskander is recognized by NATO forces as the SS-26 \"Stone\".\n\r\nThe weapon system is made up of two critical components: the missile itself and a large 8x8 wheeled transport vehicle. The transport vehicle has four well-spaced axles featuring oversized rubber roadwheels. The driving cab is set at the bow well ahead of the forward-most pair of wheels. The aft section of the truck is used to house the ballistic missile which rests horizontally when at rest and is erected vertically when the missile is readied for firing. A series of support arms are lowered about the chassis of the vehicle to stabilize the launch platform.\n\r\nThe missile is a single-stage, solid-propellant based weapon with an operational range out to ranges between 30 and 300+ miles and speeds hypersonically through the sky nearing Mach 6. The guidance unit is inertial-based, aided by GPS with terminal homing and accuracy is said to be within seven meters of the intended strike zone. The weapon weighs 8,400lb, has a length of 24feet, and a diameter of 3 feet. Its warhead can be variable, supporting the gamut of High-Explosive (HE), thermonuclear, sub-munition, Fuel-Air Explosive (FAE), and Electro-Magnetic Pulse (EMP) types.\n\r\nVariants include the \"Iskander-M\" which has been taken into service with the Russians and appears tobe the base production model. The \"Iskander-K\" supports the launching of cruise missile-type weapons of the Russian inventory for broader tactical value. The export version of the SS-26 is recognized as \"Iskander-E\" and features reduced complexity to help protect sensitive Russian technology and offers a range out to 280 kilometers.\n\r\nRussian forces maintain a stock of about 136 launchers to date (2018). The weapon is thought to have been actively used in the Syrian Civil War by Russian forces operating there on behalf of the Assad government.\r\n\t\t", "vehicle_name": "SS-26 (Stone) / 9K720 Iskander", "vehicle_type": "Mobile Short-Ranged Battlefield Missile Launcher"}, {"id": "9bfd9f8f-5f5f-40ca-892e-a45dc5a6e57f", "year_model": "2016", "description": "\r\n        \tThe Soviets/Russians have always maintained a penchant for successful (and globally popular) tank designs since they unveiled their war-winning  T-34 Medium Tank during World War 2. The T-34 began a long-running history of capable, cost-effective combat machines designed to match - or in some cases surpass - available Western offerings. The Cold War-era T-72 proved no exception, granted with excellent speed for its class and an inherent reliability that is always require by the modern battlefield. Perhaps most important to procurement authorities, the T-72 was a budget-conscious end-product which could be produced in the tens of thousands during a period when every effort was being made to stay one step ahead of the United States and Europe in comparable developments. As such, the T-72 has gone on to see an extended service life in many foreign inventories and has undoubtedly proven an export success. With over 25,000 examples delivered, the T-72 ranks only second to the most successful post-World War 2 tank - the T-54/T-55 (with as many as 100,000 being built). In comparison, the wartime T-34 saw 84,000 units produced.\n\r\nThe T-72 originated as a design to counter the expensive nature of the technologically-advanced T-64 of 1963. The T-64 was the primary spearhead Soviet Main Battle Tank and introduced the D-81T 125mm smoothbore main gun. To this point, Western offerings relied on a rifled 105mm system and have since gone on to adopt a 120mm smoothbore design themselves. The T-64 also coupled the 125mm main gun with an automatic loader which reduced the crew size to three and contained overall operational weights to manageable levels while promoting a reduced profile on the horizon. The T-64B was the first Soviet tank line to support firing guided anti-tank missiles from the main gun barrel which broadened its tactical value considerably. However, its procurement costs proved limited and only 13,000 T-64 tanks were produced from 1951 to 1962 from plants originating in Russia, Belarus, Ukraine and Uzbekistan.\n\r\nThe prototype T-72 was born as the \"Object 172\" which evolved into the modified \"Object 172M\". Evaluations of this new vehicle were undertaken in 1971 and concluded the tank to be functional and capable, leading to its adoption as the \"T-72\" for the Red Army. Serial production began that same year, quickly replacing the T-55 and T-62 in production, and formal deliveries occurred the following. The T-72 was first unveiled to the public in the 1977 \"May Day\" parade and, amazingly, would retain its frontline status until the collapse of the Soviet Empire in 1991.\n\r\nExternally, the T-72 followed the tried-and-true doctrine of decades-long Soviet tank design. Much attention was always given to a very low profile from any angle and the addition of an autoloading mechanism lessened the turret crew to two personnel with the driver in the front-center of the hull (Western tanks generally utilize manual loading which required a fourth crewmember, a third person in the turret). The autoloading feature was devised as a carousel-type arrangement containing the charge in an upper rung and the projectile in a lower rung, brought together at the breech. The gunner could then respond to the commander's load and fire orders by electronically selecting the appropriate projectile and readying the main gun in this fashion. The commander's cupola was offset to the right of the turret roof and came complete with vision blocks. A integrated dozer blade was affixed to the underside of the bow to help plough tank obstacles or fill in anti-tank ditches with earth or sand.\r\n\t\t", "vehicle_name": "T-14 (Armata) (Object 148)", "vehicle_type": "Main Battle Tank (MBT)"}, {"id": "b11ac901-cbcf-4a36-86c1-3c2c9ebdd672", "year_model": "1958", "description": "\r\n        \tAfter the end of World War 2, the Soviet military had officially replaced their war-winning T-34 Medium Tank series with the T-54 family. These were then upgraded with NBC protection and a slew of other features to become the T-55 series a short time later, intended to counter the new, interim American developments. Going beyond simply upgrading the T-55, work also began on a new tank design based on the same proven T-54/T-55 system though intended to house a more powerful 115mm main gun. To fit the new armament, the base T-55 had her hull lengthened and given an all-new turret assembly designed specifically for a high-velocity smoothbore 115mm main gun - the U-5TS (2A20 \"Rapira\"). This weapon was of particular note for it marked the first time a production combat tank had been given a \"smoothbore\" barrel - to this point, all combat tanks fielded a rifled barrel, the Soviet direction proving a major upgrade to the 105mm rifled main gun being fielded by the new American M60. The new Soviet tank was christened the \"T-62\" and production of the type resulted in deliveries occurring in July of 1961.\n\r\nFor all intents and purposes, the T-62 was more or less a further upgrade of the T-55 itself with the T-54 still serving as the \"true\" starting point for the family. As such, the type delivered roughly the same utilitarian appearance of its originator as well as the follow-up modification. The tank sported a low-profile design with a center-fitted turret emplacement. The glacis plate was very shallow and well-sloped for excellent point ballistics protection. The sides were dominated by the track system encompassing five road wheels to a hull side. The drive sprocket was held at the front with the track idler at the rear. Like the T-54 and T-55 before it, the T-62 lacked any track return rollers along the upper track region. The single diesel engine was held in a rear-set compartment and could generate its own smoke screen as needed. The turret was well-curved and squat in its general appearance, housing the 115mm U-5TS main gun armament as well as three of the four crew. The crew consisted of the driver in the front-left hull and the tank commander, gunner and loader in the turret/middle hull region. The turret was protected by up to 242mm of armor thickness along the front facing.  A pair of external fuel tanks could be fitted to the rear of the hull for improved ranges and jettisoned when empty. The main gun was fitted with a fume extractor and featured two-axis stabilization for adequate \"firing-on-the-move\". The main gun was also given case ejector actuated by the recoil action to which spent shell casings were ejected automatically out of the turret rear via a spring-loaded door after firing. The main gun was supplemented by a coaxial 7.62mm PKT series machine gun in the turret for anti-infantry defense. A 12.7mm DShK anti-aircraft heavy machine gun on the turret roof was optional and not generally seen in early production units. Up to 40 x 115mm projectiles were carried aboard, stored within the turret itself and primarily along the hull sides. 2,500 x 7.62mm rounds of machine gun ammunition were also carried for the coaxial machine gun. Power was derived from a V-55 12-cylinder diesel engine outputting at 580 horsepower. This supplied the vehicle with a top speed of 31 miles per hour on ideal surfaces with an operational range of 280 miles not including environmental factors.\n\r\nThe main gun was cleared to fire the requisite High-Explosive (HE) and Armor-Piercing (AP) projectiles of 115mm caliber. The HE breed consisted of the HE-FRAG-FS which stood for High-Explosive, Fragmentation, Fin-Stabilized. The HEAT-FS rounds was the High-Explosive, Anti-Tank, Fin-Stabilized variant. The AP round was the APFSDS - Armor-Piercing, Fin-Stabilized, Discarding Sabot. This projectile could range out at targets up to 1,100 yards away and penetrate up to 330mm of armor plate - a major upgrade from the projectile types fired from the 100mm main guns of the T-54 and T-55 series. The main gun held an elevation limitation of -6 to +16 degrees. One of the key limitations of the T-54/55 models were their lack of true \"hull down\" firing due to the main gun's depression restriction. The T-62 improved upon this limitation to an extent.\n\r\nThe T-62 was delivered with several notable standardized features including NBC (Nuclear, Biological, Chemical) protection for the crew as well as an automated fire extinguishing system which could also be manually actuated. An integrated snorkel could be erected prior to entering bodies of water and provide the T-62 with limited amphibious capabilities. The engine was used to generate a smoke screen, this essentially accomplished by injecting raw diesel into the engine for the desired result. The commander, gunner and driver positions all included infrared night vision devices for true day/night fighting capability. To keep the tank from becoming bogged over a trench or obstacle, a unique \"unditching\" beam was fitted under at the rear of the hull.\r\n\t\t", "vehicle_name": "T-55", "vehicle_type": "Medium Tank / Main Battle Tank (MBT)"}, {"id": "5d8d5ebf-2e58-48d6-8473-73cdffcd14b3", "year_model": "1961", "description": "\r\n        \tAfter the end of World War 2, the Soviet military had officially replaced their war-winning T-34 Medium Tank series with the T-54 family. These were then upgraded with NBC protection and a slew of other features to become the T-55 series a short time later, intended to counter the new, interim American developments. Going beyond simply upgrading the T-55, work also began on a new tank design based on the same proven T-54/T-55 system though intended to house a more powerful 115mm main gun. To fit the new armament, the base T-55 had her hull lengthened and given an all-new turret assembly designed specifically for a high-velocity smoothbore 115mm main gun - the U-5TS (2A20 \"Rapira\"). This weapon was of particular note for it marked the first time a production combat tank had been given a \"smoothbore\" barrel - to this point, all combat tanks fielded a rifled barrel, the Soviet direction proving a major upgrade to the 105mm rifled main gun being fielded by the new American M60. The new Soviet tank was christened the \"T-62\" and production of the type resulted in deliveries occurring in July of 1961.\n\r\nFor all intents and purposes, the T-62 was more or less a further upgrade of the T-55 itself with the T-54 still serving as the \"true\" starting point for the family. As such, the type delivered roughly the same utilitarian appearance of its originator as well as the follow-up modification. The tank sported a low-profile design with a center-fitted turret emplacement. The glacis plate was very shallow and well-sloped for excellent point ballistics protection. The sides were dominated by the track system encompassing five road wheels to a hull side. The drive sprocket was held at the front with the track idler at the rear. Like the T-54 and T-55 before it, the T-62 lacked any track return rollers along the upper track region. The single diesel engine was held in a rear-set compartment and could generate its own smoke screen as needed. The turret was well-curved and squat in its general appearance, housing the 115mm U-5TS main gun armament as well as three of the four crew. The crew consisted of the driver in the front-left hull and the tank commander, gunner and loader in the turret/middle hull region. The turret was protected by up to 242mm of armor thickness along the front facing.  A pair of external fuel tanks could be fitted to the rear of the hull for improved ranges and jettisoned when empty. The main gun was fitted with a fume extractor and featured two-axis stabilization for adequate \"firing-on-the-move\". The main gun was also given case ejector actuated by the recoil action to which spent shell casings were ejected automatically out of the turret rear via a spring-loaded door after firing. The main gun was supplemented by a coaxial 7.62mm PKT series machine gun in the turret for anti-infantry defense. A 12.7mm DShK anti-aircraft heavy machine gun on the turret roof was optional and not generally seen in early production units. Up to 40 x 115mm projectiles were carried aboard, stored within the turret itself and primarily along the hull sides. 2,500 x 7.62mm rounds of machine gun ammunition were also carried for the coaxial machine gun. Power was derived from a V-55 12-cylinder diesel engine outputting at 580 horsepower. This supplied the vehicle with a top speed of 31 miles per hour on ideal surfaces with an operational range of 280 miles not including environmental factors.\n\r\nThe main gun was cleared to fire the requisite High-Explosive (HE) and Armor-Piercing (AP) projectiles of 115mm caliber. The HE breed consisted of the HE-FRAG-FS which stood for High-Explosive, Fragmentation, Fin-Stabilized. The HEAT-FS rounds was the High-Explosive, Anti-Tank, Fin-Stabilized variant. The AP round was the APFSDS - Armor-Piercing, Fin-Stabilized, Discarding Sabot. This projectile could range out at targets up to 1,100 yards away and penetrate up to 330mm of armor plate - a major upgrade from the projectile types fired from the 100mm main guns of the T-54 and T-55 series. The main gun held an elevation limitation of -6 to +16 degrees. One of the key limitations of the T-54/55 models were their lack of true \"hull down\" firing due to the main gun's depression restriction. The T-62 improved upon this limitation to an extent.\n\r\nThe T-62 was delivered with several notable standardized features including NBC (Nuclear, Biological, Chemical) protection for the crew as well as an automated fire extinguishing system which could also be manually actuated. An integrated snorkel could be erected prior to entering bodies of water and provide the T-62 with limited amphibious capabilities. The engine was used to generate a smoke screen, this essentially accomplished by injecting raw diesel into the engine for the desired result. The commander, gunner and driver positions all included infrared night vision devices for true day/night fighting capability. To keep the tank from becoming bogged over a trench or obstacle, a unique \"unditching\" beam was fitted under at the rear of the hull.\r\n\t\t", "vehicle_name": "T-62", "vehicle_type": "Medium Tank / Main Battle Tank (MBT)"}, {"id": "59e50890-9f79-4e46-96fc-68bfc0e3fb92", "year_model": "1966", "description": "\r\n        \tThe Soviets/Russians have always maintained a penchant for successful (and globally popular) tank designs since they unveiled their war-winning  T-34 Medium Tank during World War 2. The T-34 began a long-running history of capable, cost-effective combat machines designed to match - or in some cases surpass - available Western offerings. The Cold War-era T-72 proved no exception, granted with excellent speed for its class and an inherent reliability that is always require by the modern battlefield. Perhaps most important to procurement authorities, the T-72 was a budget-conscious end-product which could be produced in the tens of thousands during a period when every effort was being made to stay one step ahead of the United States and Europe in comparable developments. As such, the T-72 has gone on to see an extended service life in many foreign inventories and has undoubtedly proven an export success. With over 25,000 examples delivered, the T-72 ranks only second to the most successful post-World War 2 tank - the T-54/T-55 (with as many as 100,000 being built). In comparison, the wartime T-34 saw 84,000 units produced.\n\r\nThe T-72 originated as a design to counter the expensive nature of the technologically-advanced T-64 of 1963. The T-64 was the primary spearhead Soviet Main Battle Tank and introduced the D-81T 125mm smoothbore main gun. To this point, Western offerings relied on a rifled 105mm system and have since gone on to adopt a 120mm smoothbore design themselves. The T-64 also coupled the 125mm main gun with an automatic loader which reduced the crew size to three and contained overall operational weights to manageable levels while promoting a reduced profile on the horizon. The T-64B was the first Soviet tank line to support firing guided anti-tank missiles from the main gun barrel which broadened its tactical value considerably. However, its procurement costs proved limited and only 13,000 T-64 tanks were produced from 1951 to 1962 from plants originating in Russia, Belarus, Ukraine and Uzbekistan.\n\r\nThe prototype T-72 was born as the \"Object 172\" which evolved into the modified \"Object 172M\". Evaluations of this new vehicle were undertaken in 1971 and concluded the tank to be functional and capable, leading to its adoption as the \"T-72\" for the Red Army. Serial production began that same year, quickly replacing the T-55 and T-62 in production, and formal deliveries occurred the following. The T-72 was first unveiled to the public in the 1977 \"May Day\" parade and, amazingly, would retain its frontline status until the collapse of the Soviet Empire in 1991.\n\r\nExternally, the T-72 followed the tried-and-true doctrine of decades-long Soviet tank design. Much attention was always given to a very low profile from any angle and the addition of an autoloading mechanism lessened the turret crew to two personnel with the driver in the front-center of the hull (Western tanks generally utilize manual loading which required a fourth crewmember, a third person in the turret). The autoloading feature was devised as a carousel-type arrangement containing the charge in an upper rung and the projectile in a lower rung, brought together at the breech. The gunner could then respond to the commander's load and fire orders by electronically selecting the appropriate projectile and readying the main gun in this fashion. The commander's cupola was offset to the right of the turret roof and came complete with vision blocks. A integrated dozer blade was affixed to the underside of the bow to help plough tank obstacles or fill in anti-tank ditches with earth or sand.\r\n\t\t", "vehicle_name": "T-64", "vehicle_type": "Main Battle Tank (MBT)"}, {"id": "1b6a9571-2bfe-445d-a721-28014969d529", "year_model": "1972", "description": "\r\n        \tThe Soviets/Russians have always maintained a penchant for successful (and globally popular) tank designs since they unveiled their war-winning  T-34 Medium Tank during World War 2. The T-34 began a long-running history of capable, cost-effective combat machines designed to match - or in some cases surpass - available Western offerings. The Cold War-era T-72 proved no exception, granted with excellent speed for its class and an inherent reliability that is always require by the modern battlefield. Perhaps most important to procurement authorities, the T-72 was a budget-conscious end-product which could be produced in the tens of thousands during a period when every effort was being made to stay one step ahead of the United States and Europe in comparable developments. As such, the T-72 has gone on to see an extended service life in many foreign inventories and has undoubtedly proven an export success. With over 25,000 examples delivered, the T-72 ranks only second to the most successful post-World War 2 tank - the T-54/T-55 (with as many as 100,000 being built). In comparison, the wartime T-34 saw 84,000 units produced.\n\r\nThe T-72 originated as a design to counter the expensive nature of the technologically-advanced T-64 of 1963. The T-64 was the primary spearhead Soviet Main Battle Tank and introduced the D-81T 125mm smoothbore main gun. To this point, Western offerings relied on a rifled 105mm system and have since gone on to adopt a 120mm smoothbore design themselves. The T-64 also coupled the 125mm main gun with an automatic loader which reduced the crew size to three and contained overall operational weights to manageable levels while promoting a reduced profile on the horizon. The T-64B was the first Soviet tank line to support firing guided anti-tank missiles from the main gun barrel which broadened its tactical value considerably. However, its procurement costs proved limited and only 13,000 T-64 tanks were produced from 1951 to 1962 from plants originating in Russia, Belarus, Ukraine and Uzbekistan.\n\r\nThe prototype T-72 was born as the \"Object 172\" which evolved into the modified \"Object 172M\". Evaluations of this new vehicle were undertaken in 1971 and concluded the tank to be functional and capable, leading to its adoption as the \"T-72\" for the Red Army. Serial production began that same year, quickly replacing the T-55 and T-62 in production, and formal deliveries occurred the following. The T-72 was first unveiled to the public in the 1977 \"May Day\" parade and, amazingly, would retain its frontline status until the collapse of the Soviet Empire in 1991.\n\r\nExternally, the T-72 followed the tried-and-true doctrine of decades-long Soviet tank design. Much attention was always given to a very low profile from any angle and the addition of an autoloading mechanism lessened the turret crew to two personnel with the driver in the front-center of the hull (Western tanks generally utilize manual loading which required a fourth crewmember, a third person in the turret). The autoloading feature was devised as a carousel-type arrangement containing the charge in an upper rung and the projectile in a lower rung, brought together at the breech. The gunner could then respond to the commander's load and fire orders by electronically selecting the appropriate projectile and readying the main gun in this fashion. The commander's cupola was offset to the right of the turret roof and came complete with vision blocks. A integrated dozer blade was affixed to the underside of the bow to help plough tank obstacles or fill in anti-tank ditches with earth or sand.\r\n\t\t", "vehicle_name": "T-72 (Ural)", "vehicle_type": "Main Battle Tank (MBT)"}, {"id": "70e7db7a-9f3f-4999-a85b-1dbeb5ac6007", "year_model": "1976", "description": "\r\n        \tThe T-80 of the Russian Army was born in the era of the Soviet Empire during the Cold War. The type was a further evolution of the T-64 line with elements of the successful T-72 added for promising measure. The end result, the first production tank to utilize a gas turbine engine, proved a limited success with numbers never reaching those of its predecessor nor the overtly popular T-72. While still in active service today (2012), the days of the T-80 as a frontline battlefield solution are coming to an end as its available numbers are continually reduced with each passing year. The T-90 (based on the T-72) maintains the primary position in the modern Russian Army, leaving the T-80 as something of an interim solution at best,  a measure serving to bridge the gap between the expired Soviet-era T-64 and modern Russian Federation T-90.\n\r\nIn 1963, the Red Army began use of the T-64 Main Battle Tank which formed the spearhead of Soviet armor strength during the critical years of the Cold War. The T-64 incorporated an automatic loader coupled to a 125mm smoothbore main gun capable of firing guided anti-tank missiles. Its arrival certainly forced the West to take notice as it represented the most modern Red Army tank of the time. The T-72 was then developed in short order as a simpler, economical counterpart to the T-64, though it ended up surpassing the T-64 in both numbers and world popularity (some 25,000 T-72 tanks were produced to the 13,000 T-64s). Soviet tank doctrine called for both tank types to serve concurrently and allowed for financial flexibility in the long term. As the T-64 was considered something of a \"state secret\" in terms of its technology and capabilities, it was not openly exported as the T-72 was.\n\r\nAs such, the T-64 remained the principle high-tech Soviet Main Battle Tank to lead the Red Army onto victory in the event of total war across Europe. In the late 1960s, thought was already being given to a new design built upon the inherent strengths of the T-64. Many developmental tank designs had been in play since the close of World War 2 (1939-1945) for the Soviets and many of these went on to lay the foundation of Soviet tank technologies to come. Such developments began to refine a gas turbine engine that would one day be used in powering an armored vehicle though tank engineers would have to wait for technology to catch up with the desire.\n\r\nObject 288 was a tank testbed fitted with 2 x GTD-350 series aircraft turbine engines outputting at 690 horsepower. A second design, Object 219 SP1, utilized a single GTD-1000T multi-fuel gas turbine installation and this was able to output at 1,000 horsepower. After extensive testing of various chassis configurations, the Object 219 SP1 was modified into the refined Object 219 SP2 and it was this prototype that formed the basis of the \"T-80\". Design of the T-80 would span from 1967 until 1975 to which then serial production was ordered and the vehicle entered service in 1976 following the requisite army trials. Production of T-80s would last until 1992 to which 5,404 units would be delivered from LKZ and Omsk Transmash in Russia and Malyshev in the Ukraine. The gas turbine powerplant allowed for greater power over that of traditional diesel-fueled types at the expense of fuel consumption, general reliability and overall cost.\n\r\nIn keeping with Soviet tank design traditions, the T-80 managed a very low profile, exceptional inherent maneuverability and fielded a smoothbore main gun. The use of an autoloader in the turret reduced the traditional operating crew from four to three personnel to be made up of the driver (in the hull) and the commander and gunner (in the turret). The autoloader also allowed for a dimensionally shallower turret design and lighter overall weight. The tank's overall configuration was conventional with the engine at rear, the turret at center and the driver in front. The running gear of the T-80 consisted of six double-tired road wheels to a track side with the drive sprocket at the rear and the track idler at front. The upper track regions were protected over in side skirt armor. General armor protection is steel and composite which can be enhanced through add-on reactive armor blocks. Portions of the T-72's torsion bar suspension system was carried over into the T-80 which allowed for excellent inherent mobility for a vehicle of this weight class.\r\n\t\t", "vehicle_name": "T-80 (MBT)", "vehicle_type": "Main Battle Tank"}, {"id": "467f9019-f9ee-47fa-b4d2-192d0db39a0c", "year_model": "1995", "description": "\r\n        \tThe Soviets/Russians have always maintained a penchant for successful (and globally popular) tank designs since they unveiled their war-winning  T-34 Medium Tank during World War 2. The T-34 began a long-running history of capable, cost-effective combat machines designed to match - or in some cases surpass - available Western offerings. The Cold War-era T-72 proved no exception, granted with excellent speed for its class and an inherent reliability that is always require by the modern battlefield. Perhaps most important to procurement authorities, the T-72 was a budget-conscious end-product which could be produced in the tens of thousands during a period when every effort was being made to stay one step ahead of the United States and Europe in comparable developments. As such, the T-72 has gone on to see an extended service life in many foreign inventories and has undoubtedly proven an export success. With over 25,000 examples delivered, the T-72 ranks only second to the most successful post-World War 2 tank - the T-54/T-55 (with as many as 100,000 being built). In comparison, the wartime T-34 saw 84,000 units produced.\n\r\nThe T-72 originated as a design to counter the expensive nature of the technologically-advanced T-64 of 1963. The T-64 was the primary spearhead Soviet Main Battle Tank and introduced the D-81T 125mm smoothbore main gun. To this point, Western offerings relied on a rifled 105mm system and have since gone on to adopt a 120mm smoothbore design themselves. The T-64 also coupled the 125mm main gun with an automatic loader which reduced the crew size to three and contained overall operational weights to manageable levels while promoting a reduced profile on the horizon. The T-64B was the first Soviet tank line to support firing guided anti-tank missiles from the main gun barrel which broadened its tactical value considerably. However, its procurement costs proved limited and only 13,000 T-64 tanks were produced from 1951 to 1962 from plants originating in Russia, Belarus, Ukraine and Uzbekistan.\n\r\nThe prototype T-72 was born as the \"Object 172\" which evolved into the modified \"Object 172M\". Evaluations of this new vehicle were undertaken in 1971 and concluded the tank to be functional and capable, leading to its adoption as the \"T-72\" for the Red Army. Serial production began that same year, quickly replacing the T-55 and T-62 in production, and formal deliveries occurred the following. The T-72 was first unveiled to the public in the 1977 \"May Day\" parade and, amazingly, would retain its frontline status until the collapse of the Soviet Empire in 1991.\n\r\nExternally, the T-72 followed the tried-and-true doctrine of decades-long Soviet tank design. Much attention was always given to a very low profile from any angle and the addition of an autoloading mechanism lessened the turret crew to two personnel with the driver in the front-center of the hull (Western tanks generally utilize manual loading which required a fourth crewmember, a third person in the turret). The autoloading feature was devised as a carousel-type arrangement containing the charge in an upper rung and the projectile in a lower rung, brought together at the breech. The gunner could then respond to the commander's load and fire orders by electronically selecting the appropriate projectile and readying the main gun in this fashion. The commander's cupola was offset to the right of the turret roof and came complete with vision blocks. A integrated dozer blade was affixed to the underside of the bow to help plough tank obstacles or fill in anti-tank ditches with earth or sand.\r\n\t\t", "vehicle_name": "T-90", "vehicle_type": "Main Battle Tank (MBT)"}, {"id": "2e733127-f3f9-47d0-bc3f-4cc11abb1518", "year_model": "1988", "description": "\r\n        \tIt is standard practice for a proven tank design to make up a larger family of vehicles by way of proven running gear and operational experience. This helped to produce the TOS-1 (also \"TOC-1\") where the popular T-72 Main Battle Tank (MBT) chassis has formed the basis of a Multiple Launch Rocket System (MLRS). MLRSs are used as indirect fire weapons over range, often times attached to artillery regiments for massed firepower. Battlefield rockets have provided a tactical and psychological effect on enemy forces for generations and continues to do so today. Many modern armies stock special vehicles like MLRSs as a result.\n\r\nOmsk Transmash Design Bureau of the former Soviet Union headed design work on the vehicle in 1988. Obvious modifications to the existing T-72A model MBT included removal of its entire turret assembly, this structure accordingly replaced by a large and rectangular multi-shot rocket pack seated atop a traversing mount. The vehicle retained the original tank's crew of three and weighed 100,000 lb. Dimensions included a running length of 9.5 meters with a width of 3.6 meters and height of 2.22 meters. Power was through a standard V-84 diesel-fueled engine developing 840 horsepower. Performance specifications included a road speed of 37 miles per hour with an operational range out to 340 miles.\n\r\nThe multi-shot launcher pod was originally given 30 launch tubes in the TOS-1M variant. This was later reduced to 24 in the TOS-1A upgrade with sported a 3 x 8 tube arrangement. The rockets were of 220mm caliber and could carry variable warhead types to engage fortifications, light armored vehicles, and troops out in the open. The vehicle has been resupplied through a pair of accompanying TZM-T (KrAZ-255B) trucks which are modified especially for the rocket resupply role.\n\r\nPilot vehicles were evaluated operationally from 1988 into 1989 during the latter stages of the Soviet-Afghan War (1979-1989) and found to be useful short-to-medium range assault weapons. Their development was kept rather \"close to the vest\" for it was not until 1999 that the vehicle was actually showcased to the public and seen in military parades since. Production had been from 1988 onwards and appears to continue today (2015).\n\r\nThe TOS-1 has managed to survive the post-Soviet defense budget crunch and is in operational service with the modern Russian Army which has allowed it to see additional combat actions as was the case during the Battle of Grozny (1999-2000) against Chechnya forces. A few foreign operators also exist, these being former Soviet satellite countries and Cold War-era customers - Azerbaijan, Iraq, and Kazakhstan - though none have operate the TOS-1 family in the numbers that the Russians field.\n\r\nDuring 2001, the Russian Army adopted a modernized and improved version of the original TOS-1M as the aforementioned TOS-1A. Changes to the base design included a reduction in the number of launch tubes used, installation of a new ballistics computer, and increased engagement ranges out to 3.7 miles. \n\r\nIraqi TOS-1 vehicles were used as recently as 2014 where their firepower was brought to bear on elements of ISIS during the assault on Jurf Al Sakhar in October. These were upgraded TOS-1A systems.\r\n\t\t", "vehicle_name": "TOS-1 (TOC-1)", "vehicle_type": "Multiple Launch Rocket System (MLRS)"}, {"id": "28fdedbc-b9b8-4a5d-b54c-841a4acf3e3d", "year_model": "1978", "description": "\r\n        \tThe UR-77 \"Meterorit\" (\"Meteorite\") is a Soviet Cold War-era mine clearing / battlefield breaching vehicle. Design work was begun in 1977 and, utilizing the existing chassis of the 2A1 \"Gvozdika\" Self-propelled Artillery (SPA) chassis, the UR-77 was born. After its time in the Soviet Army, existing vehicles were taken over by the newly-established Russian Army forces. Beyond this, the vehicle has also been in operation service with the forces of Azerbaijan, Syria, and Ukraine and utilized in the First (1994-1996) and Second (1999-2000) Chechen wars, the Syrian Civil War (2011-Present), and the ongoing War in Donbas (the Russian Invasion of Ukraine; 2014-Present).\n\n\r\nBuilt atop the proven framework of the 2S1 SPA, the UR-77 shares the same track-and-wheel arrangement, powertrain, and powerpack. The running gear includes six small rubber-tired roadwheels to a hull side with the drive sprocket featured forward and the track idler aft.  The track link components run the entire length of the vehicle, are not supported by track-return rollers, and are not protected by armor skirts. The vehicle weighs 34,200lb (the 2S1 weighs around 35,300lb) and sits atop a torsion bar suspension system. A diesel engine of 300 horsepower provides drive power to the tank treads.\n\n\r\nAs the main armament of the 2S1 is removed in the UR-77, the standard operating crew is reduced from four to two (now just driver and commander) with the driver retaining his positioned at front-left in the hull. The same shallow glacis plate over the bow found on the 2S1 series enhances ballistics protection and the lack of a true traversing turret means that the reimagined vehicle has an even lower battlefield profile. The powerpack is contained to the front-right in the hull, allowing the rear of the hull to seat the line-breaching equipment.\n\r\nOver the rear of the hull is seated the launcher unit which raises up on a powered hinge for arced fire. Rocket-powered mine-clearing line charges are housed within a pair of launch tubes, firing out from the muzzle with the backblast being contained rear of the vehicle. Effective range of the weapon is approximately 300 feet. Upon hitting its mark, the line charge disrupts any armed, awaiting mine (even buried dangers), causing them to detonat. This destructive value is not lost on ground commanders either for the vehicle has been used to demolish standing structures that can house enemy elements.\n\r\nDespite its Cold War roots, the UR-77 continues to serve an active role in the modern Russian Army.\r\n\t\t", "vehicle_name": "UR-77 (Meterorit)", "vehicle_type": "Mine Clearing Vehicle"}, {"id": "88642d8e-18ac-437a-81dd-58bf4cacc14b", "year_model": "2014", "description": "\r\n        \tThe wars of the late 1990s and 2000s gave rise to a whole new class of armored vehicle called Mine-Resistant, Ambush-Protected (MRAP) providing frontline ground forces with enhanced protection in urban settings. The MRAP was used to good effect throughout the American and coalition wars in Afghanistan and Iraq where surprise attacks from mines, Improvised Explosive Devices (IEDs), and guerilla-style assaults proved commonplace. A long-time fixture of South African forces, the MRAP eventually became a mainstay of major fighting forces such as the United States, Great Britain, and Russia.\n\r\nOne of the available Russian forces is the KAMAZ-53949 - also known as the Taifun K-53949 - born of the versatile \"Typhoon\" line of vehicles manufactured en mass by the KamAZ concern of Russia. The general form entered serial production in 2014 and has branched to include various types in 4x4, 6x6, and 8x8 wheeled configurations. The K-53949 is a 4x4 wheeled form serving as both an Armored Personnel Carrier (APC) of sorts and an armored cargo vehicle.\n\r\nMRAPs get their classification from the ability to sustain extensive damage or showcase enhanced resilience from blasts that would otherwise destroy or debilitate a traditional light-armored wheeled vehicle. A typical design quality of such vehicles is a Vee-shaped undercarriage used to deflect blasts away from the vehicle and its occupants. In addition to this, blast-resistant seats are usually part of the design makeup, increasing the likelihood of passenger survival in active warzones. Other notable qualities include blast/bullet resistant walls and windows, gun ports, and multiple entry-exit hatches/doors.\n\r\nThe K-53949 utilizes a conventional automobile-style layout with the engine at front and crew/passenger cabin middle-aft. Large road tires are featured with a run-flat ability and the vehicle is given high ground clearance. Armor protection is against small arms fire and artillery spray. An amphibious quality is granted by way of a ducted, raised exhaust stack originating from the right side of the engine compartment. The rear of the vehicle can be configured for various battlefield roles including cargo-hauling, Command Post (CP), Anti-Tank Guided-Missile (ATGM) missile carrier, and battlefield ambulance (known as the \"Linza\"). Armament (including Remote Weapon Stations - RWSs) is variable and seated atop the roof of the vehicle for complete 360-degree traversal of the weapon emplacement. Also, any personal weapons carried by the occupants can come into play as needed.\n\r\nInterestingly, there is heavy reliance on Western components in the general makeup of the Russian-borne Taifun. This includes the Cummins 6ISBe 350 series P-6 diesel-fueled engine which powers the 4x4 wheeled arrangement and coupled to an Allison 6-speed automatic transmission system. The engine propels the vehicle to road speeds of 105 kmh out to a range not exceeding 850 kilometers. The hull is developed by Israel-based Plasan Sasa.\n\r\nThe vehicle measures an overall length of 6.4 meters, a beam of 2.5 meters, and a height of 3.3 meters - giving proper clearance for air transportation in the hold of both tactical- and strategic-type airlifters. Two crew are typically featured with seating for an additional eight personnel. Entry-exit is through four automobile-style hinged doors and a rear access point. The vehicle can ford water sources of 1.75 meters deep (some preparation is required) and cross 0.5 meter trenches. Its gradient traverse limited is 60%. The vehicle sits atop a Timoney (of Ireland) hydropneumatic suspension system which aids in cross-country travel.\n\r\nThis Typhoon entry was developed as a private venture in 2010 and unveiled in 2013. By 2020, it has become a fixture with Russian fighting forces.\r\n\t\t", "vehicle_name": "Ural Typhoon", "vehicle_type": "Mine-Resistant, Ambush-Protected (MRAP) Vehicle"}, {"id": "aa00101f-4495-4135-ae48-a9b5d13173fd", "year_model": "1961", "description": "\r\n        \tLogistics are at the heart of every well-fueled, well-armed military and, for the Soviet Union during its heyday, this was provided for - in part - by the ZiL-131 military truck. The truck arrived in all-wheeled, 6x6 triple-axle arrangement seating a pair of axles under the rear of the chassis. The driving cab positioned the driver at front-left with the engine compartment immediately forward. Production of the ZiL-131 was had from 1964 until 2012 at which point the AMUR plant was shuttered due to bankruptcy (then produced as the AMUR-531340). Despite this, sheer numbers of the truck ensure it a place on the modern battlefield.\n\r\nThe civilian market form is the \"ZiL-130\".\n\r\nFor its part in Soviet history, the ZiL-131 succeeded the ZiL-157 series trucks of 1958. These were similarly arranged in 6x6 with a driving cab aft of the engine and a flexible / modular rear flat bed. Unlike the ZiL-131, the ZiL-157 was only utilized by the Soviets, China, Vietnam, and North Korea but has, itself, been formally succeeded by the more modern ZiL-4334 series trucks in Russian service.\n\r\nDimensions of the base vehicle include an overall length of 7.04 meters, a width of 2.5 meters, and a height of 2.5 meters. Curb weight is 6,700 kilograms. Its payload can reach up to 5,000kg for in-road traveling (less so when going off road).\n\r\nKey qualities of the truck are its large road wheels and high ground clearance, allowing it to traverse cross-country and water sources. The suspension system includes solid axles coupled to leaf springs. Power is from a ZiL-130 6.0L V8 diesel engine mated to a 5-speed manual transmission system with 2-speed transfer case. A pair of 45-gallon gasoline tanks fuel the engine.\n\r\nThe versatility of the ZiL-131 is key to its success, having been the host vehicle for a variety of field solutions including the BN-21 \"Grad\" Multiple Launch, Rocket Projector (MLRS) vehicles (detailed elsewhere on this site) relied heavily on by the Soviet / Russian army. Beyond this, variants that have appeared include models utilized by border guard elements, specialized fire trucks, MEDEVAC, SCUD missile carriers, general transport (open flatbed or soft/hard covered), dedicated Command Posts (CPs), fuel tankers, and even mobile field bakeries.\n\r\nOperators of the ZiL-131 currently (2022) include many former Soviet allies and supported states - notable entries being Georgia, Poland, Romania, Russia, Syria, Ukraine, and Vietnam. Former operators are Czechoslovakia, East Germany, Iraq, and Yugoslavia.\r\n\t\t", "vehicle_name": "Ural-375", "vehicle_type": "6x6 Wheeled Military Truck"}, {"id": "4f1bb12c-b415-4bb4-a8bf-c7a43ca4ef20", "year_model": "1977", "description": "Ural Automotive Plant - Russia", "vehicle_name": "Ural-43206", "vehicle_type": "4x4 Light Cargo Military Truck"}, {"id": "f166ce83-cc20-49ba-9b3b-a949cc819868", "year_model": "1989", "description": "\r\n        \tLogistics remains at the heart of every military initiative. A massive land fighting force like the modern Russian Army understands this quite well and employs a vast collection of logistically-minded vehicles to support most any ground campaign. One of the tools of the force is the Ural-5323, an 8x8 wheeled military-grade truck, which entered series production at the close of the Cold War in 1989. It is actively manufactured today (2018) despite its Cold War-era origins.\n\r\nThe truck has four axles fitting two wheels each and these axles are separated in two forward pairs and two aft pairs. The roadwheels are large, providing the vehicle with excellent ground clearance aiding in cross-country travel. Over the front of the truck is the crew cab which seats the driver at front-left. Earlier production models fitted a cab from the company KAMAZ while later models moved to a new cab design developed with the assistance of Italian-based IVECO. The engine is situated forward in the design with the aft section taken up by the cargo bed which is typically covered from the elements. Up to 10 tons of goods can be hauled in this area and the truck can tow 16 tons as needed. Other features of the truck include a remote tire pressure control system, leaf spring suspension.\n\r\nThe unit is powered by a YaMZ-238B V-8 turbo-diesel engine of 300 horsepower (2,000rpm). This is mated to an 8x2 transmission system with locking transaxle differential. The truck can make a top speed of 53 miles per hour out to a range of 650 miles. These numbers are reduced some for cross-country traveling.\r\n\t\t", "vehicle_name": "Ural-5323", "vehicle_type": "Multirole 8x8 Wheeled Military Truck"}, {"id": "1bc3afa6-416b-4194-a216-16bc0436471d", "year_model": "1964", "description": "\r\n        \tLogistics are at the heart of every well-fueled, well-armed military and, for the Soviet Union during its heyday, this was provided for - in part - by the ZiL-131 military truck. The truck arrived in all-wheeled, 6x6 triple-axle arrangement seating a pair of axles under the rear of the chassis. The driving cab positioned the driver at front-left with the engine compartment immediately forward. Production of the ZiL-131 was had from 1964 until 2012 at which point the AMUR plant was shuttered due to bankruptcy (then produced as the AMUR-531340). Despite this, sheer numbers of the truck ensure it a place on the modern battlefield.\n\r\nThe civilian market form is the \"ZiL-130\".\n\r\nFor its part in Soviet history, the ZiL-131 succeeded the ZiL-157 series trucks of 1958. These were similarly arranged in 6x6 with a driving cab aft of the engine and a flexible / modular rear flat bed. Unlike the ZiL-131, the ZiL-157 was only utilized by the Soviets, China, Vietnam, and North Korea but has, itself, been formally succeeded by the more modern ZiL-4334 series trucks in Russian service.\n\r\nDimensions of the base vehicle include an overall length of 7.04 meters, a width of 2.5 meters, and a height of 2.5 meters. Curb weight is 6,700 kilograms. Its payload can reach up to 5,000kg for in-road traveling (less so when going off road).\n\r\nKey qualities of the truck are its large road wheels and high ground clearance, allowing it to traverse cross-country and water sources. The suspension system includes solid axles coupled to leaf springs. Power is from a ZiL-130 6.0L V8 diesel engine mated to a 5-speed manual transmission system with 2-speed transfer case. A pair of 45-gallon gasoline tanks fuel the engine.\n\r\nThe versatility of the ZiL-131 is key to its success, having been the host vehicle for a variety of field solutions including the BN-21 \"Grad\" Multiple Launch, Rocket Projector (MLRS) vehicles (detailed elsewhere on this site) relied heavily on by the Soviet / Russian army. Beyond this, variants that have appeared include models utilized by border guard elements, specialized fire trucks, MEDEVAC, SCUD missile carriers, general transport (open flatbed or soft/hard covered), dedicated Command Posts (CPs), fuel tankers, and even mobile field bakeries.\n\r\nOperators of the ZiL-131 currently (2022) include many former Soviet allies and supported states - notable entries being Georgia, Poland, Romania, Russia, Syria, Ukraine, and Vietnam. Former operators are Czechoslovakia, East Germany, Iraq, and Yugoslavia.\r\n\t\t", "vehicle_name": "ZiL-131", "vehicle_type": "6x6 Wheeled Military Truck"}, {"id": "f52f78eb-b9a7-40a7-a612-85b510e2dcc4", "year_model": "1965", "description": "\r\n        \tThe ZSU-23-4 \"Shilka\" system has been - and in many examples continues to be - a much-feared anti-aircraft system for pilots of low-flying aircraft all over the world. The effectiveness of the Shilka at low altitudes is a well documented story as the system has seen considerable action in several major global conflicts. The Shilka was initially reserved mainly for the Soviet Army and her (now former) supported states during the Cold War and went on to be exported heavily to ally nations in Asia, the Middle East, Africa and South America. The Shilka defense system continues to serve in some impressive quantities with several armies around the world despite her 1960s-era origins. At the time of her inception, no anti-aircraft gunnery platform in the NATO inventory could match the lethality that was the ZSU-23-4 Shilka series.\n\r\nThe Shilka came about through a need by the Soviet Army to upgrade its existing self-propelled anti-aircraft gun capabilities. Her primary adversaries of the time were the United States and Great Britain and both were fully capable of fielding top-of-the-line ground attack aircraft including helicopters that would - in the event of all-out war in Europe - be called to limit the usefulness of Soviet armor. At the time, the primary system available to the Red Army was the ZSU-57-2 tracked series mounting a powerful set of 57mm cannons. However, despite this large-caliber armament, the system was inherently limited by its optically aimed tracking system, lack of integrated radar with no provision for engaging targets while \"on the move\". Onboard ammunition storage capability was also limited to just 300 rounds of 52mm projectiles.\n\r\nDevelopment on a replacement began in 1957 and continued into 1962. The new design - to become the ZSU-23-4 (otherwise known as the \"Shilka\" after the Shilka River found in Eastern Russia)  - incorporated the tracked chassis of the GM-575 with a flat, rounded turret system mounting 4 x 23mm rapid fire autocannons. A water-cooling system was fitted to keep the guns from overheating and at least 2,000 of 23mm ammunition could be carried aboard. A radar system (the RPK-2 \"Tobol\") was installed to aid the crew in the tracking and engagement of targets along the rear of the turret roof. The vehicle would be crewed by four personnel made up of a driver, commander, gunner and radar operator with the driver located at the forward portion of the hull and the rest of the crew in the turret. The turret was set at the middle of the hull roof with the engine mounted in a rear compartment. The vehicle utilized six rubber-tired road wheels with a long running set of tracks which gave good cross-country mobility in keeping up with Soviet armored formations. This effectively allowed  the weapon to be stationed just about anywhere a tank or similar wheeled vehicle could. The turret allowed for a full 360-degree traversal with extensive elevation that would let the crew engage both low-flying aerial targets as well as ground-based ones. Aerial targets could be engaged at 2.5 miles out while land-based ones at 1.5 miles. The radar itself could pick up targets as far out as 12 miles allowing the crew to be prepared to greet. Armor protection for the crew ranged from over 9mm on the turret to 15mm on the hull. Power was supplied from a V-6R series 6-cylinder, 4-stroke airless-injection water-cooled diesel engine developing 280 horsepower that allowed for speeds up to 50km/h on roads with a range out to 450km. The hull was seated on an individual torsion bar suspensions system with hydraulic shock absorbers fitted to several of the wheel pairings. Production by Mytishchi Engineering Works began in 1964 and continued on to 1982 to which some 6,500 examples were produced all. The ZSU-23-4 formally entered service in 1965 and over 38% of the production total went to serve in 23 countries around the globe.\r\n\t\t", "vehicle_name": "ZSU-23-4 (Shilka)", "vehicle_type": "Self-Propelled Anti-Aircraft Gun (SPAAG)"}]